Функция ПолучитьОстаткиНаСкладах(Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад.Наименование КАК Склад,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;		
	
КонецФункции      

Функция ПолучитьОстаткиВЯчейках(Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Ячейка.Наименование КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыВЯчейкахОстатки.Ячейка.Владелец.Наименование КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыВЯчейкахОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;		
	
КонецФункции

Функция ПолучитьОстаткиВЯчейке(Ячейка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыВЯчейкахОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТоварыВЯчейкахОстатки.Характеристика.Наименование КАК ХарактеристикаНаименование
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьОстаткиВЯчейкеДляРазмещения(Результат, Ячейка) Экспорт
	
	ЕстьСерии = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК НоменклатураСсылка,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК ХарактеристикаСсылка,
		|	ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения КАК УпаковкаСсылка,
		|	ТоварыВЯчейкахОстатки.Серия КАК СерияСсылка,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Номенклатура) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Характеристика) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения) КАК Упаковка,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Серия) КАК Серия
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период, ) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Упаковка) КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодНоменклатуры,
		|	ЕСТЬNULL("+Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("ШтрихкодыНоменклатуры.Упаковка","ШтрихкодыНоменклатуры.Номенклатура")+", 1) КАК КоэффициентУпаковки
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика, ШтрихкодыНоменклатуры.Упаковка) В
		|			(ВЫБРАТЬ
		|				ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|				ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		|				ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка
		|			ИЗ
		|				РегистрНакопления.ТоварыВЯчейках.Остатки(&Период, ) КАК ТоварыВЯчейкахОстатки
		|			ГДЕ
		|				ТоварыВЯчейкахОстатки.Ячейка = &Ячейка)";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивРезультатов[0].Выгрузить();
	РезультатЗапроса2 = МассивРезультатов[1].Выгрузить();
	
	РезультатЗапроса.Колонки.Добавить("ГУИДНоменклатуры", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДХарактеристики", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДУпаковки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДСерии", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		Строка.ГУИДНоменклатуры = Строка.НоменклатураСсылка.УникальныйИдентификатор();
		Строка.ГУИДХарактеристики = Строка.ХарактеристикаСсылка.УникальныйИдентификатор();
		Строка.ГУИДУпаковки = Строка.УпаковкаСсылка.УникальныйИдентификатор();
		
		Если ЗначениеЗаполнено(Строка.СерияСсылка) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.СерияСсылка);
			Строка.ГУИДСерии = Строка.СерияСсылка.УникальныйИдентификатор(); 
			ЕстьСерии = Истина;
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса.Колонки.Удалить("НоменклатураСсылка");
	РезультатЗапроса.Колонки.Удалить("ХарактеристикаСсылка");
	РезультатЗапроса.Колонки.Удалить("УпаковкаСсылка");
	РезультатЗапроса.Колонки.Удалить("СерияСсылка");
	
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));		
	Результат.Вставить("ТаблицаШК",ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса2));		
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("Ячейка", Ячейка.Наименование);
	Результат.Вставить("ГУИДЯчейки", Ячейка.УникальныйИдентификатор());
    Результат.Успешно = Истина;
	Возврат Результат;
КонецФункции

