//Запрос с сериями товара, первоисточник
// ЦеныПредприятияЗаполнениеСервер.ПолучитьЦенуПоОтбору

#Область OZON   

Функция ОбновитьЦеныПоАккаунту_OZON(Данные, Аккаунт) Экспорт
	
	КоличествоЗапросов 	   = 0;
	КоличествоНоменклатуры = 0; 
	КоличествоОтправлений  = 0;
	ВыполнениеЦикла        = Истина;
			
	ТаблицаДанных = Данные.Скопировать();
	ТаблицаДанных.Очистить();
	
	Если (Данные.Количество() - 1) >= 1000 Тогда    
		
		Пока ВыполнениеЦикла Цикл
		
		Если КоличествоНоменклатуры = 1000 Тогда 
				
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			HTTPОтвет = рар_мп_Ozon_Методы.Метод_ОбновитьЦены(Аккаунт, ТаблицаДанных); 
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			СтруктураДанных = Новый Структура;
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Комментарий = HTTPОтвет.ОтветAPI.message;
					
					ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче остатков Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
					Комментарий,);
					СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
					СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
					СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
					
					Возврат СтруктураДанных;
					
				Иначе
					
					Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
					ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче цен номенклатуры Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
					Комментарий,); 
					СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
					СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
					СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
					
					Возврат СтруктураДанных;																						  
					
				КонецЕсли;	
				
			КонецЕсли; 
			
			КоличествоНоменклатуры = 0; 
			ТаблицаДанных.Очистить();
			
		КонецЕсли;
		
		
		Если ТаблицаДанных.Количество() - КоличествоОтправлений * 1000 >= 1000 Тогда
			
			Пока КоличествоНоменклатуры <= 1000 Цикл
				
				НоваяСтрока = ТаблицаДанных.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Данные[КоличествоНоменклатуры + КоличествоОтправлений * 1000 ]); 
				КоличествоНоменклатуры = КоличествоНоменклатуры + 1;
				
			КонецЦикла;
			
			КоличествоОтправлений = КоличествоОтправлений + 1;
			
		Иначе
			
			Для каждого Элем из ТаблицаДанных Цикл
				
				НоваяСтрока = ТаблицаДанных.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем); 
				КоличествоНоменклатуры = КоличествоНоменклатуры + 1; 
				
			КонецЦикла;
			
			ВыполнениеЦикла = Ложь;
			
		КонецЕсли;
		
		КонецЦикла;
		
	Иначе
		
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_ОбновитьЦены(Аккаунт, Данные); 
		
		СтруктураДанных = Новый Структура;
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Комментарий = HTTPОтвет.ОтветAPI.message;
				
				ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче остатков Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
				Комментарий,);
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
				
				Возврат СтруктураДанных;
				
			Иначе
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче цен номенклатуры Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
				Комментарий,); 
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
				
				Возврат СтруктураДанных;																						  
				
			КонецЕсли;	
			
		Иначе
			
			СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);		
			
			Возврат СтруктураДанных;	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_ОбновитьЦены(Аккаунт, ТаблицаДанных); 
		
		СтруктураДанных = Новый Структура;
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Комментарий = HTTPОтвет.ОтветAPI.message;
				
				ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче остатков Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
				Комментарий,);
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
				
				Возврат СтруктураДанных;
				
			Иначе
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				ЗаписьЖурналаРегистрации(СТРШаблон("Ошибка при передаче цен номенклатуры Ozon по Аккаунту %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния), УровеньЖурналаРегистрации.Ошибка,,, 
				Комментарий,); 
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передачи цен. Подробности в журнале регистрации"); 
				
				Возврат СтруктураДанных;																						  
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;		
	
	СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
	
	Возврат СтруктураДанных;	
	
КонецФункции

#КонецОбласти

#Область ЯндексМаркет      

Функция ОбновитьЦеныПоАккаунту_ЯндексМаркет(Данные, Аккаунт, campaignId) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	Если Данные.Количество() <= 2000 Тогда
		
		Для Каждого Магазин Из campaignId Цикл
			
			HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_УстановкаЦенНаТоварыВКонкретномМагазине(Данные, Аккаунт, Магазин);
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Если HTTPОтвет.КодСостояния <> 200 Тогда
					
					НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
					
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
					
					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
												Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
					СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
					СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
					
					Возврат СтруктураДанных;
					
				Иначе
					
					Если HTTPОтвет.ОтветныеДанные.status = "ERROR" Тогда
						
						НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
						
						ОписаниеОшибки = "При обработке запроса произошла ошибка";
						
						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
													Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
						СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
						СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
						
						Возврат СтруктураДанных;
						
					КонецЕсли;
					
					ВремяОжидания = 60;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
				
				Возврат СтруктураДанных;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ПакетыЗапросов = РазделитьТаблицуНаПакеты(Данные, 2000);
		
		Для Каждого Пакет Из ПакетыЗапросов Цикл
			
			Для Каждого Магазин Из campaignId Цикл
				
				HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_УстановкаЦенНаТоварыВКонкретномМагазине(Пакет, Аккаунт, Магазин);
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если HTTPОтвет.КодСостояния <> 200 Тогда
						
						НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
						
						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
													Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
						СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
						СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
						
						Возврат СтруктураДанных;
						
					Иначе
						
						Если HTTPОтвет.ОтветныеДанные.status = "ERROR" Тогда
							
							НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
							
							ОписаниеОшибки = "При обработке запроса произошла ошибка";
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
														Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
							СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
							СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
							
							Возврат СтруктураДанных;
							
						КонецЕсли;
						
						ВремяОжидания = 60;
						
						ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
						
						Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
							// Ожидаем время для следующего запроса	
						КонецЦикла;
						
					КонецЕсли;
					
				Иначе
					
					НазваниеОшибки = "Ошибка при установке цен в Яндекс Маркет";
					
					ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
					
					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
												Символы.ПС, Аккаунт, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
					СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
					СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
					
					Возврат СтруктураДанных;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("КодСостояния", 200);		
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область Wildberries

Функция ОбновитьЦеныПоАккаунту_Wildberries(Данные, Аккаунт, УстановкаЦенWBКлуба) Экспорт
	
	СтруктураТоваров = Новый Структура();
	
	РазделитьТоварыПоРазмерам_Wildberries(СтруктураТоваров, Данные, УстановкаЦенWBКлуба);
	
	Если СтруктураТоваров.ТоварыБезРазмеров.Количество <> 0 Тогда
		Ответ = УстановитьЦенуНаТоварыБезРазмера_Wildberries(Аккаунт, СтруктураТоваров.ТоварыБезРазмеров);
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат Ответ;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураТоваров.ТоварыСРазмерами.Количество() <> 0 Тогда
		Ответ = УстановитьЦенуНаТоварыСРазмером_Wildberries(Аккаунт, СтруктураТоваров.ТоварыСРазмерами);
		
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат Ответ;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если УстановкаЦенWBКлуба И СтруктураТоваров.ТоварыСоСкидкойWBКлуба.Количество() <> 0 Тогда
		Ответ = УстановитьСкидкуНаТоварыWBКлуба_Wildberries(Аккаунт, СтруктураТоваров.ТоварыСоСкидкойWBКлуба);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура РазделитьТоварыПоРазмерам_Wildberries(СтруктураТоваров, Данные, УстановкаЦенWBКлуба)
	
	ТоварыБезРазмеров = Новый ТаблицаЗначений;
	ТоварыБезРазмеров.Колонки.Добавить("АртикулWB");
	ТоварыБезРазмеров.Колонки.Добавить("Цена");
	ТоварыБезРазмеров.Колонки.Добавить("Скидка");
	
	ТоварыСРазмерами = Новый ТаблицаЗначений;
	ТоварыСРазмерами.Колонки.Добавить("АртикулWB");
	ТоварыСРазмерами.Колонки.Добавить("IDРазмера");
	ТоварыСРазмерами.Колонки.Добавить("Цена");
	
	ТоварыСоСкидкойWBКлуба = Новый ТаблицаЗначений;
	ТоварыСоСкидкойWBКлуба.Колонки.Добавить("АртикулWB");
	ТоварыСоСкидкойWBКлуба.Колонки.Добавить("Артикул1С");
	ТоварыСоСкидкойWBКлуба.Колонки.Добавить("Скидка");
	
	Для Каждого Строка Из Данные Цикл
		
		Если Строка.ВозможностьСменыЦенДляРазмеров Тогда
			
			СтрокаСРазмером = ТоварыСРазмерами.Добавить();
			СтрокаСРазмером.АртикулWB 	= Строка.УникальныйНомер;
			СтрокаСРазмером.IDРазмера 	= Строка.IDРазмера;
			СтрокаСРазмером.Цена 		= Строка.ВидЦены_Цена;
			
		Иначе
			
			СтрокаБезРазмера = ТоварыБезРазмеров.Добавить();
			СтрокаБезРазмера.АртикулWB 	= Строка.УникальныйНомер;
			СтрокаБезРазмера.Цена 		= Строка.ВидЦены_Цена;
			СтрокаБезРазмера.Скидка 	= Строка.СкидкаWB;
			
		КонецЕсли;
		
		Если УстановкаЦенWBКлуба Тогда
			
			НайденныеСтроки = ТоварыСоСкидкойWBКлуба.НайтиСтроки(Новый Структура("Артикул1С", Строка.Артикул));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтрокаСоСкидкойWBКлуба = ТоварыСоСкидкойWBКлуба.Добавить();
				СтрокаСоСкидкойWBКлуба.АртикулWB 	= Строка.УникальныйНомер;
				СтрокаСоСкидкойWBКлуба.Артикул1С 	= Строка.Артикул;
				СтрокаСоСкидкойWBКлуба.Скидка 		= Строка.СкидкаWBКлуба;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураТоваров.Добавить("ТоварыБезРазмеров", 		ТоварыБезРазмеров);
	СтруктураТоваров.Добавить("ТоварыСРазмерами", 		ТоварыСРазмерами);
	СтруктураТоваров.Добавить("ТоварыСоСкидкойWBКлуба", ТоварыСоСкидкойWBКлуба);
	
КонецПроцедуры

Функция УстановитьЦенуНаТоварыБезРазмера_Wildberries(Аккаунт, Товары)
	
	СтруктураДанных = Новый Структура;
	
	ПакетыЗапросов = РазделитьТаблицуНаПакеты(Товары, 1000);
	
	КоличествоЗапросов = 0;
	
	Для Каждого Пакет Из ПакетыЗапросов Цикл
		
		Если КоличествоЗапросов = 10 Тогда
			
			ВремяОжидания = 6;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_УстановитьЦеныИСкидки(Аккаунт, Пакет);
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				НазваниеОшибки = "Ошибка при установке цен в Wildberries";
				
				Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				Иначе
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				КонецЕсли;	
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
											Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
				
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
				
				Возврат СтруктураДанных;
				
			КонецЕсли;
			
		Иначе
			
			НазваниеОшибки = "Ошибка при установке цен в Wildberries";
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
			
			СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
			СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
			СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("КодСостояния", 200);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция УстановитьЦенуНаТоварыСРазмером_Wildberries(Аккаунт, Товары)
	
	СтруктураДанных = Новый Структура;
	
	ПакетыЗапросов = РазделитьТаблицуНаПакеты(Товары, 1000);
	
	КоличествоЗапросов = 0;
	
	Для Каждого Пакет Из ПакетыЗапросов Цикл
		
		Если КоличествоЗапросов = 10 Тогда
			
			ВремяОжидания = 6;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_УстановитьЦеныДляРазмеров(Аккаунт, Пакет);
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				НазваниеОшибки = "Ошибка при установке цен в Wildberries";
				
				Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				Иначе
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				КонецЕсли;	
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
											Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
				
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
				
				Возврат СтруктураДанных;
				
			КонецЕсли;
			
		Иначе
			
			НазваниеОшибки = "Ошибка при установке цен в Wildberries";
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
			
			СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
			СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
			СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("КодСостояния", 200);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция УстановитьСкидкуНаТоварыWBКлуба_Wildberries(Аккаунт, Товары)
	
	СтруктураДанных = Новый Структура;
	
	ПакетыЗапросов = РазделитьТаблицуНаПакеты(Товары, 1000);
	
	КоличествоЗапросов = 0;
	
	Для Каждого Пакет Из ПакетыЗапросов Цикл
		
		Если КоличествоЗапросов = 10 Тогда
			
			ВремяОжидания = 6;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_УстановитьСкидкиWBКлуба(Аккаунт, Пакет);
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				НазваниеОшибки = "Ошибка при установке цен в Wildberries";
				
				Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				Иначе
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				КонецЕсли;	
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
											Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
				
				СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
				СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
				СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
				
				Возврат СтруктураДанных;
				
			КонецЕсли;
			
		Иначе
			
			НазваниеОшибки = "Ошибка при установке цен в Wildberries";
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
			
			СтруктураДанных.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
			СтруктураДанных.Вставить("Аккаунт",      Аккаунт); 
			СтруктураДанных.Вставить("Комментарий",  "Произошла ошибка при передаче цен. Подробности в журнале регистрации");
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("КодСостояния", 200);
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область Общее

Функция ПолучитьЦеныНоменклатурыПоАккаунту_Общее(Аккаунт, Маркетплейс, ЦеныАккаунта, ТЧНоменклатура, ДатаДокумента, Валюта, СкидкиWB) Экспорт
	
	ВидыЦен = новый ТаблицаЗначений;
	ВидыЦен.Колонки.Добавить("ВидЦены", новый ОписаниеТипов("СправочникСсылка.ВидыЦен")); 
	ВидыЦен.Колонки.Добавить("ВидЦен", новый ОписаниеТипов("Строка")); 

	Для каждого Цена из ЦеныАккаунта Цикл
		
		Если ЗначениеЗаполнено(Цена.Значение) Тогда
			
			НоваяСтрока         = ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены = Цена.Значение;
			НоваяСтрока.ВидЦен  = Цена.Ключ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		СкидкаWB 		= СкидкиWB.СкидкаWB;
		СкидкаWBКлуба 	= СкидкиWB.СкидкаWBКлуба;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());  
	
	ТекстЗапроса = ПолучитьЗапросВидаЦен(ДатаДокумента);
	
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);    
	Запрос.УстановитьПараметр("Товары",  ТЧНоменклатура);                                                               	
	Запрос.УстановитьПараметр("Дата",    ДатаДокумента);     
	Запрос.УстановитьПараметр("Валюта",  Валюта); 
	
	Запрос.Текст = ТекстЗапроса;	 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаНоменклатуры = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл  

		Выборка = ВыборкаНоменклатуры.Выбрать(); 
				
		Пока Выборка.Следующий() Цикл 
			
			НайденныеСтроки = ТЧНоменклатура.НайтиСтроки(Новый Структура("Артикул, УникальныйНомер, Баракод, SKUТовара", 
															Выборка.Артикул, Выборка.УникальныйНомер, Выборка.Баракод, Выборка.SKUТовара));
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				Если Выборка.ВидЦен = "ВидЦены_Цена" Тогда
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_Цена 	= ОКР(Выборка.Цена, 2);
						НайденнаяСтрока.СкидкаWB 		= СкидкаWB;
						НайденнаяСтрока.СкидкаWBКлуба 	= СкидкаWBКлуба;
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				Если Выборка.ВидЦен = "ВидЦены_МинимальнаяЦена" Тогда
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_МинимальнаяЦена = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
				Если Выборка.ВидЦен = "ВидЦены_Себестоимость" Тогда 
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_Себестоимость = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
				Если Выборка.ВидЦен = "ВидЦены_ЦенаДоСкидок" Тогда
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_ЦенаДоСкидок = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
				Если Выборка.ВидЦен = "ВидЦены_ЦенаТовараСУчётомСкидок" Тогда 
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_ЦенаТовараСУчётомСкидок = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
				
				Если Выборка.ВидЦен = "ВидЦены_ЦенаДоСкидок" Тогда
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_ЦенаДоСкидок = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
				Если Выборка.ВидЦен = "ВидЦены_ЦенаТовараСУчётомСкидок" Тогда 
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ВидЦены_ЦенаТовараСУчётомСкидок = ОКР(Выборка.Цена, 2);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;	
		
	КонецЦикла;
	
Возврат	ТЧНоменклатура;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗапросВидаЦен(ДатаДокумента)
	
	Если ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ДатаДокумента) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВидыЦен.ВидЦены КАК ВидЦены,
		|	ВидыЦен.ВидЦен КАК ВидЦен
		|ПОМЕСТИТЬ ВТ_ВидыЦен
		|ИЗ
		|	&ВидыЦен КАК ВидыЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(ВТ_Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	ВТ_Товары.УникальныйНомер КАК УникальныйНомер,
		|	ВТ_Товары.Баракод КАК Баракод,
		|	ВТ_Товары.SKUТовара КАК SKUТовара
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК ВТ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Упаковка КАК Упаковка,
		|	ВТ_ВидыЦен.ВидЦены КАК ВидЦены,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	ВТ_Товары.УникальныйНомер КАК УникальныйНомер,
		|	ВТ_Товары.Баракод КАК Баракод,
		|	ВТ_Товары.SKUТовара КАК SKUТовара,
		|	ВТ_ВидыЦен.ВидЦен КАК ВидЦен
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары,
		|	ВТ_ВидыЦен КАК ВТ_ВидыЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.ВидЦены КАК ВидЦены,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|	КОНЕЦ КАК ХарактеристикаЦО,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаТовары.Упаковка
		|	КОНЕЦ КАК УпаковкаЦО,
		|	ТаблицаТовары.Артикул КАК Артикул,
		|	ТаблицаТовары.УникальныйНомер КАК УникальныйНомер,
		|	ТаблицаТовары.Баракод КАК Баракод,
		|	ТаблицаТовары.SKUТовара КАК SKUТовара
		|ПОМЕСТИТЬ ТаблицаОтбора
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО (ВидыНоменклатуры.Ссылка = ТаблицаТовары.Номенклатура.ВидНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.УпаковкаЦО КАК Упаковка,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ВЫБОР
		|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
		|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Цена,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	ВТ_Товары.УникальныйНомер КАК УникальныйНомер,
		|	ВТ_Товары.Баракод КАК Баракод,
		|	ВТ_Товары.SKUТовара КАК SKUТовара,
		|	ВТ_ВидыЦен.ВидЦен КАК ВидЦен,
		|	ВТ_Товары.Упаковка КАК УпаковкаТЧ
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
		|			(Номенклатура, ХарактеристикаЦО, УпаковкаЦО, ВидЦены) В
		|				(ВЫБРАТЬ
		|					Т.Номенклатура,
		|					Т.ХарактеристикаЦО,
		|					Т.УпаковкаЦО,
		|					Т.ВидЦены
		|				ИЗ
		|					ТаблицаОтбора КАК Т)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
		|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
		|				&Дата,
		|				Валюта = &Валюта
		|					И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_Товары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыЦен КАК ВТ_ВидыЦен
		|		ПО ЦеныНоменклатурыСрезПоследних.ВидЦены = ВТ_ВидыЦен.ВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(Характеристика),
		|	МАКСИМУМ(Упаковка),
		|	МАКСИМУМ(Артикул),
		|	МАКСИМУМ(УникальныйНомер),
		|	МАКСИМУМ(Баракод),
		|	МАКСИМУМ(SKUТовара),
		|	МАКСИМУМ(УпаковкаТЧ)
		|ПО
		|	Номенклатура";          
	Иначе		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВидыЦен.ВидЦены КАК ВидЦены,
		|	ВидыЦен.ВидЦен КАК ВидЦен
		|ПОМЕСТИТЬ ВТ_ВидыЦен
		|ИЗ
		|	&ВидыЦен КАК ВидыЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(ВТ_Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	ВТ_Товары.УникальныйНомер КАК УникальныйНомер,
		|	ВТ_Товары.Баракод КАК Баракод,
		|	ВТ_Товары.SKUТовара КАК SKUТовара,
		|	ВТ_Товары.Упаковка КАК УпаковкаТЧ
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК ВТ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Упаковка КАК Упаковка,
		|	ВТ_ВидыЦен.ВидЦены КАК ВидЦены,
		|	ВТ_Товары.Артикул КАК Артикул,
		|	ВТ_Товары.УникальныйНомер КАК УникальныйНомер,
		|	ВТ_Товары.Баракод КАК Баракод,
		|	ВТ_Товары.SKUТовара КАК SKUТовара,
		|	ВТ_ВидыЦен.ВидЦен КАК ВидЦен,
		|	ВТ_Товары.УпаковкаТЧ КАК УпаковкаТЧ
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары,
		|	ВТ_ВидыЦен КАК ВТ_ВидыЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.ВидЦены КАК ВидЦены,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаТовары.Характеристика
		|	КОНЕЦ КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаТовары.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	ТаблицаТовары.Артикул КАК Артикул,
		|	ТаблицаТовары.УникальныйНомер КАК УникальныйНомер,
		|	ТаблицаТовары.Баракод КАК Баракод,
		|	ТаблицаТовары.SKUТовара КАК SKUТовара,
		|	ТаблицаТовары.ВидЦен КАК ВидЦен,
		|	ТаблицаТовары.УпаковкаТЧ КАК УпаковкаТЧ
		|ПОМЕСТИТЬ ТаблицаОтбора
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО (ВидыНоменклатуры.Ссылка = ТаблицаТовары.Номенклатура.ВидНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ТаблицаОтбора.Артикул КАК Артикул,
		|	ТаблицаОтбора.УникальныйНомер КАК УникальныйНомер,
		|	ТаблицаОтбора.Баракод КАК Баракод,
		|	ТаблицаОтбора.SKUТовара КАК SKUТовара,
		|	ТаблицаОтбора.ВидЦен КАК ВидЦен,
		|	ТаблицаОтбора.УпаковкаТЧ КАК УпаковкаТЧ
		|ИЗ
		|	ТаблицаОтбора КАК ТаблицаОтбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТаблицаОтбора.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ТаблицаОтбора.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|			И ТаблицаОтбора.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка
		|			И ТаблицаОтбора.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка,
		|	Артикул,
		|	УникальныйНомер,
		|	ВидЦены,
		|	Цена
		|ИТОГИ
		|	МАКСИМУМ(Характеристика),
		|	МАКСИМУМ(Упаковка),
		|	МАКСИМУМ(Артикул),
		|	МАКСИМУМ(УникальныйНомер),
		|	МАКСИМУМ(Баракод),
		|	МАКСИМУМ(SKUТовара),
		|	МАКСИМУМ(УпаковкаТЧ)
		|ПО
		|	Номенклатура"; 
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция РазделитьТаблицуНаПакеты(ИсходнаяТаблица, РазмерПакета)
	
	Пакеты = Новый Структура;
	
	ВсегоСтрок = ИсходнаяТаблица.Количество();
	
	КоличествоПакетов = Цел(ВсегоСтрок / РазмерПакета);
	
	Для НомерПакета = 1 По КоличествоПакетов Цикл
		НачальнаяСтрока = (НомерПакета - 1) * РазмерПакета;
		
		НовыйПакет = ИсходнаяТаблица.Скопировать();
		НовыйПакет.Очистить();
		
		Для Сч = НачальнаяСтрока По НачальнаяСтрока + РазмерПакета - 1 Цикл
			НоваяСтрока = НовыйПакет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяТаблица[Сч]);
		КонецЦикла;
		
		Пакеты.Вставить("Пакет" + НомерПакета, НовыйПакет);
	КонецЦикла;
	
	ОстатокСтрок = ВсегоСтрок % РазмерПакета;
	Если ОстатокСтрок > 0 Тогда
		НачальнаяСтрока = КоличествоПакетов * РазмерПакета;
		
		ПоследнийПакет = ИсходнаяТаблица.Скопировать();
		ПоследнийПакет.Очистить();
		
		Для Сч = НачальнаяСтрока По ВсегоСтрок - 1 Цикл
			НоваяСтрока = ПоследнийПакет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяТаблица[Сч]);
		КонецЦикла;
		
		Пакеты.Вставить("Пакет" + (КоличествоПакетов + 1), ПоследнийПакет);
	КонецЕсли;
	
	Возврат Пакеты;
	
КонецФункции

#КонецОбласти



















