   
Функция СформироватьJSON_СформироватьСписокНоменклатуры(МассивСтрокНоменклатуры) Экспорт
	
   ЗаписьJSON 				     = Новый ЗаписьJSON;
   ЗаписьJSON.ПроверятьСтруктуру = Ложь;
   ПараметрыЗаписиJSON           = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
   ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
   
   ЗаписьJSON.ЗаписатьНачалоОбъекта();
   ЗаписьJSON.ЗаписатьИмяСвойства("skus"); 
   
   ЗаписьJSON.ЗаписатьНачалоМассива(); 
   
   Для каждого Номенклатура из МассивСтрокНоменклатуры Цикл
	   
	   ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	   
	   ЗаписьJSON.ЗаписатьИмяСвойства("sku");
	   ЗаписьJSON.ЗаписатьЗначение(Строка(Номенклатура.SKUТовара)); 
	   
	   ЗаписьJSON.ЗаписатьИмяСвойства("items");
	   ЗаписьJSON.ЗаписатьНачалоМассива();
	   ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	   
	   ЗаписьJSON.ЗаписатьИмяСвойства("count");
	   ЗаписьJSON.ЗаписатьЗначение(Мин(Номенклатура.ВНаличии, Номенклатура.КоличествоОстаток));
	   
	   //ЗаписьJSON.ЗаписатьИмяСвойства("updatedAt");  Если вы не передали параметр updatedAt, используется текущее время.
	   //ЗаписьJSON.ЗаписатьЗначение(ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением));
	   
	   ЗаписьJSON.ЗаписатьКонецОбъекта();
	   ЗаписьJSON.ЗаписатьКонецМассива();
	   
	   ЗаписьJSON.ЗаписатьКонецОбъекта(); 
	   
   КонецЦикла;         
   
   ЗаписьJSON.ЗаписатьКонецМассива();
   ЗаписьJSON.ЗаписатьКонецОбъекта();
   СтрокаJSON = ЗаписьJSON.Закрыть(); 
   
   Возврат СтрокаJSON; 
	   
КонецФункции

Функция СформироватьJSON_ПодготовкаЗаказа(РаспределенныеТовары, МаркируемыеТовары, Коробки) Экспорт

	ЗаписьJSON 				      = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON           = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("boxes");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Коробка Из Коробки Цикл
	
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("items");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
        НайденныеСтроки_РаспределенныеТовары = РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_Коробка", Коробка.рар_мп_Коробка));
		
		ОбработканныеСтроки = Новый Массив;
		
		Для каждого Строка Из НайденныеСтроки_РаспределенныеТовары Цикл
			
			Если ОбработканныеСтроки.Найти(Строка) = Неопределено Тогда
			
				НайденныеСтроки_МаркируемыеТовары = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_СтрокаИзТЧТовары", Строка.рар_мп_СтрокаИзТЧТовары));
																			  
				НайденныеСтроки = РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_Коробка, рар_мп_СтрокаИзТЧТовары", 
																					Коробка.рар_мп_Коробка, Строка.рар_мп_СтрокаИзТЧТовары));
																					
				ПерваяСтрока = НайденныеСтроки_МаркируемыеТовары.Получить(0);
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				ЗаписьJSON.ЗаписатьИмяСвойства("id");
				ЗаписьJSON.ЗаписатьЗначение(Число(ПерваяСтрока.рар_мп_IDТовара));
				ЗаписьJSON.ЗаписатьИмяСвойства("fullCount");
				ЗаписьJSON.ЗаписатьЗначение(НайденныеСтроки.Количество()); 
				
				Если ПерваяСтрока.рар_мп_ЗаполнениеМаркировки Или ПерваяСтрока.рар_мп_ЗаполнениеГТД Тогда
					
					ЗаписьJSON.ЗаписатьИмяСвойства("instances");
					ЗаписьJSON.ЗаписатьНачалоМассива();
				
					Для каждого СтрокаМаркировки Из НайденныеСтроки_МаркируемыеТовары Цикл
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						
						ЗаписьJSON.ЗаписатьИмяСвойства("cis");
						ЗаписьJSON.ЗаписатьЗначение(СтрокаМаркировки.рар_мп_ЧестныйЗнак.ЗначениеШтрихкода);
						
						ЗаписьJSON.ЗаписатьИмяСвойства("gtd");
						ЗаписьJSON.ЗаписатьЗначение(СтрокаМаркировки.рар_мп_НомерГТД.Код);
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
					
					КонецЦикла;	
					
					ЗаписьJSON.ЗаписатьКонецМассива();
				
				КонецЕсли;
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				
				Для каждого ОбработаннаяСтрока Из НайденныеСтроки Цикл
				
					ОбработканныеСтроки.Добавить(ОбработаннаяСтрока);		
				
				КонецЦикла;
			
			КонецЕсли;
			
			
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		ЗаписьJSON.ЗаписатьКонецОбъекта();
						
				
			
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
		
 	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_ИзменениеСтатуса(Статус, Подстатус) Экспорт

	ЗаписьJSON 				     = Новый ЗаписьJSON;
    ЗаписьJSON.ПроверятьСтруктуру = Ложь;
    ПараметрыЗаписиJSON           = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
    ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
   
    ЗаписьJSON.ЗаписатьНачалоОбъекта();
    ЗаписьJSON.ЗаписатьИмяСвойства("order");
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();

	ЗаписьJSON.ЗаписатьИмяСвойства("status");
	ЗаписьJSON.ЗаписатьЗначение(Статус);
	ЗаписьJSON.ЗаписатьИмяСвойства("substatus");
	ЗаписьJSON.ЗаписатьЗначение(Подстатус);
			
	ЗаписьJSON.ЗаписатьКонецОбъекта();	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть(); 
	
	Возврат СтрокаJSON;

КонецФункции

Функция СформироватьJSON_ПолучениеЭтикетки(businessId, Заказы) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("businessId");
	ЗаписьJSON.ЗаписатьЗначение(Формат(Число(businessId), "ЧГ=0"));
	ЗаписьJSON.ЗаписатьИмяСвойства("orderIds");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Заказ Из Заказы Цикл
	
		ЗаписьJSON.ЗаписатьЗначение(Формат(Число(Заказ), "ЧГ=0"));		
	
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("sortingType");
	ЗаписьJSON.ЗаписатьЗначение("SORT_BY_GIVEN_ORDER");
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON;	

КонецФункции

Функция СформироватьJSON_ПолучениеОтчетаПоРеализации(campaignId, Год, Месяц) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("campaignId");
	ЗаписьJSON.ЗаписатьЗначение(campaignId);
	ЗаписьJSON.ЗаписатьИмяСвойства("year");
	ЗаписьJSON.ЗаписатьЗначение(Год);
	ЗаписьJSON.ЗаписатьИмяСвойства("month");
	ЗаписьJSON.ЗаписатьЗначение(Месяц);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_ПолучениеОтчетаПоСтоимостиУслуг(businessId, campaignId, НачалоПериода, КонецПериода, СхемаРаботы) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("businessId");
	ЗаписьJSON.ЗаписатьЗначение(businessId);
	ЗаписьJSON.ЗаписатьИмяСвойства("dateFrom");
	ЗаписьJSON.ЗаписатьЗначение(НачалоПериода);
	ЗаписьJSON.ЗаписатьИмяСвойства("dateTo");
	ЗаписьJSON.ЗаписатьЗначение(КонецПериода);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("placementPrograms");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьЗначение(СхемаРаботы);
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("campaignIds");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьЗначение(campaignId);
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_ЦеныНоменклатуры(Данные) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("offers");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Товар Из Данные Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("offerId");
		ЗаписьJSON.ЗаписатьЗначение(Товар.SKUТовара);
		ЗаписьJSON.ЗаписатьИмяСвойства("price");
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("value");
		ЗаписьJSON.ЗаписатьЗначение(Товар.ВидЦены_ЦенаТовараСУчётомСкидок);
		ЗаписьJSON.ЗаписатьИмяСвойства("discountBase");
		ЗаписьJSON.ЗаписатьЗначение(Товар.ВидЦены_ЦенаДоСкидок);
		ЗаписьJSON.ЗаписатьИмяСвойства("currencyId");
		ЗаписьJSON.ЗаписатьЗначение("RUR");
		ЗаписьJSON.ЗаписатьИмяСвойства("vat");
		ЗаписьJSON.ЗаписатьЗначение(0);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 

	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	 Возврат СтрокаJSON;	

КонецФункции

Функция СформироватьJSON_ОтчетПоОстаткамНаСкладах(campaignID) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("campaignId");
	ЗаписьJSON.ЗаписатьЗначение(campaignID);
	ЗаписьJSON.ЗаписатьИмяСвойства("hasStocks");
	ЗаписьJSON.ЗаписатьЗначение(Истина);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_ИнформацияОТоварах(Архив) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("archived");
	ЗаписьJSON.ЗаписатьЗначение(Архив);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON;
	
КонецФункции