 
// https://api-seller.ozon.ru/v1/warehouse/list
Функция Метод_СписокСкладов(Аккаунт) Экспорт 
	
	Метод = "/v1/warehouse/list";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос( ,Метод, Аккаунт);
	
КонецФункции

//https://api-seller.ozon.ru/v3/product/list 
Функция Метод_СписокТоваров(Аккаунт, ИдентификаторСтраницы = "") Экспорт

	Метод = "/v3/product/list";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_СписокТоваров(ИдентификаторСтраницы), Метод, Аккаунт);			

КонецФункции

//https://api-seller.ozon.ru/v3/product/info/list (ПолучитьИнформациюОТоварахПоИдентификаторам)
Функция Метод_ПолучитьОписаниеХарактеристикТовара(Аккаунт, Товары) Экспорт

	Метод = "/v3/product/info/list";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьОписаниеХарактеристикТовара(Товары), Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v3/posting/fbs/list
Функция Метод_СписокОтправлений(Аккаунт, КоличествоПропущенных) Экспорт

	Метод = "/v3/posting/fbs/list";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьСписокОтправлений(КоличествоПропущенных), 
													Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v2/products/stocks  
Функция Метод_ОбновитьКоличествоТоваровНаСкладах(Аккаунт, МассивСтрокНоменклатуры) Экспорт

	Метод = "/v2/products/stocks";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_СформироватьСписокНоменклатуры(МассивСтрокНоменклатуры),  
													Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v5/fbs/posting/product/exemplar/set
Функция Метод_ПередачаМаркировки(Аккаунт, ТоварыСМаркировками, Заказ, КоличествоКоробок) Экспорт

	Метод = "/v5/fbs/posting/product/exemplar/set";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПередачаМаркировки(ТоварыСМаркировками, Заказ,
													КоличествоКоробок), Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v2/posting/fbs/package-label/create
Функция Метод_СозданиеЗаданияНаФормированиеЭтикеток(Аккаунт, НомераЗаказов) Экспорт

	Метод = "/v2/posting/fbs/package-label/create";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_СозданиеЗаданияНаФормированияЭтикеток(НомераЗаказов), Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v1/posting/fbs/package-label/get
Функция Метод_ПолучитьФайлСЭтикетками(Аккаунт, НомерЗадания) Экспорт

	Метод = "/v1/posting/fbs/package-label/get";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьФайлСЭтикетками(НомерЗадания), Метод, Аккаунт);	
		
КонецФункции

//https://api-seller.ozon.ru/v5/fbs/posting/product/exemplar/create-or-get
Функция Метод_ПолучитьДанныеСозданныхЭкземпляров(Аккаунт, НомерЗаказа) Экспорт

	Метод = "/v5/fbs/posting/product/exemplar/create-or-get";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьДанныеСозданныхЭкземпляров(НомерЗаказа), Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v4/posting/fbs/ship
Функция Метод_СобратьЗаказ(Аккаунт, РаспределениеТоваров, НомерЗаказа, МаркируемыеТовары, Коробки) Экспорт

	Метод = "/v4/posting/fbs/ship";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_СобратьЗаказ(НомерЗаказа, РаспределениеТоваров,
																					МаркируемыеТовары, Коробки), Метод, Аккаунт);	

КонецФункции

//https://api-seller.ozon.ru/v2/posting/fbs/act/create
Функция Метод_ПодтверждениеОтгрузки(Аккаунт, ИдентификаторКоробки, ПодключенаДоверительнаяПриемка, КоличествоГрузовыхМест) Экспорт

	Метод = "/v2/posting/fbs/act/create";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПодтверждениеОтгрузки(ИдентификаторКоробки, ПодключенаДоверительнаяПриемка, 
																												   КоличествоГрузовыхМест), Метод, Аккаунт);	
 КонецФункции // ()

//https://api-seller.ozon.ru/v1/product/import/prices																											   
Функция	Метод_ОбновитьЦены(Аккаунт, МассивСтрокНоменклатуры) Экспорт																										   

    Метод = "/v1/product/import/prices";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_СформироватьЦеныНоменклатуры(МассивСтрокНоменклатуры), Метод, Аккаунт);
	
КонецФункции																											   
																											   
//https://api-seller.ozon.ru/v2/finance/realization																											   
Функция Метод_ОтчетОРеализацииТоваров(Аккаунт, Год, Месяц) Экспорт
	
	Метод = "/v2/finance/realization";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьОтчетОРеализацииТоваров(Год, Месяц), Метод, Аккаунт);
	
КонецФункции

//https://api-seller.ozon.ru/v1/finance/realization/posting																											   
Функция Метод_ПозаказныйОтчетОРеализацииТоваров(Аккаунт, Год, Месяц) Экспорт
	
	Метод = "/v1/finance/realization/posting";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьОтчетОРеализацииТоваров(Год, Месяц), Метод, Аккаунт);
	
КонецФункции

//https://api-seller.ozon.ru/v4/product/info/attributes
Функция Метод_ПолучитьОписаниеХарактеристикТовараДляНоменклатуры(Аккаунт, Товары) Экспорт
	
	Метод = "v4/product/info/attributes";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьХарактеристикуТовара(Товары), Метод, Аккаунт);
	
КонецФункции

//https://api-seller.ozon.ru/v2/analytics/stock_on_warehouses
Функция Метод_ОтчетПоОстаткамИТоварамFBO(Аккаунт) Экспорт
	
	Метод = "/v2/analytics/stock_on_warehouses";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ОтчетПоОстаткамИТоварамFBO(), Метод, Аккаунт);
	
КонецФункции  

//https://api-seller.ozon.ru/v1/product/info/stocks-by-warehouse/fbs
Функция Метод_ИнформацияОбОстаткахНаСкладахПродавца_FBS_rFBS(Аккаунт, МассивНоменклатуры) Экспорт
	
	Метод = "/v1/product/info/stocks-by-warehouse/fbs";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ИнформацияОбОстаткахНаСкладахПродавца_FBS_rFBS(МассивНоменклатуры), Метод, Аккаунт);
	
КонецФункции 

//https://api-seller.ozon.ru/v2/posting/fbs/act/get-barcode
Функция Метод_ШтрихкодДляОтгрузкиОтправления(Аккаунт, ИдентификаторПеревозки) Экспорт
	
	Метод = "/v2/posting/fbs/act/get-barcode";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапросДляДвоичныхДанных(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ШтрихкодДляОтгрузкиОтправления(ИдентификаторПеревозки), Метод, Аккаунт);
		
КонецФункции

//https://api-seller.ozon.ru/v2/posting/fbs/digital/act/get-pdf
Функция Метод_ПолучитьЛистОтгрузки(Аккаунт, НомерПоставки) Экспорт

	Метод = "/v2/posting/fbs/digital/act/get-pdf";	 
	
	Возврат	рар_мп_HTTP_запросы.ВыполнитьPOSTЗапросДляДвоичныхДанных(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьФайлЛистОтгрузки(НомерПоставки), Метод, Аккаунт); 

КонецФункции                        

//https://api-seller.ozon.ru/v2/posting/fbs/digital/act/check-status
Функция Метод_ПолучитьСтатусЛистаОтгрузки(Аккаунт, НомерПоставки) Экспорт

	Метод = "/v2/posting/fbs/digital/act/check-status";	 
	
	Возврат	рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьСтатусЛистаОтгрузки(НомерПоставки), Метод, Аккаунт); 

КонецФункции 

//https://api-seller.ozon.ru/v2/posting/fbs/act/get-postings
Функция Метод_ПолучитьСписокОтправлений(Аккаунт, НомерПоставки) Экспорт

	Метод = "/v2/posting/fbs/act/get-postings";	 
	
	Возврат	рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Ozon_JSONЗапросы.СформироватьJSON_ПолучитьСписокОтправленийВАкте(НомерПоставки), Метод, Аккаунт); 

КонецФункции 

