
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
	
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.OZON, "Ozon");
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.Wildberries, "Wildberries");
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, "Яндекс Маркет");
		
	Иначе
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_Ozon") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Ozon_FBO")  Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.OZON, "Ozon"); 
			
		КонецЕсли;
		
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries_FBO") Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.Wildberries, "Wildberries");
			
		КонецЕсли;
		
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет_FBO") Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, "Яндекс Маркет");	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если  Объект.ИспользоватьМинимальныйОстатокТовара Тогда
		
		Элементы.МинимальныйОстатокТовара.Видимость = Истина;
		
	КонецЕсли;  
	
		
	Если  УправлениеДоступом.ЕстьРоль("рар_мп_Ozon") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries") 
		  ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
		 
		Элементы.СхемаРаботы.СписокВыбора.Добавить(Перечисления.рар_мп_СхемыРаботы.FBS, "FBS");
		
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("рар_мп_Ozon_FBO") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries_FBO") 
		  ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет_FBO") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
		
		Элементы.СхемаРаботы.СписокВыбора.Добавить(Перечисления.рар_мп_СхемыРаботы.FBO, "FBO");
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
	МаркетплейсПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МаркетплейсПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Маркетплейс) Тогда
	
		Если Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
	
			Элементы.Ozon_ApiKey.Видимость = Истина;
			
			Элементы.Ozon_ClientID.Видимость = Истина;
			
			Элементы.ЯМ_ApiKey.Видимость = Ложь;
			
			Элементы.BusinessId.Видимость = Ложь;
			
			Элементы.WB_ApiKey.Видимость = Ложь;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_Ozon_РазмерЭтикеток");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Истина;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Истина;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Истина;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Истина;
			
			Элементы.ВидЦены_Цена.Видимость						= Ложь;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Истина;
			
		ИначеЕсли Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Элементы.Ozon_ApiKey.Видимость = Ложь;
			
			Элементы.Ozon_ClientID.Видимость = Ложь;
			
			Элементы.ЯМ_ApiKey.Видимость = Ложь;
			
			Элементы.BusinessId.Видимость = Ложь;
			
			Элементы.WB_ApiKey.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_Wildberries_РазмерСтикеров");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Ложь;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Ложь;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Ложь;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Ложь;
			
			Элементы.ВидЦены_Цена.Видимость						= Истина;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Ложь;
				
		ИначеЕсли Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
			Элементы.Ozon_ApiKey.Видимость = Ложь;
			
			Элементы.Ozon_ClientID.Видимость = Ложь;
			
			Элементы.ЯМ_ApiKey.Видимость = Истина;
			
			Элементы.BusinessId.Видимость = Истина;
			
			Элементы.WB_ApiKey.Видимость = Ложь;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_ЯндексМаркет_РазмерЯрлыков");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Ложь;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Ложь;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Истина;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Истина;  
			
			Элементы.ВидЦены_Цена.Видимость						= Ложь;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Ложь;
			
		КонецЕсли;	
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура МаркетплейсПриИзменении(Элемент)
	МаркетплейсПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМинимальныйОстатокТовараПриИзменении(Элемент)
	
	Если Объект.ИспользоватьМинимальныйОстатокТовара = Истина Тогда
		
		Элементы.МинимальныйОстатокТовара.Видимость = Истина;
		
	Иначе
		
		Объект.МинимальныйОстатокТовара             = 0;
	    Элементы.МинимальныйОстатокТовара.Видимость = Ложь;  
		
	КонецЕсли; 
	
КонецПроцедуры
