
Функция ПолучитьСкидки(Номенклатура, Характеристика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидокНаценокПоНоменклатуре.Источник.Наименование КАК Источник
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценокПоНоменклатуре КАК ДействиеСкидокНаценокПоНоменклатуре
		|ГДЕ
		|	ДействиеСкидокНаценокПоНоменклатуре.Номенклатура = &Номенклатура
		|	И ДействиеСкидокНаценокПоНоменклатуре.Характеристика = &Характеристика
		|	И ДействиеСкидокНаценокПоНоменклатуре.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСкидок = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСкидок.Добавить(ВыборкаДетальныеЗаписи.Источник);
	КонецЦикла;                                                
	
	Возврат МассивСкидок;	
	
КонецФункции

Функция ПолучитьФотоНоменклатуры(Номенклатура) Экспорт
	Если НЕ Номенклатура.ФайлКартинки = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка() Тогда 
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Номенклатура.ФайлКартинки, Ложь);
		Если НЕ ДвоичныеДанные = Неопределено Тогда 
			Возврат Base64Строка(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
КонецФункции 

Функция ПолучитьДанныеУпаковокПоНоменклатуре(Номенклатура) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных=Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ПолучитьСтруктуруУпаковки(ВыборкаДетальныеЗаписи.Упаковка));
	КонецЦикла;
	
    Возврат МассивДанных;

КонецФункции // ПолучитьДанныеУпаковокПоНоменклатуре()

Функция ПолучитьСтруктуруНоменклатуры(Номенклатура) Экспорт 
	МассивНоменклатуры=Новый Массив;
	МассивНоменклатуры.Добавить(Номенклатура);     
	Если Не Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		ФоновыеЗаданияСервер.ВыполнитьДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД_В_ФоновомЗадании(МассивНоменклатуры);
	КонецЕсли;
	
	Реквизиты="Наименование,ВидНоменклатуры,ЕдиницаИзмерения,Артикул";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,Реквизиты); 
	//СтруктураВозврата.ЕдиницаИзмерения=ПолучитьСтруктуруУпаковки(СтруктураВозврата.ЕдиницаИзмерения); 
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Номенклатура);

	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруНоменклатуры() 

Функция ПолучитьСтруктуруХарактеристики(Характеристика) Экспорт 	
	
	Реквизиты="Наименование,Владелец,НаименованиеПолное";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Характеристика,Реквизиты);
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Характеристика);
	
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруХарактеристики()  

Функция ПолучитьМассивХарактеристикПоНоменклатуре(Номенклатура) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	МассивВозврата=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = ПолучитьСтруктуруХарактеристики(Выборка.Ссылка);
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
		
	Возврат МассивВозврата	

КонецФункции // ПолучитьМассивХарактеристикПоНоменклатуре()

Функция ПолучитьСтруктуруУпаковки(Упаковка) Экспорт
	
	Реквизиты="Код,Наименование,ЕдиницаИзмерения,Владелец";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Упаковка,Реквизиты); 
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Упаковка);
	
	КоэффициентУпаковки=Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Упаковка,СтруктураВозврата.Владелец);
	Если КоэффициентУпаковки=Неопределено Тогда
		КоэффициентУпаковки=1;	
	КонецЕсли;	
	СтруктураВозврата.Вставить("КоэффициентУпаковки",КоэффициентУпаковки); 
	
	Если ТипЗнч(СтруктураВозврата.Владелец)=Тип("СправочникСсылка.НаборыУпаковок") Тогда
		СтруктураВозврата.Владелец=Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруУпаковки()

Функция ПолучитьМассивУпаковокПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	МассивВозврата=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = ПолучитьСтруктуруУпаковки(Выборка.Ссылка);
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
		
	Возврат МассивВозврата	

КонецФункции // ПолучитьМассивУпаковокПоНоменклатуре()

Функция ПолучитьСтруктуруШтрихкода(Штрихкод) Экспорт
	
	СтруктураВозврата=ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Штрихкод,Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьМассивШтрихкодовПоНоменклатуре()

Функция ПолучитьМассивШтрихкодовПоНоменклатуре(Номенклатура) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,	
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	СтруктураВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ); 
		
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьМассивШтрихкодовПоНоменклатуре()



Функция ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Номенклатура) Экспорт
	Если НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		НоменклатураЗагружаетсяНаУзел=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.НоменклатураЗагружаетсяНаУзел(Номенклатура,ПараметрыСеанса.ТекущийУзелТСД);
		Если НЕ НоменклатураЗагружаетсяНаУзел Тогда
			СтруктураВозврата=Новый Структура;
			СтруктураВозврата.Вставить("Номенклатура",ПолучитьСтруктуруНоменклатуры(Номенклатура));
			СтруктураВозврата.Вставить("Характеристки",ПолучитьМассивХарактеристикПоНоменклатуре(Номенклатура));
		    СтруктураВозврата.Вставить("Упаковки",ПолучитьМассивУпаковокПоНоменклатуре(Номенклатура));
			СтруктураВозврата.Вставить("Штрихкода",ПолучитьМассивШтрихкодовПоНоменклатуре(Номенклатура));
		
			Возврат СтруктураВозврата
		Иначе 
			Возврат Номенклатура;
		КонецЕсли;
	Иначе
		Возврат Номенклатура;
	КонецЕсли;
	
КонецФункции // ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре()



Процедура СтруктуруВЗаписьXML(ЗаписьXML,Структура) Экспорт
	
	Для Каждого СтрокаСтруктуры из Структура Цикл
        
		ЗаписатьXML(ЗаписьXML, СтрокаСтруктуры.Значение, СтрокаСтруктуры.Ключ, НазначениеТипаXML.Явное); 
		
	КонецЦикла;

КонецПроцедуры // СтруктуруВЗаписьXML()

Функция ДобавитьСсылкуНаСправочникВНачалоСтруктуры(Структура,Ссылка)
	СтруктураНовая=Новый Структура;
	СтруктураНовая.Вставить("Ссылка",Ссылка);
	Для Каждого СтрокаСтруктуры из Структура Цикл

		СтруктураНовая.Вставить(СтрокаСтруктуры.Ключ,СтрокаСтруктуры.Значение); 
		
	КонецЦикла; 
	Возврат СтруктураНовая;
КонецФункции



