
// https://marketplace-api.wildberries.ru/api/v3/warehouses
Функция Метод_ПолучитьСписокСкладовПродавца(Аккаунт) Экспорт 
	
	Метод = "/api/v3/warehouses";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Маркетплейс");
	
КонецФункции 

// https://content-api.wildberries.ru/content/v2/get/cards/list
Функция Метод_СписокКарточекТоваров(Аккаунт, ДатаИзменения = "", НомерСтраницы = "") Экспорт 
	
	Метод = "/content/v2/get/cards/list";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_СписокКарточекТоваров(ДатаИзменения, НомерСтраницы),
													Метод, Аккаунт, "Контент");
	
КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/orders
Функция Метод_ПолучитьИНформациюОСборочныхЗаданиях(Аккаунт, СледующаяСтраница) Экспорт

	Метод = СтрШаблон("/api/v3/orders?limit=%1&next=%2", 800,СледующаяСтраница) ;
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Маркетплейс");

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/orders/status
Функция Метод_ПолучитьСтатусыСборочныхЗаданий(Аккаунт, НомерЗаказа) Экспорт

	Метод = "/api/v3/orders/status";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ПолучитьСтатусыЗаказов(НомерЗаказа),
													Метод, Аккаунт, "Маркетплейс");		

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies
Функция Метод_СоздатьНовуюПоставку(Аккаунт, НазваниеПоставки) Экспорт

	Метод = "/api/v3/supplies";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_СоздатьНовуюПоставку(НазваниеПоставки),
													Метод, Аккаунт, "Маркетплейс");	

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/orders/{orderId}
Функция Метод_ДобавитьСборочноеЗаданиеКПоставке(Аккаунт, НомерПоставки, НомерЗаказа) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/orders/%2", НомерПоставки, НомерЗаказа);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPATCHЗапрос(Метод, Аккаунт, "Маркетплейс");  

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/orders/{orderId}/meta/sgtin
Функция Метод_ПередачаМаркировки(Аккаунт, НомерЗаказа,Маркировки) Экспорт

	Метод = СтрШаблон("/api/v3/orders/%1/meta/sgtin", НомерЗаказа);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPUTЗапрос( рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ПередатьМаркировкуВМаркетплейс(Маркировки),
													Метод, Аккаунт, "Маркетплейс"); 	

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/deliver
Функция Метод_ПередатьПоставкуВДоставку(Аккаунт, НомерПоставки) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/deliver", НомерПоставки);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPATCHЗапрос(Метод, Аккаунт, "Маркетплейс");		

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/barcode
Функция Метод_ПолучениеQRКодаПоставки(Аккаунт, НомерПоставки) Экспорт 

	Метод = СтрШаблон("/api/v3/supplies/%1/barcode?type=%2", НомерПоставки, "png");
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Маркетплейс");		

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/orders/stickers
Функция Метод_ПолучитьСтикерыСборочныхЗаданий(Аккаунт, НомераЗаказов) Экспорт
	
	Размер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "РазмерЭтикетокДляЗаказов");
	
	Если ЗначениеЗаполнено(Размер) Тогда
		
		МассивШиринаВысота = СтрРазделить(Размер, "×");
		
		Ширина = МассивШиринаВысота.Получить(0);
		Высота = ?(МассивШиринаВысота.Количество() = 1, "", МассивШиринаВысота.Получить(1));
		
	Иначе
		
		Ширина = "";
		Высота = "";
	
	КонецЕсли;
	Метод = СтрШаблон("/api/v3/orders/stickers?type=%1&width=%2&height=%3", "png", Ширина, Высота);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ПолучитьСтикерыСборочныхЗаданий(НомераЗаказов),Метод, Аккаунт, "Маркетплейс");
	
КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/trbx
Функция Метод_ДобавитьКоробаКПоставке(Аккаунт, НомерПоставки) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/trbx", НомерПоставки);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ДобавитьКоробаКПоставке(),Метод, Аккаунт, "Маркетплейс");	

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/trbx
Функция Метод_УдалитьКоробИзПоставки(Аккаунт, НомерПоставки, ИдентификаторКоробки) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/trbx", НомерПоставки);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьDELETEЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_УдалитьКоробИзПоставки(ИдентификаторКоробки),Метод, Аккаунт, "Маркетплейс");	

КонецФункции 

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/trbx/{trbxId}
Функция Метод_ДобавитьЗаказыВКороб(Аккаунт, НомерПоставки, ИдентификаторКоробки, НомераЗаказов) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/trbx/%2", НомерПоставки, ИдентификаторКоробки);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPATCHЗапрос(Метод, Аккаунт, "Маркетплейс", рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ДобавитьЗаказыВКороб(НомераЗаказов)); 		

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/trbx/{trbxId}/orders/{orderId}
Функция Метод_УдалитьЗаказИзКороба(Аккаунт, НомерПоставки, ИдентификаторКоробки, НомерЗаказа) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/trbx/%2/orders/%3", НомерПоставки, ИдентификаторКоробки, НомерЗаказа);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьDELETEЗапрос(,Метод, Аккаунт, "Маркетплейс");	

КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/stocks/{warehouseId}
Функция Метод_ОбновитьОстаткиТоваров(Аккаунт, Склад, МассивСтрокНоменклатуры) Экспорт   
	
	Метод = СтрШаблон("/api/v3/stocks/%1", Склад); 
		
	Возврат рар_мп_HTTP_запросы.ВыполнитьPUTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_СформироватьСписокНоменклатуры(МассивСтрокНоменклатуры), Метод, Аккаунт, "Маркетплейс");
	
КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/supplies/{supplyId}/trbx/stickers
Функция Метод_ПолучитьСтикерыКоробовПоставки(Аккаунт, НомерПоставки, МассивКоробок) Экспорт

	Метод = СтрШаблон("/api/v3/supplies/%1/trbx/stickers?type=%2", НомерПоставки, "png");
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ПолучитьСтикерыКоробовПоставки(МассивКоробок),
													Метод, Аккаунт, "Маркетплейс");		

КонецФункции

//https://statistics-api.wildberries.ru/api/v5/supplier/reportDetailByPeriod												
Функция Метод_ПолучениеОтчетаОПродажахПоРеализации(Аккаунт, НачалоПериода, КонецПериода, ИдентификаторСтроки) Экспорт
	
	Метод = СтрШаблон("/api/v5/supplier/reportDetailByPeriod?dateFrom=%1&dateTo=%2&rrdid=%3", 
						Формат(НачалоПериода, "ДФ=гггг-ММ-дд"), 
						Формат(КонецПериода, "ДФ=гггг-ММ-дд"), 
						ИдентификаторСтроки);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Статистика");
	
КонецФункции

//https://seller-analytics-api.wildberries.ru/api/v1/warehouse_remains
Функция Метод_СоздатьОтчетОбОстаткахНаСкладах(Аккаунт) Экспорт
	
	Метод = "/api/v1/warehouse_remains?locale=ru&groupByBrand=true&groupBySubject=true&groupBySa=true&groupByNm=true&groupByBarcode=true&groupBySize=true&filterPics=0&filterVolume=0";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Аналитика");
	
КонецФункции

//https://seller-analytics-api.wildberries.ru/api/v1/warehouse_remains/tasks/{task_id}/status
Функция Метод_ПроверитьСтатусСозданияОтчетаОбОстаткахНаСкладах(Аккаунт, ИдентификаторГенерации) Экспорт
	
	Метод = СтрШаблон("/api/v1/warehouse_remains/tasks/%1/status", ИдентификаторГенерации);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Аналитика");
	
КонецФункции

//https://seller-analytics-api.wildberries.ru/api/v1/warehouse_remains/tasks/{task_id}/download
Функция Метод_ПолучитьОтчетОбОстаткахНаСкладах(Аккаунт, ИдентификаторГенерации) Экспорт
	
	Метод = СтрШаблон("/api/v1/warehouse_remains/tasks/%1/download", ИдентификаторГенерации);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Аналитика");
	
КонецФункции

//https://marketplace-api.wildberries.ru/api/v3/stocks/{warehouseId}
Функция Метод_ПолучитьОстаткиТоваров(Аккаунт, Данные, ИдентификаторСклада) Экспорт
	
	Метод = СтрШаблон("/api/v3/stocks/%1", ИдентификаторСклада);
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_ПолучитьОстаткиТоваров(Данные), Метод, Аккаунт, "Маркетплейс");
	
КонецФункции

//https://discounts-prices-api.wildberries.ru/api/v2/list/goods/filter
Функция Метод_ПолучитьТоварыСЦенами(Аккаунт, Смещение) Экспорт
	
	Метод = СтрШаблон("api/v2/list/goods/filter?limit=1000&offset=%1", СтрЗаменить(Строка(Смещение), Символы.НПП, ""));
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьGETЗапрос(Метод, Аккаунт, "Цены и скидки");
	
КонецФункции

//https://discounts-prices-api.wildberries.ru/api/v2/upload/task
Функция Метод_УстановитьЦеныИСкидки(Аккаунт, Данные) Экспорт
	
	Метод = "/api/v2/upload/task";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_УстановитьЦеныИСкидки(Данные), Метод, Аккаунт, "Цены и скидки");
	
КонецФункции

//https://discounts-prices-api.wildberries.ru/api/v2/upload/task/size
Функция Метод_УстановитьЦеныДляРазмеров(Аккаунт, Данные) Экспорт
	
	Метод = "/api/v2/upload/task/size";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_УстановитьЦеныДляРазмеров(Данные), Метод, Аккаунт, "Цены и скидки");
	
КонецФункции

//https://discounts-prices-api.wildberries.ru/api/v2/upload/task/club-discount
Функция Метод_УстановитьСкидкиWBКлуба(Аккаунт, Данные) Экспорт
	
	Метод = "/api/v2/upload/task/club-discount";
	
	Возврат рар_мп_HTTP_запросы.ВыполнитьPOSTЗапрос(рар_мп_Wildberries_JSONЗапросы.СформироватьJSON_УстановитьСкидкиWBКлуба(Данные), Метод, Аккаунт, "Цены и скидки");
	
КонецФункции







