#Область Шифрование
Функция ЗашифроватьСообщение(Сообщение) Экспорт
 
	массивТекста = РазложитьТекстВМассивПодстрок(СокрЛП(Сообщение),символы.ПС);

	КлючШифра = "3E3E1C715FB8FDC150A181848EF3ADED4A128AB82D30BEB534B1B8FFFE0E46B0";
    //КлючШифра	 - это хеш в формате (SHA256) 
	МассивХеша = новый Массив;
	//КлючШифра = СтрЗаменить(КлючШифра," ","");
	//КлючШифра = Лев(КлючШифра+"рррррррррррррррррррррррррррррр",64);// Добавляем недостающие символы
	
	МассивХеша = РазложитьСтрокуВМассивзнаков(КлючШифра,МассивХеша);
	ЗашифрованныйТекст = ЗашифроватьТекст(массивТекста, МассивХеша,КлючШифра);
	
	Возврат ЗашифрованныйТекст;
	
КонецФункции

Функция ЗашифроватьТекст(МассивСимволов,МассивХеша,КлючШифра)
	
	ЗашифрованнаяСтрока = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел(1);

	ПозицияСимволаХэша = 0;
	ДлинаХэша = МассивХеша.количество();
	Для Каждого Ном из МассивСимволов Цикл
		//Извлекаем номер шифруемого символа  UTF-8
		НомерСимвола = КодСимвола(Ном);
		Если  ПозицияСимволаХэша >= ДлинаХэша-1 тогда
			ПозицияСимволаХэша = 0;
		КонецЕсли;
		//Позиция суммируемого хеша
		ПозицияСимволаХэша = ПозицияСимволаХэша+1;
		//Извлекаем номер символа хеша UTF-8
		СимволаХэша = КодСимвола(МассивХеша[ПозицияСимволаХэша]); 
		
		//Суммируем СуммыПозиций кодов 
		Код_Зашифрованный_символ =  НомерСимвола+СимволаХэша;
		Зашифрованный_символ = Символ(Код_Зашифрованный_символ);	
		ЗашифрованнаяСтрока= ЗашифрованнаяСтрока+Зашифрованный_символ;
		
		//Усложним шифр добавляя тенического мусора при условие что КодСимвола хеша четный;
		Если Цел(СимволаХэша/2) = СимволаХэша/2 тогда			
			СлучайноеЧисло = ГСЧ.СлучайноеЧисло(100, 1000); 
			ЗашифрованнаяСтрока= ЗашифрованнаяСтрока+Символ(СлучайноеЧисло);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗашифрованнаяСтрока; 
	
КонецФункции
#КонецОбласти


#Область Дешифрация
Функция РасшифроватьСообщение (ЗашифрованныйТекст) Экспорт
	
	МассивХеша = новый Массив;
	МассивДанных = РазложитьТекстВМассивПодстрок(ЗашифрованныйТекст,символы.ПС);	
	КлючШифра = СтрЗаменить("3E3E1C715FB8FDC150A181848EF3ADED4A128AB82D30BEB534B1B8FFFE0E46B0"," ","");
	МассивХеша = РазложитьСтрокуВМассивзнаков(КлючШифра,МассивХеша);
	РасшифрованныйТекст = РасшифроватьТекст(МассивДанных,МассивХеша,КлючШифра);

	Возврат РасшифрованныйТекст;
	
КонецФункции

Функция РасшифроватьТекст(МассивСимволов,МассивХеша,КлючШифра)
	 
	РасшифроватьТекст = "";
	ПозицияСимволаХэша = 0;
	ДлинаХэша = МассивХеша.количество();
	Пропуск = ложь;
	для каждого Символ из МассивСимволов Цикл
		
		Если Пропуск тогда
			Пропуск = ложь;
			продолжить;
		КонецЕсли;	
		
		НомерСимвола = КодСимвола(Символ);
		Если ПозицияСимволаХэша >= ДлинаХэша-1 тогда
			ПозицияСимволаХэша = 0;
		КонецЕсли;
		ПозицияСимволаХэша = ПозицияСимволаХэша+1;
		СимволаХэша = КодСимвола(МассивХеша[ПозицияСимволаХэша]); 

		Код_Зашифрованный_символ = НомерСимвола-СимволаХэша;
		Зашифрованный_символ = Символ(Код_Зашифрованный_символ);
			
		РасшифроватьТекст = РасшифроватьТекст+Зашифрованный_символ;
		
		//Отсекаем символы заполнения пропуская их
		Если Цел(СимволаХэша/2) = СимволаХэша/2 тогда
			Пропуск = истина;
		КонецЕсли;	

	КонецЦикла;
	
	Возврат РасшифроватьТекст; 
	
КонецФункции 	
#КонецОбласти  

#Область ВспомогательныеФункции
Функция РазложитьСтрокуВМассивзнаков(Знач Стр,МассивСтрок)

	Длинастроки = СтрДлина(Стр);
	Поз=0;
	Пока 1=1 Цикл
		Поз = Поз+1;
		Если Длинастроки=0 Тогда
			Если Стр <> "" тогда
				МассивСтрок.Добавить(Лев(Стр,1));
			КонецЕсли;
			Возврат МассивСтрок;
		КонецЕсли;
		Если Стр <> "" тогда
			МассивСтрок.Добавить(Лев(Стр,1));
		КонецЕсли;
		
		Стр = Прав(Стр,Длинастроки-1);
		Длинастроки = Длинастроки-1;
	КонецЦикла;
	
КонецФункции 

Функция РазложитьТекстВМассивПодстрок(Знач Стр, Разделитель = "") 
	
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока 1=1 Цикл
		Поз = Найти(Стр,Разделитель);
		Если Поз=0 Тогда
			МассивСтрок.Добавить(Стр);
			прервать;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр,Поз-1));
		Стр = Сред(Стр,Поз+ДлинаРазделителя);
	КонецЦикла;
	МассивТекста = Новый Массив; 
	i=0;
	Для Каждого Ном из МассивСтрок Цикл
		i=i+1;
		Если Ном <> "" тогда
			МассивТекста = РазложитьСтрокуВМассивзнаков(Ном,МассивТекста);
		КонецЕсли;
		Если i< МассивСтрок.Количество() Тогда
			МассивТекста.Добавить(Символы.ПС);
		КонецЕсли;
	КонецЦикла;	 
	
	Возврат МассивТекста;
	
КонецФункции 	    

#КонецОбласти

#Область ВспомогательныеФункции
Процедура РасшифроватьСтруктуру(СтруктураДанных, МассивИсключений = Неопределено) Экспорт
	Если МассивИсключений = Неопределено Тогда
		МассивИсключений = новый Массив;
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураДанных Цикл
		Если МассивИсключений.Найти(Элемент.Ключ) = Неопределено Тогда
			СтруктураДанных[Элемент.Ключ] = РасшифроватьСообщение(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗашифроватьСтруктуру(СтруктураДанных) Экспорт
	Для Каждого Элемент Из СтруктураДанных Цикл
		СтруктураДанных[Элемент.Ключ] = ЗашифроватьЗначениеПростогоТипа(Элемент.Значение);		
	КонецЦикла;
КонецПроцедуры

Функция ЗашифроватьЗначениеПростогоТипа(Знач Значение) Экспорт
	Если Значение= Неопределено или Значение= null или Значение= "" Тогда
		Возврат Значение
	ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
		Возврат ЗашифроватьСообщение(Значение);
	ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда  
		Возврат ЗашифроватьСообщение(Формат(Значение,"ЧГ=0"));
	ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
		Возврат ЗашифроватьСообщение(Формат(Значение,"ДФ=yyyyMMddHHmmss"));
	ИначеЕсли ТипЗнч(Значение)=Тип("Булево") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение)=Тип("УникальныйИдентификатор") Тогда
		Возврат Значение;
	ИначеЕсли Метаданные.Справочники.Содержит(Значение.Метаданные()) 
			или Метаданные.Документы.Содержит(Значение.Метаданные())  Тогда
		Возврат Значение.УникальныйИдентификатор();
	ИначеЕсли Метаданные.Перечисления.Содержит(Значение.Метаданные()) 
		и ЗначениеЗаполнено(Значение) Тогда
		Возврат Перечисления[Значение.Метаданные().Имя].Индекс(Значение);
	ИначеЕсли Метаданные.Перечисления.Содержит(Значение.Метаданные()) 
		и НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено; 
	ИначеЕсли ТипЗнч(Значение)=Тип("Структура") Тогда
		 ЗашифроватьСтруктуру(Значение); 
		 Возврат Значение;
	Иначе
		Возврат Значение;
	КонецЕсли;
КонецФункции

Функция РасшифроватьЗначениеПростогоТипа(Значение,ТипЗначения) Экспорт

	Если Значение="" или Значение=Неопределено или Значение=NULL Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(ТипЗначения)=Тип("Строка") 
		или ТипЗнч(ТипЗначения)=Тип("Число") Тогда
		Возврат РасшифроватьСообщение(Значение);
	ИначеЕсли ТипЗнч(ТипЗначения)=Тип("Дата") Тогда
		Возврат Дата(РасшифроватьСообщение(Значение));
	//ИначеЕсли ТипЗнч(Значение)=Тип("Структура") Тогда
	//	Возврат Дата(РасшифроватьСообщение(Значение));
	КонецЕсли;
	
	Возврат Значение
КонецФункции



#КонецОбласти
