
//@skip-check module-structure-method-in-regions
&НаСервере
Процедура рар_мп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_СозданоОбработкой = Элементы.Добавить("рар_мп_СозданоОбработкой", Тип("ПолеФормы"), Элементы["ГруппаДополнительноПраво"]);
		рар_мп_СозданоОбработкой.ПутьКДанным = "Объект.рар_мп_СозданоОбработкой";
		рар_мп_СозданоОбработкой.Вид = ВидПоляФормы.ПолеФлажка;
		рар_мп_СозданоОбработкой.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_АккаунтМаркетплейса = Элементы.Добавить("рар_мп_АккаунтМаркетплейса", Тип("ПолеФормы"), Элементы["ГруппаДополнительноПраво"]);
		рар_мп_АккаунтМаркетплейса.ПутьКДанным = "Объект.рар_мп_АккаунтМаркетплейса";
		рар_мп_АккаунтМаркетплейса.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_АккаунтМаркетплейса.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
