Функция ВыполнитьМетодОбмена(ИмяФункции, Параметры = Неопределено) Экспорт
	Параметры = СериализаторXDTO.ПрочитатьXDTO(Параметры);
	Попытка
		Результат = Вычислить(СтрШаблон("%1(Параметры)", ИмяФункции));
		Если Результат = Неопределено Тогда
			Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Успешно", Истина));
		ИначеЕсли ОбщегоНазначенияТСД.ЭтоЗначениеПримитивногоТипа(Результат) Тогда
			Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Результат", Результат));
		Иначе//должна быть структура
			Возврат СериализаторXDTO.ЗаписатьXDTO(Результат);
		КонецЕсли;
	Исключение
		ПодробнаяОшибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОпсаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Мобильное приложение", УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Успешно, Сообщение", Ложь, ОпсаниеОшибки));
	КонецПопытки;
КонецФункции

Функция СерверДоступен(Параметры)
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	ИтоговыйМассивПользователейИБ = Новый Массив;
	Для Каждого Элемент ИЗ МассивПользователейИБ Цикл
		Если Элемент.ПоказыватьВСпискеВыбора Тогда
			СтруктураПользователя = Новый Структура("Имя, УникальныйИдентификатор", Элемент.Имя, Строка(Элемент.УникальныйИдентификатор)); 
			ИтоговыйМассивПользователейИБ.Добавить(СтруктураПользователя);
		КонецЕсли;
	КонецЦикла;	
	
	Ответ = Новый Структура ("Успешно, МассивПользователейИБ", Истина, ИтоговыйМассивПользователейИБ);
	Возврат Ответ; 
КонецФункции

Функция АвторизоватьПользователя(Параметры)
	ОтветАвторизаци = Новый Структура("Успешно, Сообщение, ИмяКонфигурации", Истина, "", Метаданные.Имя);
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.Логин);
	Если ПользовательИБ = Неопределено Тогда
		ОтветАвторизаци.Успешно = Ложь;
		ОтветАвторизаци.Сообщение = "Такого пользователя нет в базе!";
	Иначе
		Если ЕстьДоступКСервисам(ПользовательИБ) Тогда
			Если ПарольСовпадаетСПаролемИБ(ПользовательИБ, Параметры.Пароль) Тогда
				ОтветАвторизаци.Успешно = Истина;
				Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
				ПланыОбмена.ОбменДаннымиМобильноеПриложение.СоздатьУзелОбмена(ОтветАвторизаци, Пользователь);
				ОтветАвторизаци.Вставить("ГУИДПользователя", Пользователь.УникальныйИдентификатор());
				ОтветАвторизаци.Вставить("НаименованиеПользователя", Пользователь.Наименование);
				ОбщегоНазначенияТСД.ВставитьВСтруктуруВерсиюОбмена(ОтветАвторизаци);
			Иначе
				ОтветАвторизаци.Успешно = Ложь;
				ОтветАвторизаци.Сообщение = "Неверно введен пароль!";
			КонецЕсли;	
		Иначе
			ОтветАвторизаци.Успешно = Ложь;
			ОтветАвторизаци.Сообщение = "У пользователя нет прав для работы на мобильном устройстве. Обратитесь к администратору";
		КонецЕсли;
	КонецЕсли;
	Возврат ОтветАвторизаци;
КонецФункции

Функция ПроверитьПользователяНаСервере(Параметры)
	ОтветПроверки = Новый Структура("Успешно, Сообщение", Истина, "");
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.Логин); 
	
	Если ПарольПользователяПоменялся(ПользовательИБ, Параметры.Пароль) Тогда
		ОтветПроверки.Успешно = Ложь;
		ОтветПроверки.Сообщение = "У пользователя сменился пароль. Необходима повторная авторизация";
	Иначе 
		Если Не ЕстьДоступКСервисам(ПользовательИБ) Тогда
			ОтветПроверки.Успешно = Ложь;
			ОтветПроверки.Сообщение = "У пользователя нет прав для работы на мобильном устройстве. Обратитесь к администратору";
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияТСД.ВставитьВСтруктуруВерсиюОбмена(ОтветПроверки);
	Возврат ОтветПроверки;
КонецФункции

Функция ПарольПользователяПоменялся(ПользовательИБ, Пароль)
	Если ПарольСовпадаетСПаролемИБ(ПользовательИБ, Пароль) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЕстьДоступКСервисам(ПользовательИБ)
	Если Пользователи.РолиДоступны("РаботаСВебСервисами", ПользовательИБ) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;  
	КонецЕсли;
КонецФункции

Функция ПолучитьДокумент(Параметры)
	Документ = РаботаСШтрихкодами.ПолучитьДокументПоШК(Параметры.Штрихкод);
	Результат = Новый Структура("Успешно, Сообщение, ТипНайденногоДокумента", Истина, "", "");
	Если Документ <> Неопределено Тогда 
		Результат.ТипНайденногоДокумента = Строка(ТипЗнч(Документ));
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
			Если Документ.Статус <> Перечисления.СтатусыПересчетовТоваров.ВРаботе Тогда
				Результат.Успешно = Ложь;
				Результат.Сообщение = "Неверный статус документа. Работа с документом возможна только со статусом ""В работе""!";
			Иначе
				РаботаСДокументами.ПолучитьДанныеДокументаПересчетТоваров(Документ, Результат);
			КонецЕсли;	
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			РаботаСДокументами.СоздатьПеремещениеТоваровНаОсновеЗаказаНаПеремещения(Параметры.ГУИДПользователя, Документ, Результат);
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			РаботаСДокументами.ПолучитьДанныеДокументаПеремещениеТоваров(Документ, Результат);
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ
			ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			Результат.Вставить("Данные");
			Результат.Успешно = Ложь;
			Результат.Сообщение = "Ошибка поиска документа в центральной базе или документ не найден";
			ОбработкаДокументаОснованияПриемки(Документ, Результат);
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ
			ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Результат.Вставить("Данные");
			Результат.Успешно = Ложь;
			Результат.Сообщение = "Ошибка поиска документа в центральной базе или документ не найден";
			ОбработкаДокументаОснованияОтгрузки(Документ, Результат);
		КонецЕсли;
	Иначе
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Нет документа с таким штрихкодом!";
	КонецЕсли;
	Возврат Результат;
КонецФункции 

Функция ПолучитьКоличествоОбъектовКОбмену(Параметры)
	Результат = Новый Структура("Успешно, Сообщение, КоличествоОбъектов", Истина, "", 0);
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийУзелТСД) Тогда    
		Результат.Успешно=Ложь;
    	Результат.Сообщение="Узел не найден";
        Возврат Результат
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейкиИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Изменения
		|ИЗ
		|	Справочник.СкладскиеЯчейки.Изменения КАК СкладскиеЯчейкиИзменения
		|ГДЕ
		|	СкладскиеЯчейкиИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураИзменения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
		|ГДЕ
		|	НоменклатураИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыИзменения.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.Изменения КАК ХарактеристикиНоменклатурыИзменения
		|ГДЕ
		|	ХарактеристикиНоменклатурыИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмеренияИзменения.Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения.Изменения КАК УпаковкиЕдиницыИзмеренияИзменения
		|ГДЕ
		|	УпаковкиЕдиницыИзмеренияИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкладыИзменения.Ссылка
		|ИЗ
		|	Справочник.Склады.Изменения КАК СкладыИзменения
		|ГДЕ
		|	СкладыИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыНоменклатурыИзменения.Ссылка
		|ИЗ
		|	Справочник.ВидыНоменклатуры.Изменения КАК ВидыНоменклатурыИзменения
		|ГДЕ
		|	ВидыНоменклатурыИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОрганизацииИзменения.Ссылка
		|ИЗ
		|	Справочник.Организации.Изменения КАК ОрганизацииИзменения
		|ГДЕ
		|	ОрганизацииИзменения.Узел = &Узел
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СкладскиеПомещенияИзменения.Ссылка
		|ИЗ
		|	Справочник.СкладскиеПомещения.Изменения КАК СкладскиеПомещенияИзменения
		|ГДЕ
		|	СкладскиеПомещенияИзменения.Узел = &Узел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Изменения.Ссылка) КАК КоличествоОбъектов
		|ИЗ
		|	ВТ_Изменения КАК ВТ_Изменения";
	
	Запрос.УстановитьПараметр("Узел", ПараметрыСеанса.ТекущийУзелТСД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Результат.Успешно=Истина;
    Результат.КоличествоОбъектов=ВыборкаДетальныеЗаписи.КоличествоОбъектов;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПересчетТоваровПоГУИДу(Параметры)
	Результат = Новый Структура("Успешно, Сообщение, ТипНайденногоДокумента", Истина, "", "");
	ДокПересчетаТоваров = Документы.ПересчетТоваров.ПолучитьСсылку(Параметры.ГУИД);
	РаботаСДокументами.ПолучитьДанныеДокументаПересчетТоваров(ДокПересчетаТоваров, Результат);
	Возврат Результат;
КонецФункции

Функция ЗаписатьПересчетТоваров(Параметры)
	РаботаСДокументами.ЗаписатьПересчетТоваров(Параметры);	
КонецФункции

Функция ЗаписатьЗаказКлиента(Параметры)
	РаботаСДокументами.ЗаписатьЗаказКлиента(Параметры);	
КонецФункции

Функция ЗаписатьРеестрЗаказов(Параметры)
	РаботаСДокументами.ЗаписатьРеестрЗаказов(Параметры);	
КонецФункции

Функция ЗаписатьПеремещениеТоваров(Параметры)
	РаботаСДокументами.ЗаписатьПеремещениеТоваров(Параметры);	
КонецФункции

Функция ЗаписатьПеремещениеТоваровСозданноговМП(Параметры)
	Пользователь = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	РаботаСДокументами.ЗаписатьПеремещениеТоваровСозданноговМП(Параметры, Пользователь);	
КонецФункции

Функция ЗаписатьРазмещениеТоваров(Параметры)
	Пользователь = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	РаботаСДокументами.ЗаписатьРазмещениеТоваровСозданноговМП(Параметры, Пользователь);
КонецФункции

Функция ПолучитьТовар(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка поиска товара по штрихкоду или товар с данным штрихкодом отсутсвует.");
	Товар = РаботаСШтрихкодами.ПолучитьНоменклатуруПоШК(Параметры.Штрихкод);
	Если НЕ Товар = Неопределено Тогда		
		Результат.Данные = Товар;
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	                                  
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеТовара(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка поиска товара по штрихкоду или товар с данным штрихкодом отсутсвует.");
	
	ДанныеШтрихкода = РаботаСШтрихкодами.ПолучитьДанныеТовараПоШК(Параметры.Штрихкод);
	Если НЕ ДанныеШтрихкода = Неопределено Тогда  
		ОбработкаДанныхТовара(ДанныеШтрихкода, Результат);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеТовараПоГУИД(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка получения данных товара");
	
	ДанныеТовара = Параметры.ДанныеТовара;
	ДанныеТовара.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеТовара.Номенклатура));
	ДанныеТовара.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеТовара.Характеристика));
	ДанныеТовара.Вставить("НоменклатураНаименование", ДанныеТовара.Номенклатура.Наименование);
	ДанныеТовара.Вставить("ХарактеристикаНаименование", "");
	Если ЗначениеЗаполнено(ДанныеТовара.Характеристика) Тогда 
		ДанныеТовара.ХарактеристикаНаименование = ДанныеТовара.Характеристика.Наименование;
	КонецЕсли;

	ОбработкаДанныхТовара(ДанныеТовара, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЯчейкуПоШК(Параметры)
	Результат = Новый Структура("Ячейка, ГУИДЯчейки, Успешно, Сообщение", Неопределено, Неопределено, Ложь, "Ошибка поиска ячейки по штрихкоду или ячейка с данным штрихкодом отсутсвует.");
	Ячейка = РаботаСШтрихкодами.ПолучитьСсылкуЯчейкиПоШК(Параметры.Штрихкод);
	Если НЕ Ячейка = Неопределено Тогда		
		Результат.Ячейка = Ячейка.Наименование;
		Результат.ГУИДЯчейки = Ячейка.УникальныйИдентификатор();
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьДанныеЯчейки(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка поиска ячейки по штрихкоду.");
	
	ЯчейкаСсылка = РаботаСШтрихкодами.ПолучитьСсылкуЯчейкиПоШК(Параметры.Штрихкод);

	Если НЕ ЯчейкаСсылка = Неопределено Тогда 
		
		Остатки = ОстаткиСервер.ПолучитьОстаткиВЯчейке(ЯчейкаСсылка);
		
		Если Остатки.Количество() = 0 Тогда 
			Результат.Сообщение = "В ячейке нет товаров";
		Иначе 
			Остатки.Колонки.Добавить("НоменклатураГУИД");
			Остатки.Колонки.Добавить("ХарактеристикаГУИД");
			Для Каждого Стр Из Остатки Цикл 
				Стр.НоменклатураГУИД = Стр.Номенклатура.УникальныйИдентификатор();
				//Если ЗначениеЗаполнено(Стр.Характеристика) Тогда 
					Стр.ХарактеристикаГУИД = Стр.Характеристика.УникальныйИдентификатор();
				//КонецЕсли;
			КонецЦикла;
			Остатки.Колонки.Удалить("Номенклатура");
			Остатки.Колонки.Удалить("Характеристика");	
			
			Данные = Новый Структура;
			Данные.Вставить("Ячейка", ЯчейкаСсылка.Наименование);
			Данные.Вставить("Остатки", ОбщегоНазначения.ТаблицаЗначенийВМассив(Остатки));
			
			Результат.Данные = Данные;
			Результат.Успешно = Истина;
			Результат.Сообщение = "";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстаткиВЯчейкеДляРазмещения(Параметры)
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Нет такой ячейки!");
	ЯчейкаСсылка = РаботаСШтрихкодами.ПолучитьСсылкуЯчейкиПоШК(Параметры.Штрихкод);
	Если ЯчейкаСсылка <> Неопределено Тогда 
		Возврат ОстаткиСервер.ПолучитьОстаткиВЯчейкеДляРазмещения(Результат, ЯчейкаСсылка);
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

Функция СоздатьПриобретение(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Ошибка при создании документа приобретение в центральной базе.");
	
	Документ = РаботаСДокументами.СоздатьПриобретениеТоваровИУслуг(Параметры);
	
	Если НЕ Документ = Неопределено Тогда		
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьРеализацию(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Ошибка при создании документа реализации в центральной базе.");
	
	Документ = РаботаСДокументами.СоздатьРеализациюТоваровИУслуг(Параметры);
	
	Если НЕ Документ = Неопределено Тогда		
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьПриходныйОрдер(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Ошибка при создании документа приходный ордер в центральной базе.");
	
	Документ = РаботаСДокументами.СоздатьПриходныйОрдер(Параметры);
	
	Если НЕ Документ = Неопределено Тогда		
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьРасходныйОрдер(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Ошибка при создании документа расходный ордер в центральной базе.");
	
	Документ = РаботаСДокументами.СоздатьРасходныйОрдер(Параметры);
	
	Если НЕ Документ = Неопределено Тогда		
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьПереоценку(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Ошибка при создании документа переоценка товаров в центральной базе.");
	
	Документ = РаботаСДокументами.СоздатьПереоценку(Параметры);
	
	Если НЕ Документ = Неопределено Тогда		
		Результат.Успешно = Истина;
		Результат.Сообщение = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДокументыПоНомеру(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка поиска документов в центральной базе или документы не найдены");
	
	ТабДокументы = РаботаСДокументами.НайтиДокументыПоНомеру(Параметры.Номер, Параметры.ВидДокумента);	
	
	Если НЕ ТабДокументы = Неопределено Тогда
		Если ТабДокументы.Количество() = 1 Тогда
			Документ = ТабДокументы[0];
			ОпределитьТипДокументаИОбработать(Параметры, Документ, Результат);				
		Иначе 			
			ТабДокументы.Колонки.Удалить("Ссылка");			
			Результат.Успешно = Истина;
			Результат.Сообщение = "";
			Результат.Данные = Новый Структура("ДокументыОснования", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабДокументы));
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОпределитьТипДокументаИОбработать(Параметры, Документ, Результат)
	
	Если Параметры.ВидДокумента = "ЗаказПоставщику" ИЛИ Параметры.ВидДокумента = "ПриобретениеТоваровУслуг" Тогда 
		ОбработкаДокументаОснованияПриемки(Документ.Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ЗаказКлиента" ИЛИ Параметры.ВидДокумента = "РеализацияТоваровУслуг" Тогда 
		ОбработкаДокументаОснованияОтгрузки(Документ.Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ПересчетТоваров" Тогда
		ОбработкаДокументаПересчетаТоваров(Документ.Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ЗаказНаПеремещение" Тогда
		ОбработкаДокументаЗаказНаПеремещение(Параметры.ГУИДПользователя, Документ.Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ПеремещениеТоваров" Тогда
		ОбработкаДокументаПеремещениеТоваров(Документ.Ссылка, Результат);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаДанныхТовара(ДанныеШтрихкода, Результат)
	
	Скидки = РаботаСоСправочниками.ПолучитьСкидки(ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.Характеристика);
	
	ОстаткиВЯчейках = ОстаткиСервер.ПолучитьОстаткиВЯчейках(ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.Характеристика);
	ОстаткиНаСкладах = ОстаткиСервер.ПолучитьОстаткиНаСкладах(ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.Характеристика);
	
	//Данные = Новый Структура;
	//Данные.Вставить("Наименование", ДанныеШтрихкода.НоменклатураНаименование);
	//Данные.Вставить("Характеристика", ДанныеШтрихкода.ХарактеристикаНаименование);
	//Данные.Вставить("ТоварГУИД", ДанныеШтрихкода.Номенклатура.УникальныйИдентификатор());
	//Данные.Вставить("ХарактеристикаГУИД", ДанныеШтрихкода.Характеристика.УникальныйИдентификатор());
	//Если ДанныеШтрихкода.Свойство("УпаковкаНаименование") Тогда	
	//	Данные.Вставить("Упаковка", ДанныеШтрихкода.УпаковкаНаименование);
	//	Данные.Вставить("ВидНоменклатурыГУИД", ДанныеШтрихкода.НоменклатураВидНоменклатуры.УникальныйИдентификатор());
	//	Данные.Вставить("УпаковкаГУИД", ДанныеШтрихкода.Упаковка.УникальныйИдентификатор());
	//	Данные.Вставить("ЕдиницаИзмеренияГУИД", ДанныеШтрихкода.НоменклатураЕдиницаИзмерения.УникальныйИдентификатор());
	//КонецЕсли;
	ДанныеШтрихкода.Вставить("Фото", РаботаСоСправочниками.ПолучитьФотоНоменклатуры(ДанныеШтрихкода.Номенклатура));
	//Данные.Вставить("Характеристики", Характеристики);
	ДанныеШтрихкода.Вставить("Скидки", Скидки);
	ДанныеШтрихкода.Вставить("ОстаткиВЯчейках", ОбщегоНазначения.ТаблицаЗначенийВМассив(ОстаткиВЯчейках));
	ДанныеШтрихкода.Вставить("ОстаткиНаСкладах", ОбщегоНазначения.ТаблицаЗначенийВМассив(ОстаткиНаСкладах));
	
	Результат.Данные = ДанныеШтрихкода;
	Результат.Успешно = Истина;
	Результат.Сообщение = "";	
	
КонецПроцедуры 

Процедура ОбработкаДокументаОснованияПриемки(ДокСсылка, Результат)
	
	МассивВозможныхДокументовПриемки = РаботаСДокументами.ПолучитьМассивВозможныхДокументовПриемки(ДокСсылка);
	Если НЕ МассивВозможныхДокументовПриемки = Неопределено Тогда 
		Если МассивВозможныхДокументовПриемки.Количество() = 0 Тогда 
			Результат.Сообщение = "Нельзя оформить приемку на основании данного документа";	
		Иначе   
			ДанныеДокумента = РаботаСДокументами.ПолучитьДанныеДокументаОснованияПриемкиОтгрузки(ДокСсылка);					
			Результат.Успешно = Истина;
			Результат.Сообщение = "";
			Результат.Данные = Новый Структура("ДанныеДокумента,МассивВозможныхДокументовПриемки", ДанныеДокумента, МассивВозможныхДокументовПриемки);				
		КонецЕсли;								
	КонецЕсли;	
	
КонецПроцедуры // ОбработкаДокументаОснованияПриемки()

Функция ПослеРучногоВыбораДокумента(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка поиска документов в центральной базе или документы не найдены");
		
	Если Параметры.ВидДокумента = "ЗаказПоставщику" Тогда 
		Ссылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИД));
		ОбработкаДокументаОснованияПриемки(Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ПриобретениеТоваровУслуг" Тогда 
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИД));
		ОбработкаДокументаОснованияПриемки(Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "ЗаказКлиента" Тогда 
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИД));
		ОбработкаДокументаОснованияОтгрузки(Ссылка, Результат);
	ИначеЕсли Параметры.ВидДокумента = "РеализацияТоваровУслуг" Тогда 
		Ссылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИД));
		ОбработкаДокументаОснованияОтгрузки(Ссылка, Результат);
	КонецЕсли;
	
	Возврат Результат;			
	
КонецФункции

Процедура ОбработкаДокументаОснованияОтгрузки(ДокСсылка, Результат)
	
	МассивВозможныхДокументовОтгрузки = РаботаСДокументами.ПолучитьМассивВозможныхДокументовОтгрузки(ДокСсылка);
	Если НЕ МассивВозможныхДокументовОтгрузки = Неопределено Тогда 
		Если МассивВозможныхДокументовОтгрузки.Количество() = 0 Тогда 
			Результат.Сообщение = "Нельзя оформить отгрузку на основании данного документа";	
		Иначе   
			ДанныеДокумента = РаботаСДокументами.ПолучитьДанныеДокументаОснованияПриемкиОтгрузки(ДокСсылка);					
			Результат.Успешно = Истина;
			Результат.Сообщение = "";
			Результат.Данные = Новый Структура("ДанныеДокумента,МассивВозможныхДокументовОтгрузки", ДанныеДокумента, МассивВозможныхДокументовОтгрузки);				
		КонецЕсли;								
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаДокументаПересчетаТоваров(ДокСсылка, Результат)
	ДанныеДокумента = Новый Структура;
	РаботаСДокументами.ПолучитьДанныеДокументаПересчетТоваров(ДокСсылка, ДанныеДокумента);					
	Результат.Успешно = Истина;
	Результат.Сообщение = "";
	Результат.Данные = ДанныеДокумента;				
КонецПроцедуры

Процедура ОбработкаДокументаЗаказНаПеремещение(ГУИДПользователя, ДокСсылка, Результат)
	ДанныеДокумента = Новый Структура;
	РаботаСДокументами.СоздатьПеремещениеТоваровНаОсновеЗаказаНаПеремещения(ГУИДПользователя, ДокСсылка, ДанныеДокумента);
	Результат.Успешно = Истина;
	Результат.Сообщение = "";
	Результат.Данные = ДанныеДокумента;				
КонецПроцедуры

Процедура ОбработкаДокументаПеремещениеТоваров(ДокСсылка, Результат)
	ДанныеДокумента = Новый Структура;
	РаботаСДокументами.ПолучитьДанныеДокументаПеремещениеТоваров(ДокСсылка, ДанныеДокумента);					
	Результат.Успешно = Истина;
	Результат.Сообщение = "";
	Результат.Данные = ДанныеДокумента;				
КонецПроцедуры

Функция ПарольСовпадаетСПаролемИБ(ПользовательИБ, ПроверяемыйПароль)
	ТекущийПароль = ПользовательИБ.СохраняемоеЗначениеПароля;
	ПозицияРазделителя = Найти(ТекущийПароль, ",");
	ПаролиСовпадают = ПроверяемыйПароль = Лев(ТекущийПароль, ПозицияРазделителя - 1);
	Возврат ПаролиСовпадают;
КонецФункции

Функция НайтиНоменклатуру(Параметры) 
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "");
	Если Константы.ИспользоватьПолнотекстовыйПоиск.Получить() Тогда
		Данные = ПоискТовара.ПолучитьДанныеПоискаНоменклатуры(Параметры.СтрокаПоиска); 
		Результат.Данные=Данные;
		Результат.Успешно=Истина;
	Иначе
		Результат.Успешно=Ложь; 
		Результат.Сообщение="Поиск номенклатуры не возможен! Включите полнотекстовый поиск в настройках на сервере!"
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СоздатьШКНоменклатуры(Параметры)
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИДНоменклатуры));
	Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИДУпаковки));
	РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьШК(Параметры.Штрихкод, Номенклатура, , Упаковка);	
КонецФункции

Функция СоздатьНоменклатуруИПривязатьШК(Параметры)
	Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИДУпаковки));
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ГУИДВидаНоменклатуры));
	Номенклатура = Справочники.Номенклатура.Создатьноменклатуру(Параметры.НаименованиеНоменклатуры, Упаковка, ВидНоменклатуры);
	РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьШК(Параметры.Штрихкод, Номенклатура, , Упаковка);	
КонецФункции

Функция ПолучитьУпаковкиПоГУИДНоменклатуры(Параметры)
	
	Результат = Новый Структура("Данные, Успешно, Сообщение", Неопределено, Ложь, "Ошибка получения данных товара");
	
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.Номенклатура));
	
	МассивНоменклатуры=Новый Массив;
	МассивНоменклатуры.Добавить(Номенклатура);	
	ФоновыеЗаданияСервер.ВыполнитьДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД_В_ФоновомЗадании(МассивНоменклатуры);
	
	Данные=РаботаСоСправочниками.ПолучитьДанныеУпаковокПоНоменклатуре(Номенклатура);
	Результат.Данные=Данные; 
	Результат.Сообщение="";
	Результат.Успешно=Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ВзятьВРаботуЗаказКлиента(Параметры)
	Возврат РаботаСДокументами.ВзятьВРаботуЗаказКлиента(Параметры);		
КонецФункции

Функция ВзятьВРаботуРеестрЗаказов(Параметры)
	Возврат РаботаСДокументами.ВзятьВРаботуРеестрЗаказов(Параметры);		
КонецФункции

Функция ПарольПользователяНеПоменялся(Параметры)
	ОтветАвторизаци = Новый Структура("Успешно, Сообщение", Истина, "");
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.Логин); 
	Если ПарольСовпадаетСПаролемИБ(ПользовательИБ, Параметры.Пароль) Тогда
		ОтветАвторизаци.Успешно = Истина;
		ОбщегоНазначенияТСД.ВставитьВСтруктуруВерсиюОбмена(ОтветАвторизаци);
	Иначе
		ОтветАвторизаци.Успешно = Ложь;
	КонецЕсли;
	Возврат ОтветАвторизаци;
КонецФункции
