#Область ЯндексМаркет

Функция ЯндексМаркет_ПередачаМаркировки(Аккаунт, Заказы, РаспределенныеТовары, МаркируемыеТовары, Коробки) Экспорт
	
	Для каждого Заказ Из Заказы Цикл
		
		НайденныеСтроки = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", Заказ.рар_мп_НомерЗаказа));
		
		МаркированныеТоварыДляДанногоЗаказа = МаркируемыеТовары.Скопировать(НайденныеСтроки);
		
		НайденныеСтроки = РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", Заказ.рар_мп_НомерЗаказа)); 
		
		РаспределенныеТоварыДляДанногоЗаказа = РаспределенныеТовары.Скопировать(НайденныеСтроки);
		
		НайденныеСтроки = Коробки.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", Заказ.рар_мп_НомерЗаказа));
		
		КоробкиДляДанногоЗаказа = Коробки.Скопировать(НайденныеСтроки);
		
		НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ.рар_мп_Заказ, "НомерПоДаннымКлиента");
		
		УникальныйИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ.рар_мп_Заказ, "рар_мп_УникальныйИдентификаторСклада");
		
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПодготовкаЗаказов(Аккаунт, УникальныйИдентификаторСклада, НомерЗаказа, 
		РаспределенныеТоварыДляДанногоЗаказа, МаркированныеТоварыДляДанногоЗаказа,
		КоробкиДляДанногоЗаказа);
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				НазваниеОшибки = "Ошибка при передаче маркировки в Яндекс Маркет";
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при передаче маркировки. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
				Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Ложь; 
				
			Иначе
				
				НазваниеОшибки = "Ошибка при передаче маркировки в Яндекс Маркет";
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при передаче маркировки. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
				Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки, УровеньЖурналаРегистрации.Ошибка,,Комментарий,);
				
				Возврат Ложь;
				
			КонецЕсли;
			
		Иначе
			
			Продолжить;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЯндексМаркет_ИзменениеСтатуса(Аккаунт, Заказы, Статус, Подстатус) Экспорт
	
	Для каждого Строка Из Заказы Цикл
		
		Заказ = Строка.рар_мп_Заказ;
		
		НомерЗаказа = Строка.рар_мп_НомерЗаказа;
		
		УникальныйИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "рар_мп_УникальныйИдентификаторСклада"); 
		
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ИзменениеСтатуса(Аккаунт, УникальныйИдентификаторСклада, НомерЗаказа, Статус, Подстатус);
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				НазваниеОшибки = "Ошибка при изменении статуса заказа в Яндекс Маркет";
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при изменении статуса заказа. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Номер заказа: %4%1Описание ошибки: %5", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Ложь;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при изменении статуса заказа в Яндекс Маркет";
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при изменении статуса заказа. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Номер заказа: %4%1Описание ошибки: %5", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Истина;				
	
КонецФункции

Функция ЯндексМаркет_ПодтверждениеОтгрузки(Аккаунт, ВыгрузкаCampaignId) Экспорт
	
	МассивCampaignId = ВыгрузкаCampaignId.ВыгрузитьКолонку("рар_мп_ИдентификаторСклада");
	
	Для каждого Идентификатор Из МассивCampaignId Цикл
		
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПодтверждениеОгрузки(Аккаунт, Идентификатор);
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при подтверждении отгрузки в Яндекс Маркет";
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при подтверждении отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1CampaignId: %4%1Описание ошибки: %5", 
			Символы.ПС, Аккаунт, КодЗапроса, Идентификатор, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат Ложь;			
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ЯндексМаркет_ПолучитьЭтикеткиЗаказов(Аккаунт, Заказы) Экспорт
	
	МассивФайлов = Новый Массив;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого Заказ Из Заказы Цикл
		
		МассивЗаказов.Добавить(Заказ);
		
		Если МассивЗаказов.Количество() = 1000 ИЛИ МассивЗаказов.Количество() = Заказы.Количество() Тогда
			
			HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьЭтикетки(Аккаунт, Заказы);
			
			КодЗапроса = HTTPОтвет.КодСостояния;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Если КодЗапроса <> 200 Тогда
					
					НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
					
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
					Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивФайлов.Очистить();
					
					Возврат МассивФайлов;
					
				Иначе
					
					Если HTTPОтвет.ОтветAPI.status = "OK" Тогда
						
						Если HTTPОтвет.ОтветAPI.result.Свойство("reportId") Тогда
							
							НомерОтчета = HTTPОтвет.ОтветAPI.result.reportId;
							
							Статус = "";
							
							Пока Статус <> "DONE" И Статус <> "FAILED" Цикл
								
								HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьГотовыйОтчет(Аккаунт, НомерОтчета);
								
								КодЗапроса = HTTPОтвет.КодСостояния;
								
								Если HTTPОтвет.Свойство("ОтветAPI") Тогда
									
									Если КодЗапроса <> 200 Тогда
										
										НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
										
										ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
										
										Сообщение = Новый СообщениеПользователю;
										Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
										Сообщение.Сообщить();
										
										Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
										Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
										
										ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
										
										МассивФайлов.Очистить();
										
										Возврат МассивФайлов;
										
									Иначе
										
										Статус = HTTPОтвет.ОтветAPI.result.status;	
										
									КонецЕсли;
									
								Иначе
									
									НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
									
									ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
									
									Сообщение = Новый СообщениеПользователю;
									Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
									Сообщение.Сообщить();
									
									Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
									
									ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
									
									МассивФайлов.Очистить();
									
									Возврат МассивФайлов;
									
								КонецЕсли;
								
							КонецЦикла;
							
							Если Статус = "DONE" Тогда
								
								СсылкаНаФайл = HTTPОтвет.ОтветAPI.result.file;
								
								СсылкаНаСоединение = "market-mbi-prod.s3-private.mds.yandex.net";
								
								СсылкаНаФайл = СтрЗаменить(СсылкаНаФайл, "https://" + СсылкаНаСоединение + "/", "");
								
								Соединение = Новый HTTPСоединение(СсылкаНаСоединение, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
								Запрос = Новый HTTPЗапрос(СсылкаНаФайл);
								Ответ = Соединение.Получить(Запрос);
								ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
								
								МассивФайлов.Добавить(ДвоичныеДанные);	
								
							Иначе
								
								НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
								
								ОписаниеОшибки = "Статус получения этикеток 'FAILED'";	
								
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
								Сообщение.Сообщить();
								
								Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
								Символы.ПС, Аккаунт, ОписаниеОшибки);
								
								ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
								
								МассивФайлов.Очистить();
								
								Возврат МассивФайлов;
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
							
							ОписаниеОшибки = ОписаниеОшибки();	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
							Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							МассивФайлов.Очистить();
							
							Возврат МассивФайлов;
							
							
						КонецЕсли;	
						
					Иначе
						
						НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
						
						ОписаниеОшибки = "При обработке запроса произошла ошибка";	
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
						Символы.ПС, Аккаунт, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						МассивФайлов.Очистить();
						
						Возврат МассивФайлов;	
						
					КонецЕсли;
					
				КонецЕсли;
				
				МассивЗаказов.Очистить(); 
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении этикеток в Яндекс Маркет";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
				Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				МассивФайлов.Очистить();
				
				Возврат МассивФайлов;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

#КонецОбласти  

#Область Ozon

Функция Ozon_ПолучитьЭтикетки(Аккаунт, Заказы) Экспорт
	
	МассивФайлов = Новый Массив;
	
	HTTPОтвет = рар_мп_Ozon_Методы.Метод_СозданиеЗаданияНаФормированиеЭтикеток(Аккаунт, Заказы);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при формировании задания на формирования этикеток в Ozon";
			
			ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при формировании задания на формирования этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			МассивФайлов.Очистить();
			
			Возврат МассивФайлов;
			
		Иначе
			
			РазмерЭтикетки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "РазмерЭтикетокДляЗаказов"); 
			
			ИмяПеречисления = РазмерЭтикетки.Метаданные().Имя;
			Индекс 			= Перечисления.рар_мп_Ozon_РазмерЭтикеток.Индекс(РазмерЭтикетки);
			Формат 			= РазмерЭтикетки.Метаданные().ЗначенияПеречисления[Индекс].Имя;
			
			СписокЗаданий = HTTPОтвет.ОтветAPI.result.tasks;
			
			НомерЗадания = 0;
			
			Для каждого Задание Из СписокЗаданий Цикл
				
				Если Задание.task_type = Формат Тогда
					
					НомерЗадания = Задание.task_id;
					
					Прервать;
					
				КонецЕсли;		
				
			КонецЦикла;
			
			Если НомерЗадания = 0 Тогда
				
				МассивФайлов.Очистить();
				
				Возврат МассивФайлов;	
				
			КонецЕсли;
			
			СтатусФормирования = "";
			
			КоличествоЗапросов = 0;
			
			Пока СтатусФормирования <> "completed" Цикл
				
				Если КоличествоЗапросов = 50 Тогда
					
					КоличествоЗапросов = 0;
					
					ВремяОжидания = 5;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
					
				КонецЕсли;
				
				HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьФайлСЭтикетками(Аккаунт, НомерЗадания);
				
				КоличествоЗапросов = КоличествоЗапросов + 1;
				
				КодЗапроса = HTTPОтвет.КодСостояния;
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если КодЗапроса <> 200 Тогда
						
						НазваниеОшибки = "Ошибка при получении этикеток в Ozon";
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
						Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						МассивФайлов.Очистить();
						
						Возврат МассивФайлов; 
						
					Иначе
						
						СтатусФормирования = HTTPОтвет.ОтветAPI.result.status;	
						
					КонецЕсли;  
					
				Иначе
					
					НазваниеОшибки = "Ошибка при получении этикеток в Ozon";
					
					ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
					Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивФайлов.Очистить();
					
					Возврат МассивФайлов;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СсылкаНаФайл = HTTPОтвет.ОтветAPI.result.file_url;
			
			СсылкаНаСоединение = "cdn1.ozone.ru";
			
			СсылкаНаФайл = СтрЗаменить(СсылкаНаФайл, "https://" + СсылкаНаСоединение + "/", "");
			
			Соединение = Новый HTTPСоединение(СсылкаНаСоединение, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
			Запрос = Новый HTTPЗапрос(СсылкаНаФайл);
			Ответ = Соединение.Получить(Запрос);
			ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
			
			МассивФайлов.Добавить(ДвоичныеДанные);
			
		КонецЕсли; 
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении этикеток в Ozon";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении этикеток. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
	КонецЕсли;
	
	Возврат МассивФайлов;
	
КонецФункции

Функция Ozon_ПередачаМаркировкиВМаркетплейс(Аккаунт, МаркируемыеТовары, Коробки, Заказы) Экспорт
	
	КоличествоЗапросов = 0;
	
	Для каждого Строка Из Заказы Цикл 
		
		Заказ = Строка.рар_мп_Заказ;
		
		НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "НомерПоДаннымКлиента");
		
		НайденныеСтрокиКоробки = Коробки.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		НайденныеСтрокиМаркируемыеТовары = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		МаркируемыеТовары_Заказ = МаркируемыеТовары.Скопировать(НайденныеСтрокиМаркируемыеТовары);
		
		Если КоличествоЗапросов = 50 Тогда
			
			КоличествоЗапросов = 0;
			
			ВремяОжидания = 5;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПередачаМаркировки(Аккаунт, МаркируемыеТовары_Заказ, Заказ, НайденныеСтрокиКоробки.Количество());
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при передачи маркировок в Ozon";
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при передачи маркировок. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат Ложь;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Ozon_СобратьЗаказ(Аккаунт, РаспределенныеТовары, Заказы, МаркируемыеТовары, Коробки) Экспорт
	
	КоличествоЗапросов = 0;
	
	Для каждого Строка Из Заказы Цикл 
		
		Заказ = Строка.рар_мп_Заказ;
		
		НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "НомерПоДаннымКлиента");
		
		РаспределенныеТовары_НужныеСтроки = РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		РаспределенныеТовары_Заказ		  = РаспределенныеТовары.Скопировать(РаспределенныеТовары_НужныеСтроки);
		
		НужныеКоробки = Коробки.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		МаркируемыеТовары_НужныеСтроки = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		МаркируемыеТоварыы_Заказ	   = МаркируемыеТовары.Скопировать(МаркируемыеТовары_НужныеСтроки);
		
		Если КоличествоЗапросов = 50 Тогда
			
			КоличествоЗапросов = 0;
			
			ВремяОжидания = 5;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_СобратьЗаказ(Аккаунт, РаспределенныеТовары_Заказ, НомерЗаказа, МаркируемыеТоварыы_Заказ, НужныеКоробки);
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при изменении статуса заказа (сборка заказа) в Ozon";
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при изменении статуса (сборка заказа). Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Ozon_ПодтверждениеОтгрузки(Аккаунт, КоличествоГрузовыхМест, ПодключенаДоверительнаяПриемка) Экспорт
	
	//alsalt 09.06.25
	ДанныеОтгрузки = Новый Структура;
	ДанныеОтгрузки.Вставить("Подтверждена", 	Истина);
	ДанныеОтгрузки.Вставить("НомерПеревозки", 	"");
	//alsalt 09.06.25
	
	КоличествоЗапросов = 0;
	
	Для каждого Строка Из КоличествоГрузовыхМест Цикл
		
		Если КоличествоЗапросов = 50 Тогда
			
			КоличествоЗапросов = 0;
			
			ВремяОжидания = 5;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;
		
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПодтверждениеОтгрузки(Аккаунт, Строка.рар_мп_ИдентификаторСклада, ПодключенаДоверительнаяПриемка, Строка.рар_мп_КоличествоГрузовыхМест);
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при подтверждении отгрузки в Ozon";
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
			КонецЕсли;	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при подтверждении отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			//alsalt 09.06.25
			ДанныеОтгрузки.Подтверждена = Ложь;
			Возврат ДанныеОтгрузки;
			
			//Возврат Ложь;
			//alsalt 09.06.25
			
		КонецЕсли;
		//alsalt 09.06.25
		ДанныеОтгрузки.НомерПеревозки = HTTPОтвет.ОтветAPI.result.id;
		//alsalt 09.06.25
	КонецЦикла;
	
	//alsalt 09.06.25
	//Возврат Истина;
	
	Возврат ДанныеОтгрузки;
	//alsalt 09.06.25
КонецФункции

Функция Ozon_СформироватьЛистПодбора(Аккаунт, НомерПоставки) Экспорт
	
	КоличествоЗапросов = 0;
	
	Если КоличествоЗапросов = 50 Тогда
		
		КоличествоЗапросов = 0;
		
		ВремяОжидания = 5;
		
		ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
		
		Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
			// Ожидаем время для следующего запроса	
		КонецЦикла;
		
	КонецЕсли;    
	
	HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьСписокОтправлений(Аккаунт, НомерПоставки);  
	
	КоличествоЗапросов = КоличествоЗапросов + 1; 
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если КодЗапроса <> 200 Тогда
		
		НазваниеОшибки = "Ошибка при получении листа подбора в Ozon";
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
			
		Иначе
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении листа подбора. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат "";	
		
	КонецЕсли;         
	
	Возврат HTTPОтвет.ОтветAPI.result;
	
	
КонецФункции

Функция Ozon_СформироватьЛистОтгрузки(Аккаунт, НомерПоставки) Экспорт
	
	КоличествоЗапросов = 0;
	
	Если КоличествоЗапросов = 50 Тогда
		
		КоличествоЗапросов = 0;
		
		ВремяОжидания = 5;
		
		ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
		
		Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
			// Ожидаем время для следующего запроса	
		КонецЦикла;
		
	КонецЕсли;    
	
	//Получение статуса формирования документов по номеру поставки
	HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьСтатусЛистаОтгрузки(Аккаунт, НомерПоставки);  
	
	КоличествоЗапросов = КоличествоЗапросов + 1; 
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если КодЗапроса <> 200 Тогда
		
		НазваниеОшибки = "Ошибка при получении листа отгрузки в Ozon";
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
			
		Иначе
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении листа отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат "";	
		
	КонецЕсли;
	
	Если HTTPОтвет.ОтветAPI.status = "CONFIRMED" ИЛИ HTTPОтвет.ОтветAPI.status = "FORMED" ИЛИ HTTPОтвет.ОтветAPI.status = "CONFIRMED_WITH_MISMATCH" Тогда
		
		Если КоличествоЗапросов = 50 Тогда
			
			КоличествоЗапросов = 0;
			
			ВремяОжидания = 5;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса	
			КонецЦикла;
			
		КонецЕсли;    
		
		//Получение листа отгрузки
		HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьЛистОтгрузки(Аккаунт, НомерПоставки);  
		
		КоличествоЗапросов = КоличествоЗапросов + 1;         
		
		//ВозвратныеДанные = Новый Структура;
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении штрихкода (код ошибки: %1)", 
											HTTPОтвет.КодСостояния);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении штрихкода. Реестр заказов Ozon", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Код ошибки: %2", Аккаунт, HTTPОтвет.КодСостояния));
			
		Иначе
			
			Возврат HTTPОтвет.ОтветКакДвоичныеДанные;
			
		КонецЕсли;
				
		//Если Не HTTPОтвет.УказаноМестоХраненияФайлов Тогда  
		//	
		//	ВозвратныеДанные.Вставить("УказаноМестоХраненияФайлов", HTTPОтвет.УказаноМестоХраненияФайлов);
		//	ВозвратныеДанные.Вставить("Сообщение", "Не указано место хранения файлов. Пожалуйста, укажите место хранения файлов.");

		//	Возврат ВозвратныеДанные;
		//				
		//Иначе
		//	
		//	КодЗапроса = HTTPОтвет.КодСостояния;
		//	
		//	Если КодЗапроса <> 200 Тогда
		//		
		//		НазваниеОшибки = "Ошибка при получении листа отгрузки в Ozon";
		//		
		//		Если HTTPОтвет.ОтветAPI.Свойство("ОтветAPI") Тогда
		//			
		//			ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
		//			
		//		Иначе
		//			
		//			ОписаниеОшибки = "Ошибка при получении PDF.";
		//			
		//		КонецЕсли;
		//		
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = "Ошибка при получении  листа отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		//		Сообщение.Сообщить();
		//		
		//		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		//		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		//		
		//		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		//		
		//		Возврат "";
		//		
		//	КонецЕсли;
		//	
		//	ВозвратныеДанные.Вставить("УказаноМестоХраненияФайлов", HTTPОтвет.УказаноМестоХраненияФайлов);
		//	ВозвратныеДанные.Вставить("Сообщение", "PDF Файл листа отгрузки успешно создан в месте хранения файлов.");    
		//	
		//	Возврат ВозвратныеДанные;
		//	
		//КонецЕсли;
		
	Иначе                                             
		
		НазваниеОшибки = "Ошибка при получении листа отгрузки в Ozon";
		ОписаниеОшибки = "Документ не найден в личном кабинете маркетплейса.";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении  листа отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);	
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Wildberries

Функция Wildberries_СозданиеПоставки(Аккаунт, НазваниеПоставки) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_СоздатьНовуюПоставку(Аккаунт, НазваниеПоставки);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 201 Тогда
			
			НазваниеОшибки = "Ошибка при создании поставки в Wildberries";
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.title;	
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при создании поставки. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат "";
			
		Иначе
			
			Возврат HTTPОтвет.ОтветAPI.id;			
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при создании поставки в Wildberries";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при создании поставки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция Wildberries_ДобавитьЗаказКПоставке(Аккаунт, НомерПоставки, МассивЗаказов) Экспорт
	
	МассивДобавленныхЗаказов = Новый Массив;
	
	КоличествоЗапросов = 0;
	
	Для каждого НомерЗаказа Из МассивЗаказов Цикл
		
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ДобавитьСборочноеЗаданиеКПоставке(Аккаунт, НомерПоставки, НомерЗаказа);
		
		КодЗапроса = HTTPОтвет.КодСостояния;
		
		Если КодЗапроса <> 204 Тогда
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				НазваниеОшибки = "Ошибка при добавлении заказа в поставку в Wildberries";
				
				Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
					
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
					
				Иначе
					
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.title;	
					
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при добавлении заказа %1 в поставку. Подробное описание ошибки можно посмотреть в журнале регистрации",
				НомерЗаказа);
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Номер поставки: %4%1Номер заказа: %5%1Описание ошибки: %6", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерПоставки, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
			Иначе
				
				НазваниеОшибки = "Ошибка при добавлении заказа в поставку в Wildberries";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при добавлении заказа %1 в поставку. Подробное описание ошибки можно посмотреть в журнале регистрации",
				НомерЗаказа);
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Номер поставки: %4%1Номер заказа: %5%1Описание ошибки: %6", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерПоставки, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				
			КонецЕсли;
			
		Иначе
			
			МассивДобавленныхЗаказов.Добавить(НомерЗаказа);			
			
		КонецЕсли; 
		
		КоличествоЗапросов = КоличествоЗапросов + 1;
		
		Если КоличествоЗапросов = 1000 Тогда
			
			КоличествоЗапросов = 0;
			
			ВремяОжидания = 60;
			
			КонДата = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < КонДата Цикл
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат МассивДобавленныхЗаказов;
	
	
КонецФункции

Функция Wildberries_ПередачаМаркировкиВМаркетплейс(Аккаунт, Заказы, МаркируемыеТовары) Экспорт
	
	КоличествоЗапросов = 0;
	
	Для каждого Строка Из Заказы Цикл
		
		НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.рар_мп_Заказ, "НомерПоДаннымКлиента");
		
		НайденныеСтроки = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		МассивМаркировок = Новый Массив;
		
		Для каждого Строка Из НайденныеСтроки Цикл
			
			Если Строка.рар_мп_ЗаполнениеМаркировки Тогда
				
				Маркировка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.рар_мп_ЧестныйЗнак, "ЗначениеШтрихкода");
				
				МассивМаркировок.Добавить(Маркировка);	
				
			КонецЕсли;	
			
		КонецЦикла;
		
		Если МассивМаркировок.Количество() > 0 Тогда
			
			HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПередачаМаркировки(Аккаунт, НомерЗаказа, МассивМаркировок);
			
			КодЗапроса = HTTPОтвет.КодСостояния;
			
			Если КодЗапроса <> 204 Тогда
				
				НазваниеОшибки = "Ошибка при передаче маркировки в Wildberries";
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
						
					Иначе
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
						
					КонецЕсли;
					
				Иначе
					
					ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
					
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при передаче маркировки в маркетплейс (номер заказа: %1). Подробное описание ошибки можно посмотреть в журнале регистрации",
				НомерЗаказа);
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Номер заказа: %4%1Описание ошибки: %5", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Ложь;
				
			КонецЕсли;
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если КоличествоЗапросов = 1000 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 60;
				
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Wildberries_ПодтверждениеОтгрузки(Аккаунт, НомерПоставки) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПередатьПоставкуВДоставку(Аккаунт, НомерПоставки);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если КодЗапроса <> 204 Тогда
		
		НазваниеОшибки = "Ошибка при подтверждении отгрузки в Wildberries";
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при подтверждении отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Wildberries_СоздатьКоробкуВПоставке(Аккаунт, НомерПоставки) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ДобавитьКоробаКПоставке(Аккаунт, НомерПоставки);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 201 Тогда
			
			НазваниеОшибки = "Ошибка при создании коробки в поставке в Wildberries";
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при создании коробки в поставке. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат "";
			
		Иначе
			
			Если HTTPОтвет.ОтветAPI.trbxIds.Количество() > 0 Тогда
				
				Возврат HTTPОтвет.ОтветAPI.trbxIds.Получить(0);	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при создании коробки в поставке. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				ОписаниеОшибки = "В полученных данных нет уникального идентификатора созданной коробки";
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
				Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат "";	
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при создании коробки в поставке. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
		Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат "";	
		
	КонецЕсли;
	
КонецФункции

Функция Wildberries_УдалитьКоробкуВПоставке(Аккаунт, НомерПоставки, УникальныйИдентификаторКоробки) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_УдалитьКоробИзПоставки(Аккаунт, НомерПоставки, УникальныйИдентификаторКоробки);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если КодЗапроса <> 204 Тогда
		
		НазваниеОшибки = "Ошибка при удалении коробки в поставке в Wildberries";
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при удалении коробки в поставке. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Wildberries_ДобавитьВКоробку(Аккаунт, НомерПоставки, УникальныйИдентификаторКоробки, НомераЗаказов) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ДобавитьЗаказыВКороб(Аккаунт, НомерПоставки, УникальныйИдентификаторКоробки, НомераЗаказов);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если КодЗапроса <> 204 Тогда
		
		НазваниеОшибки = "Ошибка при добавлении заказов в поставку в Wildberries"; 
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при добавлении заказов в поставку. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции

Функция Wildberries_УдалитьИзКоробки(Аккаунт, НомерПоставки, СтрокиДляУдаления) Экспорт
	
	МассивСтрокДляУдаления = Новый Массив;
	
	КоличествоЗапросов = 0;
	
	Для Счетчик = 0 По СтрокиДляУдаления.Количество() - 1 Цикл
		
		Строка = СтрокиДляУдаления[Счетчик];
		
		Если МассивСтрокДляУдаления.Найти(Строка) = Неопределено Тогда
			
			НомерКоробки = Строка.рар_мп_Коробка;
			НомерЗаказа	 = Строка.рар_мп_НомерЗаказа;
			НомерСтроки	 = Строка.рар_мп_СтрокаИзТЧТовары;
			Артикул		 = Строка.рар_мп_Артикул;
			
			HTTPОтвет = рар_мп_Wildberries_Методы.Метод_УдалитьЗаказИзКороба(Аккаунт, НомерПоставки, НомерКоробки, НомерЗаказа);
			
			КодЗапроса = HTTPОтвет.КодСостояния;
			
			Если КодЗапроса <> 204 Тогда
				
				НазваниеОшибки = "Ошибка при удалении заказов из поставки в Wildberries";
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
						
					Иначе
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
						
					КонецЕсли;
					
				Иначе
					
					ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
					
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при удалении заказов из поставки. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1НомерПоставки: %4%1НомерКоробки: %5
				|НомерЗаказа: %6%1Описание ошибки: %7", 
				Символы.ПС, Аккаунт, КодЗапроса, НомерПоставки, НомерКоробки, НомерЗаказа, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат МассивСтрокДляУдаления;
				
			Иначе
				
				МассивСтрокДляУдаления.Добавить(Строка);
				
				Если Счетчик + 1 <= СтрокиДляУдаления.Количество() - 1 Тогда
					
					Для Индекс = Счетчик + 1 По СтрокиДляУдаления.Количество() - 1 Цикл
						
						СледующаяСтрока = СтрокиДляУдаления[Индекс];
						
						СледующаяСтрока_НомерКоробки = СледующаяСтрока.рар_мп_Коробка;
						СледующаяСтрока_НомерЗаказа	 = СледующаяСтрока.рар_мп_НомерЗаказа;
						СледующаяСтрока_НомерСтроки	 = СледующаяСтрока.рар_мп_СтрокаИзТЧТовары;
						СледующаяСтрока_Артикул		 = СледующаяСтрока.рар_мп_Артикул;
						
						Если СледующаяСтрока_НомерКоробки = НомерКоробки И СледующаяСтрока_НомерЗаказа = НомерЗаказа И
							СледующаяСтрока_НомерСтроки = НомерСтроки И СледующаяСтрока_Артикул = Артикул Тогда
							
							МассивСтрокДляУдаления.Добавить(СледующаяСтрока);		
							
						КонецЕсли;
						
						
					КонецЦикла;	
					
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если КоличествоЗапросов = 300 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 60;
				
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСтрокДляУдаления;	
	
КонецФункции

Функция Wildberries_ПолучитьЭтикеткиЗаказов(Аккаунт, МассивНомеровЗаказов) Экспорт
	
	МассивЭтикеток = Новый Массив;
	
	МассивИзСтаНомеровЗаказов = Новый Массив;
	
	КоличествоЗапросов = 0;
	
	Для каждого НомерЗаказа Из МассивНомеровЗаказов Цикл
		
		МассивИзСтаНомеровЗаказов.Добавить(НомерЗаказа);
		
		Если МассивИзСтаНомеровЗаказов.Количество() = 100 ИЛИ МассивНомеровЗаказов.Количество() = МассивИзСтаНомеровЗаказов.Количество() Тогда
			
			HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьСтикерыСборочныхЗаданий(Аккаунт, МассивИзСтаНомеровЗаказов);
			
			КодЗапроса = HTTPОтвет.КодСостояния;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда 
				
				Если КодЗапроса <> 200 Тогда
					
					НазваниеОшибки = "Ошибка при получении этикеток заказов в Wildberries";
					
					Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
						
					Иначе
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
						
					КонецЕсли;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении этикеток заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
					Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивЭтикеток.Очистить();
					
					Возврат МассивЭтикеток;
					
					
				Иначе
					
					Для каждого Строка Из HTTPОтвет.ОтветAPI.stickers Цикл
						
						МассивЭтикеток.Добавить(Base64Значение(Строка.file));	
						
					КонецЦикла;
					
					
				КонецЕсли;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении этикеток заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
				Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				МассивЭтикеток.Очистить();
				
				Возврат МассивЭтикеток;
				
			КонецЕсли;
			
			МассивИзСтаНомеровЗаказов.Очистить();
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если КоличествоЗапросов = 300 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 60;
				
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивЭтикеток;
	
КонецФункции

Функция Wildberries_ПолучитьЭтикеткуПоставки(Аккаунт, НомерПоставки) Экспорт
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучениеQRКодаПоставки(Аккаунт, НомерПоставки);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при получении этикетки поставки в Wildberries";
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении этикетки поставки. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат "";
			
		Иначе
			
			Возврат Base64Значение(HTTPОтвет.ОтветAPI.file);			
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении этикетки поставки в Wildberries";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении этикетки поставки. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция Wildberries_ПолучитьСтикерыКоробовПоставки(Аккаунт, НомерПоставки, Коробки) Экспорт
	
	МассивЭтикеток = Новый Массив;
	
	МассивКоробок = Коробки.ВыгрузитьКолонку("рар_мп_Коробка");
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьСтикерыКоробовПоставки(Аккаунт, НомерПоставки, МассивКоробок);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при получении стикеров для коробок в Wildberries";
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении стикеров для коробок. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
			Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			МассивЭтикеток.Очистить();
			
			Возврат МассивЭтикеток;
			
		Иначе
			
			Стикеры = HTTPОтвет.ОтветAPI.stickers;
			
			Для каждого Стикер Из Стикеры Цикл
				
				МассивЭтикеток.Добавить(Base64Значение(Стикер.file));		
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении стикеров для коробок в Wildberries";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении стикеров для коробок. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
		Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		МассивЭтикеток.Очистить();
		
		Возврат МассивЭтикеток;	
		
	КонецЕсли;
	
	Возврат МассивЭтикеток;
	
КонецФункции

Функция Wildberries_СформироватьЛистПодбора(Аккаунт, МассивНомеровЗаказов) Экспорт
	
	МассивЭтикеток = Новый Массив;
	
	МассивИзСтаНомеровЗаказов = Новый Массив;
	
	КоличествоЗапросов = 0;
	
	Для каждого НомерЗаказа Из МассивНомеровЗаказов Цикл
		
		МассивИзСтаНомеровЗаказов.Добавить(НомерЗаказа);
		
		Если МассивИзСтаНомеровЗаказов.Количество() = 100 ИЛИ МассивНомеровЗаказов.Количество() = МассивИзСтаНомеровЗаказов.Количество() Тогда
			
			HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьСтикерыСборочныхЗаданий(Аккаунт, МассивИзСтаНомеровЗаказов);
			
			КодЗапроса = HTTPОтвет.КодСостояния;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда 
				
				Если КодЗапроса <> 200 Тогда
					
					НазваниеОшибки = "Ошибка при получении информации об этикетках для заказов в Wildberries";
					
					Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
						
					Иначе
						
						ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
						
					КонецЕсли;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении  информации об этикетках для заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
					Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивЭтикеток.Очистить();
					
					Возврат МассивЭтикеток;
					
					
				Иначе
					
					Для каждого Строка Из HTTPОтвет.ОтветAPI.stickers Цикл
						
						МассивЭтикеток.Добавить(Новый Структура("НомерЗаказа, partA, partB", Формат(Строка.orderId, "ЧГ="), Строка.partA, Строка.partB));	
						
					КонецЦикла;
					
					
				КонецЕсли;
				
			Иначе
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении  информации об этикетках для заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
				Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				МассивЭтикеток.Очистить();
				
				Возврат МассивЭтикеток;
				
			КонецЕсли;
			
			МассивИзСтаНомеровЗаказов.Очистить();
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если КоличествоЗапросов = 300 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 60;
				
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивЭтикеток;	
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

#КонецОбласти