Функция ПолучитьДанныеПоискаНоменклатуры(СтрокаПоиска) Экспорт
	МассивНоменклатуры = СоздатьПолнотекстовыйПоискДляСправочника("Номенклатура", СтрокаПоиска);
	
	ДанныеНоменклатуры = ПолучитьданныеПоНоменклатуре(МассивНоменклатуры);
	
	Возврат ДанныеНоменклатуры;
КонецФункции 

Функция СоздатьПолнотекстовыйПоискДляСправочника(Справочник, СтрокаПоиска)
	РазмерПорции = 20;
    СловоДляПоиска = СтрокаПоиска+"*"; 
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СловоДляПоиска, РазмерПорции); 
	СписокПоиска.ОбластьПоиска.Добавить(Метаданные.Справочники[Справочник]);
	СписокПоиска.ПолучатьОписание = Ложь;
	СписокПоиска.ПолучатьПредставление = Ложь;
	//СписокПоиска.ПорогНечеткости = 30;
	
	СписокПоиска.ПерваяЧасть();
	
	МассивПоиска = Новый Массив;
	
	Для Каждого Строка Из СписокПоиска Цикл
		МассивПоиска.Добавить(Строка.Значение);
	КонецЦикла;
	
	Возврат МассивПоиска;
КонецФункции   

Функция ПолучитьданныеПоНоменклатуре(МассивНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Представление КАК Представление
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивНоменклатуры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Новый Структура("Ссылка, Представление", Выборка.Ссылка, Выборка.Представление)); 
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
КонецФункции
