 
 Функция СформироватьJSON_СписокТоваров(ИдентификаторСтраницы) Экспорт
	 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	 
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("filter"); 
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("offer_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("visibility");
	ЗаписьJSON.ЗаписатьЗначение("ALL");
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("last_id"); 
	ЗаписьJSON.ЗаписатьЗначение(ИдентификаторСтраницы);
	ЗаписьJSON.ЗаписатьИмяСвойства("limit");
	ЗаписьJSON.ЗаписатьЗначение(1000);
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
 
КонецФункции

 Функция СформироватьJSON_ПолучитьОписаниеХарактеристикТовара(Товары) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	 
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("offer_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Товар Из Товары Цикл
		ЗаписьJSON.ЗаписатьЗначение(Формат(Товар.product_id, "ЧГ="));
	КонецЦикла;

	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("sku");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;		
 
 КонецФункции
 
 Функция СформироватьJSON_ПолучитьСписокОтправлений(КоличествоПропущенных) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	 
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("dir");
	ЗаписьJSON.ЗаписатьЗначение("ASC");
	
	ЗаписьJSON.ЗаписатьИмяСвойства("filter");	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("since");
	ЗаписьJSON.ЗаписатьЗначение(Строка(ЗаписатьДатуJSON(НачалоДня(ТекущаяДата()) - 60 * 60 * 720, ФорматДатыJSON.ISO))+ "Z");
		
	ЗаписьJSON.ЗаписатьИмяСвойства("to");
	ЗаписьJSON.ЗаписатьЗначение(Строка(ЗаписатьДатуJSON(КонецДня(ТекущаяДата()),ФорматДатыJSON.ISO))+ "Z");
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("limit");
	ЗаписьJSON.ЗаписатьЗначение(1000);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("offset");
	ЗаписьJSON.ЗаписатьЗначение(КоличествоПропущенных);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("with");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("analytics_data");
	ЗаписьJSON.ЗаписатьЗначение(Истина);
	ЗаписьJSON.ЗаписатьИмяСвойства("financial_data");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	ЗаписьJSON.ЗаписатьИмяСвойства("barcodes");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	ЗаписьJSON.ЗаписатьИмяСвойства("translit");
	ЗаписьJSON.ЗаписатьЗначение(Истина);

	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;		
 
КонецФункции

 Функция СформироватьJSON_СформироватьСписокНоменклатуры(МассивСтрокНоменклатуры) Экспорт
	
	 ЗаписьJSON 				   = Новый ЗаписьJSON;
	 ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	 ПараметрыЗаписиJSON           = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	 ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	 
	 ЗаписьJSON.ЗаписатьНачалоОбъекта();  
	 
	 ЗаписьJSON.ЗаписатьИмяСвойства("stocks");
	 ЗаписьJSON.ЗаписатьНачалоМассива();
	 
	 Для каждого Номенклатура из МассивСтрокНоменклатуры Цикл 
		 
		 ЗаписьJSON.ЗаписатьНачалоОбъекта();
		 ЗаписьJSON.ЗаписатьИмяСвойства("offer_id");
		 ЗаписьJSON.ЗаписатьЗначение(Строка(Номенклатура.Артикул));
		 ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
		 ЗаписьJSON.ЗаписатьЗначение(Номенклатура.IDТовара);
		 ЗаписьJSON.ЗаписатьИмяСвойства("stock");
		 ЗаписьJSON.ЗаписатьЗначение(МИН(Номенклатура.ВНаличии,Номенклатура.КоличествоОстаток));
		 ЗаписьJSON.ЗаписатьИмяСвойства("warehouse_id");
		 ЗаписьJSON.ЗаписатьЗначение(СтрЗаменить(Номенклатура.УникальныйИдентификаторСклада,Символы.НПП,""));	
		 ЗаписьJSON.ЗаписатьКонецОбъекта(); 	 
		 
	 КонецЦикла;       
	 
	 
	 ЗаписьJSON.ЗаписатьКонецМассива();
	 ЗаписьJSON.ЗаписатьКонецОбъекта(); 
	 
	 СтрокаJSON = ЗаписьJSON.Закрыть();
	 
	 Возврат СтрокаJSON;
	 
 КонецФункции
 
 Функция СформироватьJSON_ПередачаМаркировки(ТоварыСМаркировками, Заказ, КоличествоКоробок) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();  
	
	ЗаписьJSON.ЗаписатьИмяСвойства("multi_box_qty");
	ЗаписьJSON.ЗаписатьЗначение(КоличествоКоробок);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("posting_number");
	ЗаписьJSON.ЗаписатьЗначение(Заказ.НомерПоДаннымКлиента);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("products");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого СтрокаТЧ Из Заказ.Товары Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		НомерСтроки = Заказ.Товары.Индекс(СтрокаТЧ) + 1;
		
		НужныеСтроки = ТоварыСМаркировками.НайтиСтроки(Новый Структура("рар_мп_СтрокаИзТЧТовары", НомерСтроки));
		
		ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
		ЗаписьJSON.ЗаписатьЗначение(Формат(Число(НужныеСтроки.Получить(0).рар_мп_IDТовара), "ЧГ=0"));
		
		ЗаписьJSON.ЗаписатьИмяСвойства("quantity");
		ЗаписьJSON.ЗаписатьЗначение(НужныеСтроки.Количество());
		
		ГТДНужен = НужныеСтроки.Получить(0).рар_мп_ЗаполнениеГТД;
		
		ЗаписьJSON.ЗаписатьИмяСвойства("is_gtd_needed");
		ЗаписьJSON.ЗаписатьЗначение(ГТДНужен);
		
		МаркировкаНужна = НужныеСтроки.Получить(0).рар_мп_ЗаполнениеМаркировки;
		
		ЗаписьJSON.ЗаписатьИмяСвойства("is_mandatory_mark_needed");
		ЗаписьJSON.ЗаписатьЗначение(МаркировкаНужна);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("exemplars");
		ЗаписьJSON.ЗаписатьНачалоМассива();
	
		
		Для каждого Строка Из НужныеСтроки Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();	 
			
			ЗаписьJSON.ЗаписатьИмяСвойства("exemplar_id");
			ЗаписьJSON.ЗаписатьЗначение(Строка.рар_мп_Exemplar_Id);
			//Проверить ГТД
			Если Строка.рар_мп_ЗаполнениеГТД Тогда
				
				Если ЗначениеЗаполнено(Строка.рар_мп_НомерГТД) Тогда
					ЗаписьJSON.ЗаписатьИмяСвойства("gtd");
					ЗаписьJSON.ЗаписатьЗначение(Строка.рар_мп_НомерГТД.Код);
				Иначе
					ЗаписьJSON.ЗаписатьИмяСвойства("is_gtd_absent");
					ЗаписьJSON.ЗаписатьЗначение(Истина);
				КонецЕсли;
			
			КонецЕсли;
			//Проверить ГТД
			Если Строка.рар_мп_ЗаполнениеМаркировки Тогда
				
				ЗаписьJSON.ЗаписатьИмяСвойства("mandatory_mark");
				ЗаписьJSON.ЗаписатьЗначение(Строка.рар_мп_ЧестныйЗнак.ЗначениеШтрихкода);
			
			КонецЕсли;
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
		
	ЗаписьJSON.ЗаписатьКонецМассива();
		
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;		
 
 КонецФункции
 
 Функция СформироватьJSON_СозданиеЗаданияНаФормированияЭтикеток(НомераЗаказов) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("posting_number");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для каждого НомерЗаказа Из НомераЗаказов Цикл
	
		ЗаписьJSON.ЗаписатьЗначение(НомерЗаказа);	
	
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON	
 
 КонецФункции
 
 Функция СформироватьJSON_ПолучитьФайлСЭтикетками(НомерЗадания) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("task_id");
	ЗаписьJSON.ЗаписатьЗначение(НомерЗадания);	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON	
 
 КонецФункции
 
 Функция СформироватьJSON_ПолучитьДанныеСозданныхЭкземпляров(НомерЗаказа) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("posting_number");
	ЗаписьJSON.ЗаписатьЗначение(НомерЗаказа);	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON	
 
 КонецФункции
 
 Функция СформироватьJSON_СобратьЗаказ(НомерЗаказа, РаспределениеТоваров, МаркируемыеТовары, Коробки) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("posting_number");
	ЗаписьJSON.ЗаписатьЗначение(НомерЗаказа); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("with");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
	ЗаписьJSON.ЗаписатьИмяСвойства("additional_data");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);					
					
	ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	ЗаписьJSON.ЗаписатьИмяСвойства("packages");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	
	Для каждого Коробка Из Коробки Цикл 
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("products");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		НайденныеСтроки = РаспределениеТоваров.НайтиСтроки(Новый Структура("рар_мп_Коробка", Коробка.рар_мп_Коробка));
		
		РаспределенныеТоварыДляКоробки = РаспределениеТоваров.Скопировать(НайденныеСтроки);
		
		РаспределенныеТоварыДляКоробки.Свернуть("рар_мп_СтрокаИзТЧТовары, рар_мп_Номенклатура, рар_мп_Характеристика", "рар_мп_КоличествоУпаковок");
		
		Для каждого Строка Из РаспределенныеТоварыДляКоробки Цикл
		
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ВыбранныеСтроки = МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_СтрокаИзТЧТовары, рар_мп_Номенклатура, рар_мп_Характеристика", 
											 Строка.рар_мп_СтрокаИзТЧТовары, Строка.рар_мп_Номенклатура, Строка.рар_мп_Характеристика));
											 
			УникальныйИденификаторТовара = ВыбранныеСтроки.Получить(0).рар_мп_IDТовара;
			
			ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
			ЗаписьJSON.ЗаписатьЗначение(Число(УникальныйИденификаторТовара));
			ЗаписьJSON.ЗаписатьИмяСвойства("quantity");
			ЗаписьJSON.ЗаписатьЗначение(Строка.рар_мп_КоличествоУпаковок);
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		КонецЦикла;
				
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	
	ЗаписьJSON.ЗаписатьКонецМассива();
			
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;	
 
 КонецФункции
 
 Функция СформироватьJSON_ПодтверждениеОтгрузки(ИдентификаторМетодаДоставки, ПодключенаДоверительнаяПриемка, КоличествоГрузовыхМест) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	Если ПодключенаДоверительнаяПриемка Тогда
	
		ЗаписьJSON.ЗаписатьИмяСвойства("containers_count");
		ЗаписьJSON.ЗаписатьЗначение(КоличествоГрузовыхМест);	
	
	КонецЕсли;
	
	ЗаписьJSON.ЗаписатьИмяСвойства("delivery_method_id");
	ЗаписьJSON.ЗаписатьЗначение(Число(ИдентификаторМетодаДоставки));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("departure_date");
	ЗаписьJSON.ЗаписатьЗначение(Строка(ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO)) + ".444Z");
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON	
 
КонецФункции

 Функция СформироватьJSON_ПолучитьОтчетОРеализацииТоваров(Год, Месяц) Экспорт
	 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("month");
	ЗаписьJSON.ЗаписатьЗначение(Месяц);
	ЗаписьJSON.ЗаписатьИмяСвойства("year");
	ЗаписьJSON.ЗаписатьЗначение(Год);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	 
КонецФункции

 Функция СформироватьJSON_СформироватьЦеныНоменклатуры(МассивСтрокНоменклатуры) Экспорт
	
	 ЗаписьJSON 				   = Новый ЗаписьJSON;
	 ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	 ПараметрыЗаписиJSON           = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	 ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	 
	 ЗаписьJSON.ЗаписатьНачалоОбъекта();  
	 
	 ЗаписьJSON.ЗаписатьИмяСвойства("prices");
	 ЗаписьJSON.ЗаписатьНачалоМассива();
	 
	 Для каждого Номенклатура из МассивСтрокНоменклатуры Цикл 
		 
		 ЗаписьJSON.ЗаписатьНачалоОбъекта();
		 ЗаписьJSON.ЗаписатьИмяСвойства("auto_action_enabled");  
		 ЗаписьJSON.ЗаписатьЗначение("UNKNOWN");  
		 ЗаписьJSON.ЗаписатьИмяСвойства("currency_code");  
		 ЗаписьJSON.ЗаписатьЗначение("RUB"); 
		 
		 ЗаписьJSON.ЗаписатьИмяСвойства("min_price"); 
		 Если Номенклатура.ВидЦены_МинимальнаяЦена > 0 Тогда 
			 ЗаписьJSON.ЗаписатьЗначение(Строка(Формат(Номенклатура.ВидЦены_МинимальнаяЦена, "ЧГ=")));
		 Иначе
			 ЗаписьJSON.ЗаписатьЗначение("");
		 КонецЕсли;     
		 
		 //ЗаписьJSON.ЗаписатьИмяСвойства("min_price_for_auto_actions_enabled");  
		 //ЗаписьJSON.ЗаписатьЗначение(true);    
		 ЗаписьJSON.ЗаписатьИмяСвойства("net_price");
		 Если Номенклатура.ВидЦены_Себестоимость > 0 Тогда  
			 ЗаписьJSON.ЗаписатьЗначение(Строка(Формат(Номенклатура.ВидЦены_Себестоимость, "ЧГ="))); 
		 Иначе
			 ЗаписьJSON.ЗаписатьЗначение("");
		 КонецЕсли;     
		 
		 ЗаписьJSON.ЗаписатьИмяСвойства("offer_id");  
		 ЗаписьJSON.ЗаписатьЗначение(""); 
		 
		 ЗаписьJSON.ЗаписатьИмяСвойства("old_price"); 
		 Если Номенклатура.ВидЦены_ЦенаДоСкидок > 0 Тогда 
			 ЗаписьJSON.ЗаписатьЗначение(Строка(Формат(Номенклатура.ВидЦены_ЦенаДоСкидок, "ЧГ=")));  
		 Иначе
			  ЗаписьJSON.ЗаписатьЗначение("");
		 КонецЕсли;
		 
		 ЗаписьJSON.ЗаписатьИмяСвойства("price"); 
		 Если Номенклатура.ВидЦены_ЦенаТовараСУчётомСкидок > 0 Тогда 
			 ЗаписьJSON.ЗаписатьЗначение(Строка(Формат(Номенклатура.ВидЦены_ЦенаТовараСУчётомСкидок, "ЧГ=")));
		 Иначе
			 ЗаписьJSON.ЗаписатьЗначение("");
		 КонецЕсли;
	 
		 ЗаписьJSON.ЗаписатьИмяСвойства("price_strategy_enabled");  
		 ЗаписьJSON.ЗаписатьЗначение("UNKNOWN"); 
		 ЗаписьJSON.ЗаписатьИмяСвойства("product_id");  
		 ЗаписьJSON.ЗаписатьЗначение(Число(Формат(Номенклатура.SKUТовара,"ЧГ=")));
		 
		 //ЗаписьJSON.ЗаписатьИмяСвойства("quant_size");  
		 //ЗаписьJSON.ЗаписатьЗначение(1); 
		 //ЗаписьJSON.ЗаписатьИмяСвойства("vat");  
		 //ЗаписьJSON.ЗаписатьЗначение(Строка("123")); 
		 
		 ЗаписьJSON.ЗаписатьКонецОбъекта(); 	 
		 
	 КонецЦикла;       
	 
	 ЗаписьJSON.ЗаписатьКонецМассива();
	 ЗаписьJSON.ЗаписатьКонецОбъекта(); 
	 
	 СтрокаJSON = ЗаписьJSON.Закрыть();
	 
	 Возврат СтрокаJSON;    
	 	 
 КонецФункции

 Функция СформироватьJSON_ПолучитьХарактеристикуТовара(Товары) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("filter");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("product_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Товар Из Товары Цикл
		ЗаписьJSON.ЗаписатьЗначение(Формат(Товар.product_id, "ЧГ="));
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("offer_id");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьИмяСвойства("sku");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьКонецМассива();  
	ЗаписьJSON.ЗаписатьИмяСвойства("visibility");   
    ЗаписьJSON.ЗаписатьЗначение("ALL");
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("limit");   
    ЗаписьJSON.ЗаписатьЗначение(1000);
	ЗаписьJSON.ЗаписатьИмяСвойства("sort_dir");   
    ЗаписьJSON.ЗаписатьЗначение("ASC");
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
 
 КонецФункции

 Функция СформироватьJSON_ОтчетПоОстаткамИТоварамFBO() Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);		                             
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("limit");
	ЗаписьJSON.ЗаписатьЗначение(1000);  
	ЗаписьJSON.ЗаписатьИмяСвойства("offset");
	ЗаписьJSON.ЗаписатьЗначение(0);
	ЗаписьJSON.ЗаписатьИмяСвойства("warehouse_type");
	ЗаписьJSON.ЗаписатьЗначение("ALL");
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
 
КонецФункции     

 Функция СформироватьJSON_ИнформацияОбОстаткахНаСкладахПродавца_FBS_rFBS(МассивНоменклатуры) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("sku");
	ЗаписьJSON.ЗаписатьНачалоМассива(); 
	
	Для каждого Номенклатура из МассивНоменклатуры Цикл  
		
		Если ЗначениеЗаполнено(Номенклатура.SKUТовара) Тогда 
			
			IDБезПробелов = СтрЗаменить(Строка(Номенклатура.SKUТовара), Символы.НПП, "");
			ЗаписьJSON.ЗаписатьЗначение(IDБезПробелов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
 
 КонецФункции
 
 Функция СформироватьJSON_ШтрихкодДляОтгрузкиОтправления(ИдентификаторПеревозки) Экспорт
 
 	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();     
	
	ЗаписьJSON.ЗаписатьИмяСвойства("id"); 	
	ЗаписьJSON.ЗаписатьЗначение(Число(ИдентификаторПеревозки));	 
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
 
 КонецФункции
 
 Функция СформироватьJSON_ПолучитьФайлЛистОтгрузки(НомерПоставки) Экспорт
 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();     
	
	ЗаписьJSON.ЗаписатьИмяСвойства("id"); 	
	ЗаписьJSON.ЗаписатьЗначение(Строка(НомерПоставки));
	ЗаписьJSON.ЗаписатьИмяСвойства("doc_type"); 	
	ЗаписьJSON.ЗаписатьЗначение("act_of_acceptance");
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	

 КонецФункции 
 
 Функция СформироватьJSON_ПолучитьСтатусЛистаОтгрузки(НомерПоставки) Экспорт
 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();     
	
	ЗаписьJSON.ЗаписатьИмяСвойства("id"); 	
	ЗаписьJSON.ЗаписатьЗначение(Число(НомерПоставки));
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	


КонецФункции 

 Функция СформироватьJSON_ПолучитьСписокОтправленийВАкте(НомерПоставки) Экспорт
 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();     
	ЗаписьJSON.ЗаписатьИмяСвойства("id");
	ЗаписьJSON.ЗаписатьЗначение(Число(НомерПоставки));
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); 

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
	
КонецФункции 

