#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	ОкНаСервере();
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере()
	согл = согласие;
	Константы.рар_мп_Согласие.Установить(согл);  
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	согласие = Ложь; 
	
	ОбластьМакета = ПолучитьОбщийМакет("рар_мп_СоставУслугТехнологическойПоддержки").ПолучитьОбласть("ОбластьТекста");
	СоставУслугТехнологическойПоддержки.Вывести(ОбластьМакета);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

#КонецОбласти