
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Баркод, Номенклатура, Характеристика, Упаковка, Количество");
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПрочиеПроцедурыИФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура КоличествоЧастейРазделенияПриИзменении(Элемент)
	
	РазделенныеТовары.Очистить();
	Для Итерация = 1 По КоличествоЧастейРазделения Цикл
		
		НоваяСтрока = РазделенныеТовары.Добавить();   
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "Баркод, Номенклатура, Характеристика, Упаковка");
		
	КонецЦикла;	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура РазделенныеТоварыКоличествоПриИзменении(Элемент)     
	КоличествоРазделенныхТоваров = РазделенныеТовары.Итог("Количество");
	Если КоличествоРазделенныхТоваров > Количество Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Суммарное количество разделенных товаров (%1) не должно превышать количество выбранного товара (%2).", 
		КоличествоРазделенныхТоваров, Количество);
		Сообщение.Сообщить();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область РазделениеТоваров

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура Разделить(Команда)
	РазделенныеТовары.Очистить();
	Для Итерация = 1 По КоличествоЧастейРазделения Цикл
		
		НоваяСтрока = РазделенныеТовары.Добавить();   
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "Баркод, Номенклатура, Характеристика, Упаковка");
		
	КонецЦикла;
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗавершитьРазделение(Команда)
	КоличествоРазделенныхТоваров = РазделенныеТовары.Итог("Количество");
	Если КоличествоРазделенныхТоваров <> Количество Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Суммарное количество разделенных товаров не равно количеству выбранного товара. Пожалуйста, измените количество разделенных товаров.";
		Сообщение.Сообщить();     
		
	Иначе
		
		НулевоеКоличество = Ложь;
		Для каждого Строка Из РазделенныеТовары Цикл
			
			Если Строка.Количество = 0 Тогда
				
				НулевоеКоличество = Истина; 
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;    
		
		Если Не НулевоеКоличество Тогда
			
			Оповестить("РазделениеТоваров", РазделенныеТовары);     
			
			ВыбранныйТовар = ВладелецФормы.Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));  
			
			ВладелецФормы.Объект.рар_мп_ТоварыИзЗаказов.Удалить(ВыбранныйТовар[0].НомерСтроки - 1);          
			
			Закрыть();   
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В одной из строк указано нулевое количество. Пожалуйста, укажите количество во всех строках.";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
