
&НаКлиенте
Процедура рар_мп_МестоХраненияФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог для сохранения файлов";
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		НаборКонстант.рар_мп_МестоХраненияФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли; 
	
КонецПроцедуры
