Функция НачатьОбмен(КодУзла, НомерОтправленного, НомерПринятого, Версия)
	УстановитьПривилегированныйРежим(Истина);
	УзелОбмена = ПланыОбмена.ОбменДаннымиМобильноеПриложение.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда		
		Возврат "";		
	КонецЕсли;                 
	   
	//Если УзелОбмена.НомерОтправленного > НомерОтправленного ИЛИ УзелОбмена.НомерПринятого < НомерПринятого Тогда
	Если УзелОбмена.НомерОтправленного <> НомерОтправленного ИЛИ УзелОбмена.НомерПринятого <> НомерПринятого Тогда
		Узел = УзелОбмена.ПолучитьОбъект();
		Узел.НомерОтправленного = НомерОтправленного;
		Узел.НомерПринятого = НомерПринятого;
		Узел.Записать();
		
		//Обмен.ЗарегистрироватьИзмененияДанных(УзелОбмена);
	КонецЕсли; 
	
	ПланыОбмена.ОбменДаннымиМобильноеПриложение.ПроверитьЗаполненностьПредопределенногоУзла();
	
	Возврат УзелОбмена.Код;
КонецФункции

Функция ПолучитьДанные(КодУзла, Версия, РазмерПакета)
	УстановитьПривилегированныйРежим(Истина);
	УзелОбмена = ПланыОбмена.ОбменДаннымиМобильноеПриложение.НайтиПоКоду(КодУзла);	
	Если УзелОбмена.Пустая() Тогда		
		ВызватьИсключение("Неизвестное устройство – " + КодУзла);		
	КонецЕсли; 
	
	ПараметрыСеанса.ТекущийУзелТСД=ПланыОбмена.ОбменДаннымиМобильноеПриложение.НайтиПоКоду(КодУзла);  
	
	Возврат Обмен.СформироватьПакетОбмена(УзелОбмена,РазмерПакета);
КонецФункции

Функция ЗаписатьДанные(КодУзла, ДанныеМобильногоПриложения, Версия)
	УстановитьПривилегированныйРежим(Истина);
	УзелОбмена = ПланыОбмена.ОбменДаннымиМобильноеПриложение.НайтиПоКоду(КодУзла);	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение("Неизвестное устройство - " + КодУзла);
	КонецЕсли;
	Обмен.ПринятьПакетОбмена(УзелОбмена, ДанныеМобильногоПриложения);
КонецФункции

