
Функция СформироватьJSON_СписокКарточекТоваров(ДатаИзменения = "", НомерСтраницы = "") Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("settings");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("sort");
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("ascending");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("filter");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("withPhoto");
	ЗаписьJSON.ЗаписатьЗначение(-1); 
	ЗаписьJSON.ЗаписатьИмяСвойства("allowedCategoriesOnly");
	ЗаписьJSON.ЗаписатьЗначение(Ложь); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("cursor");	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	ЗаписьJSON.ЗаписатьИмяСвойства("limit");
	ЗаписьJSON.ЗаписатьЗначение(100);
	Если ЗначениеЗаполнено(ДатаИзменения) Тогда
	
		ЗаписьJSON.ЗаписатьИмяСвойства("updatedAt");
		ЗаписьJSON.ЗаписатьЗначение(ДатаИзменения);		
	
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерСтраницы) Тогда
	
		ЗаписьJSON.ЗаписатьИмяСвойства("nmID");
		ЗаписьJSON.ЗаписатьЗначение(НомерСтраницы);		
	
	КонецЕсли;
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
    ЗаписьJSON.ЗаписатьКонецОбъекта();

    ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON	

КонецФункции

Функция СформироватьJSON_ПолучитьСтатусыЗаказов(НомерЗаказа) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("orders");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьЗначение(НомерЗаказа);
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON

КонецФункции

Функция СформироватьJSON_СоздатьНовуюПоставку(НазваниеПоставки) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("name");
	ЗаписьJSON.ЗаписатьЗначение(НазваниеПоставки);	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON		

КонецФункции

Функция СформироватьJSON_ПередатьМаркировкуВМаркетплейс(Маркировки) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("sgtins");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для каждого Маркировка Из Маркировки Цикл
	
		ЗаписьJSON.ЗаписатьЗначение(Маркировка);	
	
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON		

КонецФункции

Функция СформироватьJSON_ПолучитьСтикерыСборочныхЗаданий(НомераЗаказов) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("orders");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для каждого НомерЗаказа Из НомераЗаказов Цикл
	
		ЗаписьJSON.ЗаписатьЗначение(Число(НомерЗаказа));	
	
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON		

КонецФункции

Функция СформироватьJSON_ДобавитьКоробаКПоставке() Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("amount");
	ЗаписьJSON.ЗаписатьЗначение(1);	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON		

КонецФункции

Функция СформироватьJSON_УдалитьКоробИзПоставки(ИдентификаторКоробки) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("trbxIds");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ЗаписьJSON.ЗаписатьЗначение(ИдентификаторКоробки);	
	ЗаписьJSON.ЗаписатьКонецМассива();	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON		

КонецФункции

Функция СформироватьJSON_ДобавитьЗаказыВКороб(НомераЗаказов) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();	
	
	ЗаписьJSON.ЗаписатьИмяСвойства("orderIds");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для каждого НомерЗаказа Из НомераЗаказов Цикл
	
		ЗаписьJSON.ЗаписатьЗначение(Число(НомерЗаказа));	
	
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();

	СтрокаJSON = ЗаписьJSON.Закрыть();
	
 	Возврат СтрокаJSON		

КонецФункции
     
Функция СформироватьJSON_СформироватьСписокНоменклатуры(МассивСтрокНоменклатуры) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("stocks");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Номенклатура из МассивСтрокНоменклатуры Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("sku");
		ЗаписьJSON.ЗаписатьЗначение(Номенклатура.Баракод);
		ЗаписьJSON.ЗаписатьИмяСвойства("amount"); 
		ЗаписьJSON.ЗаписатьЗначение(МИН(Номенклатура.ВНаличии, Номенклатура.КоличествоОстаток));
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON; 
	
КонецФункции

Функция СформироватьJSON_ПолучитьСтикерыКоробовПоставки(МассивКоробов) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("trbxIds");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Короб из МассивКоробов Цикл
		
		ЗаписьJSON.ЗаписатьЗначение(Короб);	
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	

КонецФункции

Функция СформироватьJSON_ПолучитьОстаткиТоваров(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("skus");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для каждого Строка из Данные Цикл
		
		ЗаписьJSON.ЗаписатьЗначение(Строка.Баракод);	
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;	
	
КонецФункции

Функция СформироватьJSON_УстановитьЦеныИСкидки(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Строка Из Данные Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("nmID");
		ЗаписьJSON.ЗаписатьЗначение(Строка.АртикулWB);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("price");
		ЗаписьJSON.ЗаписатьЗначение(Строка.Цена);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("discount");
		ЗаписьJSON.ЗаписатьЗначение(Строка.Скидка);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_УстановитьЦеныДляРазмеров(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Строка Из Данные Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("nmID");
		ЗаписьJSON.ЗаписатьЗначение(Строка.АртикулWB);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("sizeID");
		ЗаписьJSON.ЗаписатьЗначение(Строка.IDРазмера);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("price");
		ЗаписьJSON.ЗаписатьЗначение(Строка.Цена);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSON_УстановитьСкидкиWBКлуба(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Строка Из Данные Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("nmID");
		ЗаписьJSON.ЗаписатьЗначение(Строка.АртикулWB);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("clubDiscount");
		ЗаписьJSON.ЗаписатьЗначение(Строка.Скидка);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); 
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции
