
#Область ЯндексМаркет

Процедура ЯндексМаркет_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.ЯндексМаркет)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток,
	|	рар_мп_СопоставленныеСклады.рар_мп_ЯМ_campaignId КАК рар_мп_ЯМ_campaignId
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Артикул КАК Артикул,
	|	рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара КАК SKUТовара
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВТ_Номенклатура.SKUТовара КАК SKUТовара,
	|	ВТ_АккаунтыИСклады.рар_мп_ЯМ_campaignId КАК рар_мп_ЯМ_campaignId
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.рар_мп_ЯМ_campaignId КАК Магазин,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.SKUТовара КАК SKUТовара,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.рар_мп_ЯМ_campaignId,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.Артикул,
	|	ВТ_Данные.SKUТовара,
	|	ВТ_Данные.Аккаунт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Магазин,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт,
	|	Магазин";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";
		
		ЗаписьЖурналаРегистрации("Передача остатков ЯндексМаркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
		
		Возврат;
		
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаСклад = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи    = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.Прямой);  
			ЛимитТовара               = 0;
			КоличествоСтрок           = 0; 
			МассивСтрокНоменклатуры   = Новый Массив;   
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЛимитТовара >= 100000 Тогда
					
					ВремяОжидания = 60;
							
					КонДата = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < КонДата Цикл
						
					КонецЦикла;
					
					ЛимитТовара = 0;   
					
				КонецЕсли;
				
				Если КоличествоСтрок >= 2000 Тогда      
					
					ОтветHTTP = рар_мп_ЯндексМаркет_Методы.Метод_ПередачаИнформацииОбОстатках(Выборка.Аккаунт, ВыборкаСклад.Магазин,
					МассивСтрокНоменклатуры);
					МассивСтрокНоменклатуры.Очистить(); 
					КоличествоСтрок = 0; 
						
					Если ОтветHTTP.КодСостояния <> 200 Тогда 
						
						Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.errors.Получить(0).message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

							Возврат;
							
						Иначе    
						
							Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

							Возврат;	
							
						КонецЕсли;
							
					КонецЕсли;   
				
				КонецЕсли;    
				
				СтруктураПолученныхЗначение = Новый Структура("SKUТовара, КоличествоОстаток, ВНаличии", ВыборкаДетальныеЗаписи.SKUТовара, 
																ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии);
				
				МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);
				ЛимитТовара     = ЛимитТовара + 1;
				КоличествоСтрок = КоличествоСтрок + 1; 
				
			КонецЦикла; 
			
			Если МассивСтрокНоменклатуры.Количество() > 0 Тогда
			    
				ОтветHTTP = рар_мп_ЯндексМаркет_Методы.Метод_ПередачаИнформацииОбОстатках(Выборка.Аккаунт, ВыборкаСклад.Магазин, 
																						  МассивСтрокНоменклатуры);
				Если ОтветHTTP.КодСостояния <> 200 Тогда 
						
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
					
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.errors.Получить(0).message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти  

#Область Ozon

Процедура Ozon_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.OZON)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_Ozon_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_Ozon_СопоставленныеТовары.IDТовара КАК IDТовара,
	|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_Ozon_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.IDТовара КАК IDТовара,
	|	ВТ_Номенклатура.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.IDТовара КАК IDТовара,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.IDТовара,
	|	ВТ_Данные.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	УникальныйИдентификаторСклада,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
						
			Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";
			
			ЗаписьЖурналаРегистрации("Передача остатков OZON", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
			
			Возврат;
			
	КонецЕсли;
		
	КоличествоЗапросов = 0;	
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоСтрок               = 0;
		ОбщееКоличествоТоваров        = 0;  
		МассивСтрокНоменклатуры       = Новый Массив;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ОбщееКоличествоТоваров >= 8000 Тогда 
				
				ВремяОжидания = 60;
							
				КонДата = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < КонДата Цикл
					
				КонецЦикла;
				ОбщееКоличествоТоваров = 0;
				
			КонецЕсли;
			
			Если КоличествоСтрок >= 100 Тогда     
				
				Если КоличествоЗапросов = 50 Тогда
					
					КоличествоЗапросов = 0;
					
					ВремяОжидания = 5;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
				
				КонецЕсли;
				
				ОтветHTTP = рар_мп_Ozon_Методы.Метод_ОбновитьКоличествоТоваровНаСкладах(Выборка.Аккаунт, МассивСтрокНоменклатуры);
				КоличествоЗапросов = КоличествоЗапросов + 1;
				КоличествоСтрок = 0;
				МассивСтрокНоменклатуры.Очистить(); 
					
				Если ОтветHTTP.КодСостояния <> 200 Тогда
					
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
		
				КонецЕсли; 
				
			КонецЕсли;
			
			СтруктураПолученныхЗначение = Новый Структура("Артикул, КоличествоОстаток, ВНаличии, IDТовара, УникальныйИдентификаторСклада", ВыборкаДетальныеЗаписи.Артикул, 
															ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии, ВыборкаДетальныеЗаписи.IDТовара, 
																												ВыборкаДетальныеЗаписи.УникальныйИдентификаторСклада);

			
			КоличествоСтрок        = КоличествоСтрок + 1;
			ОбщееКоличествоТоваров = ОбщееКоличествоТоваров + 1;
			МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);
			
		КонецЦикла; 
		
		Если МассивСтрокНоменклатуры.Количество() > 0 Тогда
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			ОтветHTTP = рар_мп_Ozon_Методы.Метод_ОбновитьКоличествоТоваровНаСкладах(Выборка.Аккаунт, МассивСтрокНоменклатуры);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
				
			Если ОтветHTTP.КодСостояния <> 200 Тогда
				
				Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", ОтветHTTP.ОтветAPI.message, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
		
			КонецЕсли; 
							
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Wildberries

Процедура Wildberries_ОбновлениеОстатков() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_АккаунтыМаркетплейсов.Организация КАК Организация,
	|	рар_мп_АккаунтыМаркетплейсов.Ссылка КАК Аккаунт,
	|	ВЫБОР
	|		КОГДА рар_мп_АккаунтыМаркетплейсов.ИспользоватьМинимальныйОстатокТовара
	|			ТОГДА ЕСТЬNULL(рар_мп_АккаунтыМаркетплейсов.МинимальныйОстатокТовара, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	Справочник.рар_мп_АккаунтыМаркетплейсов КАК рар_мп_АккаунтыМаркетплейсов
	|ГДЕ
	|	рар_мп_АккаунтыМаркетплейсов.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.АктивныйАккаунт
	|	И рар_мп_АккаунтыМаркетплейсов.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Wildberries)
	|	И рар_мп_АккаунтыМаркетплейсов.Организация.ПометкаУдаления = ЛОЖЬ
	|	И рар_мп_АккаунтыМаркетплейсов.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
	|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Аккаунты.Организация КАК Организация,
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	ВТ_Аккаунты.МинимальныйОстаток КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_АккаунтыИСклады
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_СопоставленныеСклады.АккаунтМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт,
	|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка,
	|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|	рар_мп_Wildberries_СопоставленныеТовары.IDТовара КАК IDТовара,
	|	рар_мп_Wildberries_СопоставленныеТовары.Артикул КАК Артикул,
	|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
	|		ПО ВТ_Аккаунты.Аккаунт = рар_мп_Wildberries_СопоставленныеТовары.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АккаунтыИСклады.Аккаунт КАК Аккаунт,
	|	ВТ_АккаунтыИСклады.Организация КАК Организация,
	|	ВТ_АккаунтыИСклады.Склад КАК Склад,
	|	ВТ_АккаунтыИСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВТ_Номенклатура.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	ВТ_АккаунтыИСклады.МинимальныйОстаток КАК МинимальныйОстаток,
	|	ВТ_Номенклатура.IDТовара КАК IDТовара,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВТ_Номенклатура.Баракод КАК Баракод
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_АккаунтыИСклады КАК ВТ_АккаунтыИСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_АккаунтыИСклады.Аккаунт = ВТ_Номенклатура.Аккаунт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Аккаунт КАК Аккаунт,
	|	ВТ_Данные.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.Баракод КАК Баракод,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|							ТОГДА 0
	|						ИНАЧЕ ЦЕЛ(ТоварыОрганизацийОстатки.КоличествоОстаток / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) - ВТ_Данные.МинимальныйОстаток
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РаспределениеЗапасов.Состояние ЕСТЬ NULL
	|					ИЛИ РаспределениеЗапасов.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ_Данные.НоменклатураЕдиницаИзмерения <> ВТ_Данные.Упаковка
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток <= 0
	|									ТОГДА 0
	|								ИНАЧЕ ЦЕЛ(РаспределениеЗапасов.Свободно / ВТ_Данные.УпаковкаЧислитель - ВТ_Данные.МинимальныйОстаток)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток <= 0
	|								ТОГДА 0
	|							ИНАЧЕ ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) - ВТ_Данные.МинимальныйОстаток
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВНаличии
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ТекущаяДата, ) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_Данные.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТ_Данные.Склад = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения
	|			И ВТ_Данные.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_Данные.Характеристика = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Данные.Склад = РаспределениеЗапасов.Склад
	|			И ВТ_Данные.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Данные.Характеристика = РаспределениеЗапасов.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.УникальныйИдентификаторСклада,
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика,
	|	ВТ_Данные.Баракод,
	|	ВТ_Данные.Аккаунт
	|
	|УПОРЯДОЧИТЬ ПО
	|	УникальныйИдентификаторСклада,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ ПО
	|	Аккаунт,
	|	УникальныйИдентификаторСклада";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса()); 
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если РезультатЗапроса.Пустой() Тогда
			
		Комментарий = "Не удалось получить остатки. Возможно, не созданы аккаунты или не сопоставлены товары/склады";

		ЗаписьЖурналаРегистрации("Ошибка при формировании остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
			
		Возврат;			
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл     
		
		ВыборкаСклад = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаСклад.Следующий() Цикл 
			
			КоличествоСтрок               = 0;
			КоличествоЗапросов            = 0;  
			МассивСтрокНоменклатуры       = Новый Массив;
			
			ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
				
				Если КоличествоЗапросов = 300 Тогда
					
					ВремяОжидания = 60;
							
					КонДата = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < КонДата Цикл
						
					КонецЦикла;
					
					КоличествоЗапросов = 0; 
					
				КонецЕсли;
				
				Если КоличествоСтрок >= 1000 Тогда 
					
					ОтветHTTP = рар_мп_Wildberries_Методы.Метод_ОбновитьОстаткиТоваров(Выборка.Аккаунт, ВыборкаСклад.УникальныйИдентификаторСклада, МассивСтрокНоменклатуры); 
					
					МассивСтрокНоменклатуры.Очистить();
						
					КоличествоСтрок = 0; 
					
					КоличествоЗапросов = КоличествоЗапросов + 1;
					
					Если ОтветHTTP.КодСостояния <> 204 Тогда 
						
						Если ОтветHTTP.Свойство("ОтветAPI") Тогда
							
							Если ОтветHTTP.КодСостояния = 401 или ОтветHTTP.КодСостояния = 429 Тогда 
								
								Ошибка = ОтветHTTP.ОтветAPI.statusText; 
								
							ИначеЕсли ОтветHTTP.КодСостояния = 409 Тогда
								
								Ошибка = ОтветHTTP.ОтветAPI.Получить(0).message;
								
							Иначе     
								
								Ошибка = ОтветHTTP.ОтветAPI.message;
								
							КонецЕсли;
						
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

							Возврат;
							
						Иначе    
						
							Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
							Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
							ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

							Возврат;	
							
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;  
				
			    СтруктураПолученныхЗначение = Новый Структура("Баракод, КоличествоОстаток, ВНаличии", ВыборкаДетальныеЗаписи.Баракод, 
											ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.ВНаличии);	
					
			    КоличествоСтрок = КоличествоСтрок + 1;
				МассивСтрокНоменклатуры.Добавить(СтруктураПолученныхЗначение);   

			КонецЦикла; 
			
			Если МассивСтрокНоменклатуры.Количество() > 0 Тогда 
				
				ОтветHTTP = рар_мп_Wildberries_Методы.Метод_ОбновитьОстаткиТоваров(Выборка.Аккаунт, ВыборкаСклад.УникальныйИдентификаторСклада, МассивСтрокНоменклатуры);
					
				МассивСтрокНоменклатуры.Очистить();
						
				КоличествоСтрок = 0;
				
				Если ОтветHTTP.КодСостояния <> 204 Тогда 
					
					Если ОтветHTTP.Свойство("ОтветAPI") Тогда
						
						Если ОтветHTTP.КодСостояния = 401 или ОтветHTTP.КодСостояния = 429 Тогда 
							
							Ошибка = ОтветHTTP.ОтветAPI.statusText; 
							
						ИначеЕсли ОтветHTTP.КодСостояния = 409 Тогда
							
							Ошибка = ОтветHTTP.ОтветAPI.Получить(0).message;
							
						Иначе     
							
							Ошибка = ОтветHTTP.ОтветAPI.message;
							
						КонецЕсли;
					
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);

						Возврат;
						
					Иначе    
					
						Ошибка = "Ошибка при получении JSON. Некорректные значения JSON";
						Комментарий = СтрШаблон("Аккаунт: %2. Код ошибки: %3. Описание ошибки: %1", Ошибка, Выборка.Аккаунт, ОтветHTTP.КодСостояния);
						ЗаписьЖурналаРегистрации("Ошибка при передаче остатков Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);  

						Возврат;	
						
					КонецЕсли;
						
				КонецЕсли;
						
			КонецЕсли;  
			
		КонецЦикла; 
	КонецЦикла;
		
КонецПроцедуры      

#КонецОбласти          

