#Область СлужебныйПрограммныйИнтерфейс

// Получает значение константы
//
// Возвращаемое значение:
// Булево
//
Функция Рар_МП_ПолучитьСогласие() Экспорт  
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.рар_мп_Согласие.Получить(); 
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

// Устанавливает значение константы в Истина
// Получает значение константы
//
// Возвращаемое значение:
// Булево
//
Процедура Рар_МП_УстановитьСогласие() Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Константы.рар_мп_Согласие.Установить(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Проверяет назначение роли
// Параметры:
//  Роль - Строка 
// Возвращаемое значение:
//  РольДоступна - Булевое
//
Функция Рар_МП_ЕстьРоль(Знач Роль) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат РольДоступна(Роль);              
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

Функция Рар_МП_ВерсияРасширения() Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	ИнформацияОРасширение = РасширенияКонфигурации.Получить(Новый Структура("Имя", "Маркетпейсы_1С_Рарус")); 
	Для Каждого ЭлМассива из ИнформацияОРасширение Цикл
		ВерсияРасширения = ЭлМассива.Версия;	
	КонецЦикла;
	Возврат ВерсияРасширения;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции  

Функция Рар_МП_ПолучитьСтаруюВерсиюРасширения() Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.рар_мп_ВерсияРасширения.Получить(); 
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

Процедура Рар_МП_УстановитьНовуюВерсиюРасширения(НоваяВерсия) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Константы.рар_мп_ВерсияРасширения.Установить(НоваяВерсия);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
#КонецОбласти

