Функция ЗаказКлиентаВРаботеУПользователя(ПользовательТСД, ЗаказКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка
		|	И ЗаказКлиента.рар_мп_ПользовательТСД = &ПользовательТСД
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД = ЗНАЧЕНИЕ(Перечисление.рар_мп_СтатусыДокументовВТСД.ВРаботе)";
	
	Запрос.УстановитьПараметр("ПользовательТСД", ПользовательТСД);
	Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции 

Функция РеестрЗаказовВРаботеУПользователя(ПользовательТСД, РеестрЗаказов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_РеестрЗаказов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.рар_мп_РеестрЗаказов КАК рар_мп_РеестрЗаказов
		|ГДЕ
		|	рар_мп_РеестрЗаказов.Ссылка = &Ссылка
		|	И рар_мп_РеестрЗаказов.рар_мп_ПользовательТСД = &ПользовательТСД
		|	И рар_мп_РеестрЗаказов.рар_мп_СтатусДокументаВТСД = ЗНАЧЕНИЕ(Перечисление.рар_мп_СтатусыДокументовВТСД.ВРаботе)";
	
	Запрос.УстановитьПараметр("ПользовательТСД", ПользовательТСД);
	Запрос.УстановитьПараметр("Ссылка", РеестрЗаказов.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
