
//@skip-check module-structure-method-in-regions
&НаСервере
Процедура рар_мп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НомерПоДаннымКлиента = Элементы.Добавить("НомерПоДаннымКлиента", Тип("ПолеФормы"), Элементы.Список);
	НомерПоДаннымКлиента.Вид = ВидПоляФормы.ПолеВвода;
	НомерПоДаннымКлиента.ПутьКДанным = "Список.НомерПоДаннымКлиента";
	НомерПоДаннымКлиента.Заголовок = "Номер заказа из маркетплейса";
	НомерПоДаннымКлиента.ТолькоПросмотр = Истина;
	
	//@skip-check form-self-reference
	ЭтаФорма.Элементы.Переместить(НомерПоДаннымКлиента, Элементы.Список, Элементы.Список.ПодчиненныеЭлементы.СписокДата); 
	
		
КонецПроцедуры
