// Добавляем массив номенклатуры в регистр сведений НоменклатураЗагруженнаяНаТСД
//
// Параметры:
//  Узел  - ПланОбмена.ОбменДаннымиМобильноеПриложение - Узел для которого добавляется номенклатура
//  МассивНоменклатуры  - Массив - Массив Справочник.Номенклатура
//                
Процедура ДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД(Узел,МассивНоменклатуры) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого Номенклатура из МассивНоменклатуры Цикл
		РегистрыСведений.НоменклатураЗагруженнаяНаТСД.ДобавитьНоменклатуру(Узел,Номенклатура);
	КонецЦикла;	
    УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры// ДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД() 

Процедура ВыполнитьДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД_В_ФоновомЗадании(МассивНоменклатуры) Экспорт
	
	МассивПараметров=Новый Массив;
	МассивПараметров.Добавить(ПараметрыСеанса.ТекущийУзелТСД);
	МассивПараметров.Добавить(МассивНоменклатуры);
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияСервер.ДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД",МассивПараметров,Строка(Новый УникальныйИдентификатор));
	
КонецПроцедуры
