Процедура ПолучитьДанныеДокументаПересчетТоваров(Документ, Результат) Экспорт
	ЕстьЯчейки = Ложь;
	ЕстьСерии = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПересчетТоваровТовары.Ячейка КАК Ячейка,
	|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
	|	ПересчетТоваровТовары.Серия КАК Серия,
	|	ПересчетТоваровТовары.КоличествоУпаковок КАК Количество,
	|	ПересчетТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры, 
	|	ПересчетТоваровТовары.Упаковка КАК Упаковка
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	
	РезультатЗапроса.Колонки.Добавить("ШтрихкодЯчейки", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НоменклатураСДанными");
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		Если ЗначениеЗаполнено(Строка.Ячейка) Тогда
			Строка.ШтрихкодЯчейки = РаботаСШтрихкодами.ПолучитьШК(Строка.Ячейка);
			ЕстьЯчейки = Истина;
		Иначе
			Строка.ШтрихкодЯчейки = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Серия) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.Серия);
			ЕстьСерии = Истина;
		Иначе
			Строка.ШтрихкодСерии = "";
		КонецЕсли;
		Строка.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Строка.Номенклатура);
		Если Не ЗначениеЗаполнено(Строка.Упаковка) Тогда
			Строка.Упаковка = Строка.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("Номер", Документ.Номер);
	Результат.Вставить("Дата", Документ.Дата);
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));				
	Результат.Вставить("ЕстьЯчейки", ЕстьЯчейки);
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("ГУИД", Документ.УникальныйИдентификатор()); 
	Результат.Вставить("Склад", Документ.Склад.Наименование); 
	Результат.Вставить("Ответственный", Документ.Ответственный.Наименование);
КонецПроцедуры

Функция ЗаписатьПересчетТоваров(ДокументИзМП) Экспорт
	Документ = Документы.ПересчетТоваров.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ТЧДокументаБазы = Документ.Товары;
	ТЧДокументаМП = ДокументИзМП.Товары; 
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоФакт = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковокФакт = Строка.КоличествоФакт;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоФакт = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковокФакт = Строка.КоличествоФакт;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Ячейка) Тогда
				НоваяСтрокаТЧ.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(ТЧДокументаМП[Сч].Ячейка);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Упаковка) Тогда
				НоваяСтрокаТЧ.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(ТЧДокументаМП[Сч].Упаковка);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Характеристика) Тогда
				НоваяСтрокаТЧ.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
			КонецЕсли;				
			НоваяСтрокаТЧ.КоличествоФакт = ТЧДокументаМП[Сч].КоличествоФакт; 
			НоваяСтрокаТЧ.КоличествоУпаковокФакт = ТЧДокументаМП[Сч].КоличествоФакт;
		КонецЦикла;
	КонецЕсли;
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ;
КонецФункции

Функция ЗаписатьЗаказКлиента(ДокументИзМП) Экспорт
	Документ = Документы.ЗаказКлиента.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	
	ТЧДокументаБазы = Документ.рар_мп_ТоварыДляМаркировки;
	ТЧДокументаМП = ДокументИзМП.ТоварыДляМаркировки; 
	РеквизитЧестногоЗнача = "рар_мп_ЧестныйЗнак";
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = 
				Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Строка.ЧестныйЗнак);
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = Строка.ЧестныйЗнак;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			НоваяСтрокаТЧ[РеквизитЧестногоЗнача] = ТЧДокументаМП[Сч].ЧестныйЗнак;
			НоваяСтрокаТЧ.рар_мп_Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
		КонецЦикла;
	КонецЕсли;
	
	Документ.ДополнительныеСвойства.Вставить("ЗвершениеДокументаИзТСД", Истина); 
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция ЗаписатьРеестрЗаказов(ДокументИзМП) Экспорт
	Документ = Документы.рар_мп_РеестрЗаказов.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(ДокументИзМП.ГУИДПользователя);
	
	ТЧДокументаБазы = Документ.рар_мп_МаркируемыеТовары;
	ТЧДокументаМП = ДокументИзМП.ТоварыИзЗаказов;
	РеквизитЧестногоЗнача = "рар_мп_ЧестныйЗнак";

	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = 
				Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Строка.ЧестныйЗнак);
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = Строка.ЧестныйЗнак;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.рар_мп_Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			НоваяСтрокаТЧ[РеквизитЧестногоЗнача] = ТЧДокументаМП[Сч].ЧестныйЗнак;
			НоваяСтрокаТЧ.рар_мп_Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
		КонецЦикла;
	КонецЕсли;
	
	Документ.ДополнительныеСвойства.Вставить("ЗвершениеДокументаИзТСД", Истина); 

	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	ЗавершитьСвязанныеСРеестромЗаказыКлиента(Документ.Ссылка, ПользовательТСД);
КонецФункции

Процедура ЗавершитьСвязанныеСРеестромЗаказыКлиента(РеестрЗаказаСсылка, ПользовательТСД)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса.рар_мп_Заказ КАК ЗаказКлиента
		|ИЗ
		|	Документ.рар_мп_РеестрЗаказов.рар_мп_ЗаказыИзМаркетплейса КАК рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса
		|ГДЕ
		|	рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РеестрЗаказаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаказКлиентаОбъект = Выборка.ЗаказКлиента.ПолучитьОбъект();
		ЗаказКлиентаОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
		ЗаказКлиентаОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		
		ЗаказКлиентаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	
КонецПроцедуры

Функция СоздатьПриобретениеТоваровИУслуг(Данные) Экспорт
	
	НовыйДок = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	ЗаказСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Данные.ЗаказПоставщику);
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.Организация = Справочники.Организации.ПолучитьСсылку(Данные.Организация);
	НовыйДок.УстановитьНовыйНомер();	
	
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.Склад));	
	
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда 
		НовыйДок.Заполнить(ЗаказСсылка);
		
		Для Каждого Строка Из Данные.Товары Цикл
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			Отбор = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
			МассивСтрок = НовыйДок.Товары.НайтиСтроки(Отбор);
			Если МассивСтрок.Количество() = 0 Тогда 
				Продолжить;  
			ИначеЕсли Строка.КоличествоФакт <= 0 Тогда
				НовыйДок.Товары.Удалить(МассивСтрок[0]);
				Продолжить;
			КонецЕсли;			
			ИзменяемаяСтрока = МассивСтрок[0];
			ИзменяемаяСтрока.Количество = Строка.КоличествоФакт;
			ИзменяемаяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			ИзменяемаяСтрока.ЗаказПоставщику = ЗаказСсылка;
			ИзменяемаяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
			
			СтрокаЗаказа = ЗаказСсылка.Товары.НайтиСтроки(Отбор)[0];
			ИзменяемаяСтрока.КодСтроки = СтрокаЗаказа.КодСтроки;
			
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, НовыйДок);	
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(ИзменяемаяСтрока, СтруктураДействий, Неопределено);
		КонецЦикла;
	Иначе
		НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
		
		НовыйДок.Менеджер = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
		
		Для Каждого Строка Из Данные.Товары Цикл 
			НоваяСтрока = НовыйДок.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			НоваяСтрока.Количество = Строка.КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЦикла;
	КонецЕсли;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьРеализациюТоваровИУслуг(Данные) Экспорт
	
	НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	
	ЗаказСсылка = Документы.ЗаказКлиента.ПолучитьСсылку(Данные.ЗаказКлиента);
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда 
		НовыйДок.Заполнить(ЗаказСсылка);
		Для Каждого Строка Из Данные.Товары Цикл 
			Если Строка.КоличествоФакт > 0 Тогда 
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);				
				НоваяСтрока = НовыйДок.Товары.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.Характеристика = Характеристика;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
				НоваяСтрока.Склад = Склад;
				НоваяСтрока.ЗаказКлиента = ЗаказСсылка;
				НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
				
				Отбор = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
				МассивСтрок = ЗаказСсылка.Товары.НайтиСтроки(Отбор);
				Если МассивСтрок.Количество() > 0 Тогда 
					НоваяСтрока.Цена = МассивСтрок[0].Цена;
					НоваяСтрока.СтавкаНДС = МассивСтрок[0].СтавкаНДС;
					НоваяСтрока.ВидЦены = МассивСтрок[0].ВидЦены;
					НоваяСтрока.КодСтроки = МассивСтрок[0].КодСтроки;
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, НовыйДок);	
					ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
	Иначе 
		Для Каждого Строка Из Данные.Товары Цикл 
			НоваяСтрока = НовыйДок.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			НоваяСтрока.Количество = Строка.КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЦикла;	
	КонецЕсли;	
	
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.Организация = Справочники.Организации.ПолучитьСсылку(Данные.Организация);
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДок.Склад = Склад;
	
	НовыйДок.Менеджер = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьПриходныйОрдер(Данные) Экспорт
	
	НовыйДок = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
	НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	НовыйДок.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;		
	НовыйДок.Распоряжение = ПолучитьСсылкуДокумента(Данные.Распоряжение);	
	ОтветственныйИсполнитель = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	НовыйДок.Ответственный = ОтветственныйИсполнитель;
	НовыйДок.Исполнитель = ОтветственныйИсполнитель;
	
	Для Каждого Строка Из Данные.Товары Цикл 
		НоваяСтрока = НовыйДок.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;   
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
	КонецЦикла;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьРасходныйОрдер(Данные) Экспорт
	
	НовыйДок = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.ДатаОтгрузки = ТекущаяДатаСеанса();
	НовыйДок.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	НовыйДок.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
	//НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	НовыйДок.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
	Распоряжение = ПолучитьСсылкуДокумента(Данные.Распоряжение);
	НовыйДок.Получатель = Распоряжение.Партнер;
	ОтветственныйИсполнитель = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	НовыйДок.Ответственный = ОтветственныйИсполнитель;
	НовыйДок.Контролер = ОтветственныйИсполнитель;
	
	Для Каждого Строка Из Данные.Товары Цикл 
		НоваяСтрока = НовыйДок.ОтгружаемыеТовары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
        НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
		НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		
		НоваяСтрока = НовыйДок.ТоварыПоРаспоряжениям.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.Распоряжение = Распоряжение;
	КонецЦикла;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции
 
Функция СоздатьПеремещениеТоваров(Данные, Пользователь) Экспорт
	НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.Организация = Данные.Организация;
	НовыйДокумент.УстановитьНовыйНомер();
	
	НовыйДокумент.СкладОтправитель = Данные.СкладОтправитель;
	НовыйДокумент.СкладПолучатель = Данные.СкладПолучатель;
	НовыйДокумент.ЗаказНаПеремещение = Данные.ЗаказНаПеремещение;
	НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокумент.ПеремещениеПоЗаказам = Истина;
	НовыйДокумент.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров;
	НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	
	Для Каждого Строка Из Данные.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Упаковка = Строка.Упаковка;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		НоваяСтрока.ЗаказНаПеремещение = Данные.ЗаказНаПеремещение; 
	КонецЦикла;
	
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции

Функция СоздатьПеремещениеТоваровНаОсновеЗаказаНаПеремещения(ГУИДПользователя, Документ, Результат) Экспорт
	Пользователь = Справочники.Пользователи.ПолучитьСсылку(ГУИДПользователя);
	ДанныеДокумента = Новый Структура("Организация, СкладОтправитель, СкладПолучатель, ЗаказНаПеремещение, Товары", Документ.Организация, Документ.СкладОтправитель, Документ.СкладПолучатель, Документ.Ссылка, Документ.Товары); 
	НовыйДокументПеремещенияТоваров = РаботаСДокументами.СоздатьПеремещениеТоваров(ДанныеДокумента, Пользователь); 
	РаботаСДокументами.ПолучитьДанныеДокументаПеремещениеТоваров(НовыйДокументПеремещенияТоваров, Результат);
	Результат.Вставить("Организация", ДанныеДокумента.Организация.УникальныйИдентификатор());
	Результат.Вставить("СкладОтправитель", ДанныеДокумента.СкладОтправитель.УникальныйИдентификатор());
	Результат.Вставить("СкладПолучатель", ДанныеДокумента.СкладПолучатель.УникальныйИдентификатор());
	Результат.Вставить("ЗаказНаПеремещение", ДанныеДокумента.ЗаказНаПеремещение.УникальныйИдентификатор());
КонецФункции

Процедура ПолучитьДанныеДокументаПеремещениеТоваров(Документ, Результат) Экспорт
	ЕстьСерии = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ПеремещениеТоваровТовары.Серия КАК Серия,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК Количество,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры, 
	|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НоменклатураСДанными");
	Для Каждого Строка Из РезультатЗапроса Цикл
		Если ЗначениеЗаполнено(Строка.Серия) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.Серия);
			ЕстьСерии = Истина;
		Иначе
			Строка.ШтрихкодСерии = "";
		КонецЕсли;   
		Строка.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Строка.Номенклатура);
		Если Не ЗначениеЗаполнено(Строка.Упаковка) Тогда
			Строка.Упаковка = Строка.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла; 
		
	Результат.Вставить("Номер", Документ.Номер);
	Результат.Вставить("Дата", Документ.Дата);
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));			
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("ГУИД", Документ.УникальныйИдентификатор());
	Результат.Вставить("Организация", Документ.Организация.УникальныйИдентификатор());
	Результат.Вставить("СкладОтправитель", Документ.СкладОтправитель.УникальныйИдентификатор());
	Результат.Вставить("СкладПолучатель", Документ.СкладПолучатель.УникальныйИдентификатор());
	Результат.Вставить("ЗаказНаПеремещение", Неопределено);
КонецПроцедуры

Функция ЗаписатьПеремещениеТоваров(ДокументИзМП) Экспорт
	Документ = Документы.ПеремещениеТоваров.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ТЧДокументаБазы = Документ.Товары;
	ТЧДокументаМП = ДокументИзМП.Товары; 
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда  
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].Количество = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковок = Строка.КоличествоФакт;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].Количество = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковок = Строка.КоличествоФакт;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрока = Документ.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Упаковка) Тогда
				НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(ТЧДокументаМП[Сч].Упаковка);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Характеристика) Тогда
				НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
			КонецЕсли;
			
			НоваяСтрока.Количество = ТЧДокументаМП[Сч].КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = ТЧДокументаМП[Сч].КоличествоФакт;			
		КонецЦикла;
	КонецЕсли;
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ;
	
КонецФункции 

Функция ЗаписатьПеремещениеТоваровСозданноговМП(ДокументИзМП, Пользователь) Экспорт
	НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокумент.УстановитьНовыйНомер("ТСД");
	НовыйДокумент.Организация = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Организация);
	НовыйДокумент.СкладОтправитель = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.СкладОтправитель);
	НовыйДокумент.СкладПолучатель = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.СкладПолучатель);
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокумент.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	
	ТЧДокумента = ДокументИзМП.Товары;
	Для Каждого Строка Из ДокументИзМП.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		//НоваяСтрока.Серия = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Серия);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
	КонецЦикла;
	
	//НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция ЗаписатьРазмещениеТоваровСозданноговМП(ДокументИзМП, Пользователь) Экспорт
	НовыйДокумент = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение;
	НовыйДокумент.УстановитьНовыйНомер();
	НовыйДокумент.Склад = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.Склад);
	НовыйДокумент.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(ДокументИзМП.Помещение);
	НовыйДокумент.ЗонаПриемки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(ДокументИзМП.ЗонаПриемки);
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
	
	ТЧДокумента = ДокументИзМП.Товары;
	Для Каждого Строка Из ДокументИзМП.Товары Цикл
		НоваяСтрока = НовыйДокумент.ТоварыРазмещение.Добавить();
		НоваяСтрока.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Строка.Ячейка);
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Упаковка) Тогда	
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЕсли;
		//НоваяСтрока.Серия = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Серия);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
	КонецЦикла;
	
	//НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция НайтиДокументыПоНомеру(Номер, ВидДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	Представление(ЗаказКлиента.Склад) КАК Склад
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Номер = &Номер
	|%Условие";
	
	Запрос.УстановитьПараметр("Номер", Номер);

	Если ВидДокумента = "ПересчетТоваров" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "И ЗаказКлиента.Статус = Значение(Перечисление.СтатусыПересчетовТоваров.ВРаботе)");
	ИначеЕсли ВидДокумента = "ПеремещениеТоваров" ИЛИ ВидДокумента = "ЗаказНаПеремещение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Представление(ЗаказКлиента.Склад) КАК Склад", "Представление(ЗаказКлиента.СкладОтправитель) КАК СкладОтправитель, Представление(ЗаказКлиента.СкладПолучатель) КАК СкладПолучатель");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", ВидДокумента);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("ГУИД");
	Для Каждого Стр Из РезультатЗапроса Цикл 
		Стр.ГУИД = Строка(Стр.Ссылка.УникальныйИдентификатор());	
	КонецЦикла;
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса;
	КонецЕсли;	
	
КонецФункции 

Функция ПолучитьДанныеДокументаОснованияПриемкиОтгрузки(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры,
	|	ЗаказКлиентаТовары.Упаковка КАК ЕдиницаИзмерения,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", Ссылка.Метаданные().Имя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТЧТовары = Запрос.Выполнить().Выгрузить();
	
	ТЧТовары.Колонки.Добавить("НоменклатураСДанными");

	Для Каждого Стр Из ТЧТовары Цикл 
		Стр.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Стр.Номенклатура);
		Если Не ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Стр.ЕдиницаИзмерения = Стр.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла;  
		
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Номер", Ссылка.Номер);
	ДанныеДокумента.Вставить("Дата", Ссылка.Дата);
	ДанныеДокумента.Вставить("ГУИД", Ссылка.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Организация", Ссылка.Организация.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Склад", Ссылка.Склад.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Партнер", Строка(Ссылка.Партнер));
	ДанныеДокумента.Вставить("Контрагент", Строка(Ссылка.Контрагент));
	ДанныеДокумента.Вставить("Товары", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЧТовары));	
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПолучитьМассивВозможныхДокументовПриемки(ДокументОснование) Экспорт
		
	МассивТиповДокументов = Новый Массив;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		Если Константы.ИспользоватьСтатусыЗаказовПоставщикам.Получить() 
			И НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;			
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
			
			Если ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным
				ИЛИ ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных Тогда 
				МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");
				МассивТиповДокументов.Добавить("ПриходныйОрдерНаТовары");
			Иначе 
				МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");
			КонецЕсли;
		Иначе 
			МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			Если НЕ ЗначениеЗаполнено(ДокументОснование.ЗаказПоставщику) Тогда 
				МассивТиповДокументов.Добавить("ПриходныйОрдерНаТовары");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат МассивТиповДокументов;
	
КонецФункции // ПолучитьМассивВозможныхДокументовПриемки()

Функция ПолучитьСсылкуДокумента(ГУИД)
	
	Ссылка = Документы.ЗаказПоставщику.ПолучитьСсылку(ГУИД);		
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;	
	
	Возврат Ссылка;
	
КонецФункции // ПолучитьСсылкуДокумента()

Функция РаботаСДокументомРазмещения(Параметры)Экспорт
КонецФункции

Функция ПолучитьМассивВозможныхДокументовОтгрузки(ДокументОснование) Экспорт
	
	МассивТиповДокументов = Новый Массив;		
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		Если НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке И 
			НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;
		Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
		ПодходящиеДокументы = ДокументОснование.Товары.Найти(Отгрузить, "ВариантОбеспечения");
		Если ПодходящиеДокументы = Неопределено Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;
		
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда			 
				МассивТиповДокументов.Добавить("РеализацияТоваровУслуг");
				МассивТиповДокументов.Добавить("РасходныйОрдерНаТовары");			
		Иначе 
			МассивТиповДокументов.Добавить("РеализацияТоваровУслуг");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			Если НЕ ЗначениеЗаполнено(ДокументОснование.ЗаказКлиента) Тогда 
				МассивТиповДокументов.Добавить("РасходныйОрдерНаТовары");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	Возврат МассивТиповДокументов;	
	
КонецФункции

Функция ВзятьВРаботуЗаказКлиента(Параметры) Экспорт 
	Результат = Новый Структура("Успешно, Сообщение", Истина, "");
	Документ = Документы.ЗаказКлиента.ПолучитьСсылку(Параметры.ГУИДЗаказаКлиента); 
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	Если Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе;
		ДокументОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВзятиеДокументаВРаботуИзТСД", Истина);
		ДокументОбъект.Записать();
	Иначе
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Документ уже в работе!";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции 

Функция ВзятьВРаботуРеестрЗаказов(Параметры) Экспорт 
	Результат = Новый Структура("Успешно, Сообщение", Истина, "");
	Документ = Документы.рар_мп_РеестрЗаказов.ПолучитьСсылку(Параметры.ГУИДРеестраЗаказов); 
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	Если Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе;
		ДокументОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВзятиеДокументаВРаботуИзТСД", Истина);
		ДокументОбъект.Записать();
	Иначе
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Документ уже в работе!";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ЗарегистрироватьКОбменуПриОчисткеСтатуса(ДокументОбъект) Экспорт
	Если ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ПустаяСсылка() Тогда
		Если СтатусДокументаВТСДБылДругим(ДокументОбъект.Ссылка, ДокументОбъект.рар_мп_СтатусДокументаВТСД) Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ЗарегистрироватьДокументКОбменуНаТСД", Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Функция СтатусДокументаВТСДБылДругим(ДокументСсылка, СтатусДокументаВТСД)
	
	НаименованиеДокумента = ДокументСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД <> &рар_мп_СтатусДокументаВТСД
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД <> &СтатусЗавершен";
	
	Запрос.УстановитьПараметр("рар_мп_СтатусДокументаВТСД", СтатусДокументаВТСД);
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЗаказКлиента", "Документ." + НаименованиеДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;

КонецФункции

