//@skip-check module-structure-top-region
#Область ПрочиеПроцедурыФункции

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.рар_мп_ДатаОтгрузки        = ТекущаяДатаСеанса();
		Объект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый;
		
	Иначе
		
		АккаунтМаркетплейсаПриИзмененииНаСервере();	
		
	КонецЕсли;
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_КоробкиВыборСтрокиПриИзменении(Элемент)
	
	Если Элементы.рар_мп_Коробки.ТекущиеДанные <> Неопределено Тогда
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НовоеЗначение = Объект.рар_мп_Коробки[Элементы.рар_мп_Коробки.ТекущиеДанные.НомерСтроки-1].ВыборСтроки;
		
		Для Каждого Стр из Объект.рар_мп_Коробки Цикл
			
			Стр.ВыборСтроки = Ложь;    
			
		КонецЦикла;
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Объект.рар_мп_Коробки[Элементы.рар_мп_Коробки.ТекущиеДанные.НомерСтроки-1].ВыборСтроки = НовоеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры 

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_ТоварыИзЗаказовВыборСтрокиПриИзменении(Элемент)
	
	Если Элементы.рар_мп_ТоварыИзЗаказов.ТекущиеДанные <> Неопределено Тогда
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НомерСтроки = Элементы.рар_мп_ТоварыИзЗаказов.ТекущиеДанные.НомерСтроки;
		
		ВыбраннаяСтрока = Объект.рар_мп_ТоварыИзЗаказов[НомерСтроки-1];
		
		Если ВыбраннаяСтрока.ВыборСтроки Тогда
			
			НужныеСтроки = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа, рар_мп_СтрокаИзТЧТовары, рар_мп_Артикул", 
			ВыбраннаяСтрока.рар_мп_НомерЗаказа, 
			ВыбраннаяСтрока.рар_мп_СтрокаИзТЧТовары, 
			ВыбраннаяСтрока.рар_мп_Артикул));
			
			Для каждого Строка Из НужныеСтроки Цикл
				
				Строка.ВыборСтроки = ВыбраннаяСтрока.ВыборСтроки; 			
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_РаспределенныеТоварыВыборСтрокиПриИзменении(Элемент)
	
	Если Элементы.рар_мп_РаспределенныеТовары.ТекущиеДанные <> Неопределено Тогда
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НомерСтроки = Элементы.рар_мп_РаспределенныеТовары.ТекущиеДанные.НомерСтроки;
		
		ВыбраннаяСтрока = Объект.рар_мп_РаспределенныеТовары[НомерСтроки-1];
		
		НужныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа, рар_мп_СтрокаИзТЧТовары, рар_мп_Артикул", 
		ВыбраннаяСтрока.рар_мп_НомерЗаказа, 
		ВыбраннаяСтрока.рар_мп_СтрокаИзТЧТовары, 
		ВыбраннаяСтрока.рар_мп_Артикул));
		
		Для каждого Строка Из НужныеСтроки Цикл
			
			Строка.ВыборСтроки = ВыбраннаяСтрока.ВыборСтроки; 			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗаказыИзМаркетплейсаПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗаказыИзМаркетплейсаСкачатьЭтикетку" Тогда
		
		Если ПроверитьЗаполнение() Тогда
			
			Если Элементы.ЗаказыИзМаркетплейса.ТекущиеДанные <> Неопределено Тогда
				
				НомерЗаказа = Элементы.ЗаказыИзМаркетплейса.ТекущиеДанные.рар_мп_НомерЗаказа;
				
				ЗаказыИзМаркетплейсаСкачатьЭтикетку(НомерЗаказа);	
				
			КонецЕсли;	
			
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ЗаказыИзМаркетплейсаПечатьЭтикетки" Тогда
		
		Если ПроверитьЗаполнение() Тогда
			
			ЗаказыИзМаркетплейсаПечатьЭтикетки();
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкиНаЗаказы()
	
	ВыгруженныеСтроки = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_Заказ");
	СсылкиНаДокументы = ВыгруженныеСтроки.ВыгрузитьКолонку("рар_мп_Заказ");
	
	Возврат СсылкиНаДокументы;
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗаказКлиентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкиНаДокументы = ПолучитьСсылкиНаЗаказы();	
	
	ЗначениеОтбора = Новый Структура("Ссылка", СсылкиНаДокументы);
	
	ПараметрыВыбораЗаказов = Новый Структура("Отбор, МножественныйВыбор", ЗначениеОтбора, Истина);
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора",ПараметрыВыбораЗаказов, Элемент);
КонецПроцедуры

&НаСервере
Функция АккаунтИзWildberries()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Возврат Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries;	
	
КонецФункции

&НаСервере
Функция АккаунтИзЯндексМаркет()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Возврат Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет;	
	
КонецФункции

&НаСервере
Функция АккаунтИзOzon()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Возврат Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON;	
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Строка Из Объект.рар_мп_ЗаказыИзМаркетплейса Цикл
		
		Заказ = Строка.рар_мп_Заказ;
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
		
		НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "НомерПоДаннымКлиента");
		
		ОбъектЗаказ = Заказ.ПолучитьОбъект();
		
		ОбъектЗаказ.рар_мп_ТоварыДляМаркировки.Очистить();
		
		НомерЗаказа = Строка.рар_мп_НомерЗаказа;
		
		НайденныеСтроки = Объект.рар_мп_МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		Для каждого СтрокаТч Из НайденныеСтроки Цикл
			
			НоваяСтрока = ОбъектЗаказ.рар_мп_ТоварыДляМаркировки.Добавить();
			
			НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = СтрокаТч.рар_мп_СтрокаИзТЧТовары;
			НоваяСтрока.рар_мп_Номенклатура         = СтрокаТч.рар_мп_Номенклатура;
			НоваяСтрока.рар_мп_Характеристика       = СтрокаТч.рар_мп_Характеристика;
			НоваяСтрока.рар_мп_IDТовара             = СтрокаТч.рар_мп_IDТовара; 
			НоваяСтрока.рар_мп_ЗаполнениеМаркировки = СтрокаТч.рар_мп_ЗаполнениеМаркировки;
			НоваяСтрока.рар_мп_Exemplar_Id          = СтрокаТч.рар_мп_Exemplar_Id;
			НоваяСтрока.рар_мп_ЧестныйЗнак          = СтрокаТч.рар_мп_ЧестныйЗнак;
			НоваяСтрока.рар_мп_ЗаполнениеГТД		= СтрокаТч.рар_мп_ЗаполнениеГТД;
			НоваяСтрока.рар_мп_НомерГТД				= СтрокаТч.рар_мп_НомерГТД;
			
		КонецЦикла;
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
			
			ОбъектЗаказ.рар_мп_Ozon_СтатусЗаказа 	= Строка.рар_мп_СтатусЗаказа;
			ОбъектЗаказ.рар_мп_Ozon_ПодстатусЗаказа = Строка.рар_мп_СтатусОбработкиЗаказа;	
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			ОбъектЗаказ.рар_мп_Wildberries_СтатусЗаказа 		 = Строка.рар_мп_СтатусЗаказа;
			ОбъектЗаказ.рар_мп_Wildberries_СтатусОбработкиЗаказа = Строка.рар_мп_СтатусОбработкиЗаказа;
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			
			ОбъектЗаказ.рар_мп_ЯндексМаркет_СтатусЗаказа 	= Строка.рар_мп_СтатусЗаказа;
			ОбъектЗаказ.рар_мп_ЯндексМаркет_ПодстатусЗаказа = Строка.рар_мп_СтатусОбработкиЗаказа;
			
		КонецЕсли;
		
		Попытка
			
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);		
			
		Исключение
			
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при проведении документа заказ клиента %1. Полное описание ошибки в журнале регистрации", НомерЗаказа);
			Сообщение.Сообщить(); 
			
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при проведении документа заказ клиента %1", НомерЗаказа), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
			
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

//@skip-check module-unused-method
&НаСервере
Функция ПолучитьМестоХраненияФайлов()
	
	Возврат Константы.рар_мп_МестоХраненияФайлов.Получить();
	
КонецФункции 

#КонецОбласти

//@skip-check module-structure-top-region
#Область ЗагрузкаЗаказовКлиентов

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗагрузитьЗаказы(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Объект.рар_мп_ЗаказыИзМаркетплейса.Очистить();
		Объект.рар_мп_ПередачаНаКомиссию.Очистить();
		Объект.рар_мп_ТоварыИзЗаказов.Очистить();
		Объект.рар_мп_Коробки.Очистить();
		Объект.рар_мп_РаспределенныеТовары.Очистить();
		Объект.рар_мп_МаркируемыеТовары.Очистить();
		Объект.рар_мп_КоличествоГрузовыхМест.Очистить();
		
		ЗагрузитьЗаказыНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗаказыНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК рар_мп_Заказ,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиента.рар_мп_Ozon_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ЗаказКлиента.рар_мп_Ozon_ПодстатусЗаказа КАК рар_мп_СтатусОбработкиЗаказа
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказКлиента.Проведен = ИСТИНА
		|	И ЗаказКлиента.рар_мп_АккаунтМаркетплейса = &рар_мп_АккаунтМаркетплейса
		|	И ЗаказКлиента.рар_мп_Ozon_СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рар_мп_Ozon_СтатусыЗаказов.awaiting_packaging)
		|	И ЗаказКлиента.ДатаОтгрузки <= &рар_мп_ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.рар_мп_Заказ КАК рар_мп_Заказ,
		|	ВТ_Заказы.рар_мп_НомерЗаказа КАК рар_мп_НомерЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусОбработкиЗаказа КАК рар_мп_СтатусОбработкиЗаказа,
		|	ВТ_Заказы.рар_мп_Заказ.Товары.(
		|		НомерСтроки КАК рар_мп_СтрокаИзТЧТовары,
		|		Номенклатура КАК рар_мп_Номенклатура,
		|		Характеристика КАК рар_мп_Характеристика,
		|		Номенклатура.Артикул КАК рар_мп_Артикул,
		|		КоличествоУпаковок КАК рар_мп_КоличествоУпаковок,
		|		Количество КАК рар_мп_Количество
		|	) КАК рар_мп_ТЧТовары
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_СтрокаИзТЧТовары КАК рар_мп_СтрокаИзТЧТовары,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Exemplar_Id КАК рар_мп_Exemplar_Id,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура КАК рар_мп_Номенклатура,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура.Артикул КАК рар_мп_Артикул,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Характеристика КАК рар_мп_Характеристика,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеМаркировки КАК рар_мп_ЗаполнениеМаркировки,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЧестныйЗнак КАК рар_мп_ЧестныйЗнак,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_IDТовара КАК рар_мп_IDТовара,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеГТД КАК рар_мп_ЗаполнениеГТД,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_НомерГТД КАК рар_мп_НомерГТД
		|ИЗ
		|	Документ.ЗаказКлиента.рар_мп_ТоварыДляМаркировки КАК ЗаказКлиентарар_мп_ТоварыДляМаркировки
		|ГДЕ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Заказы.рар_мп_Заказ
		|			ИЗ
		|				ВТ_Заказы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заказы.рар_мп_Заказ.рар_мп_УникальныйИдентификаторСклада КАК рар_мп_ИдентификаторСклада,
		|	0 КАК рар_мп_КоличествоГрузовыхМест
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы";
		
		Запрос.УстановитьПараметр("рар_мп_АккаунтМаркетплейса", Объект.рар_мп_АккаунтМаркетплейса);
		Запрос.УстановитьПараметр("рар_мп_ДатаОтгрузки", Объект.рар_мп_ДатаОтгрузки);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыгрузкаЗаказов 		   = РезультатЗапроса[1].Выгрузить();
		ВыгрузкаМаркируемыхТоваров = РезультатЗапроса[2].Выгрузить();
		ВыгрузкаСкладов			   = РезультатЗапроса[3].Выгрузить();
		
		Если ВыгрузкаЗаказов.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Заказов для обработки с датой отгрузки: %1 не загружено в базу", Формат(Объект.рар_мп_ДатаОтгрузки, "ДФ=дд.ММ.гггг"));
			Сообщение.Сообщить();	
			
		Иначе
			
			Попытка
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_ПередачаНаКомиссию.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_МаркируемыеТовары.Загрузить(ВыгрузкаМаркируемыхТоваров);
				Объект.рар_мп_КоличествоГрузовыхМест.Загрузить(ВыгрузкаСкладов);
				
				Для каждого Строка Из ВыгрузкаЗаказов Цикл
					
					Для каждого СтрокаТЧ Из Строка.рар_мп_ТЧТовары Цикл
						
						Для Счетчик = 1 По СтрокаТЧ.рар_мп_КоличествоУпаковок Цикл
							
							НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
							
							НоваяСтрока.рар_мп_НомерЗаказа 		  = Строка.рар_мп_НомерЗаказа;
							НоваяСтрока.рар_мп_СтрокаИзТЧТовары   = СтрокаТЧ.рар_мп_СтрокаИзТЧТовары;
							НоваяСтрока.рар_мп_Номенклатура		  = СтрокаТЧ.рар_мп_Номенклатура;
							НоваяСтрока.рар_мп_Характеристика	  = СтрокаТЧ.рар_мп_Характеристика;
							НоваяСтрока.рар_мп_Артикул			  = СтрокаТЧ.рар_мп_Артикул;
							НоваяСтрока.рар_мп_КоличествоУпаковок = 1;
							НоваяСтрока.рар_мп_Количество		  = СтрокаТЧ.рар_мп_Количество / СтрокаТЧ.рар_мп_КоличествоУпаковок;
							
						КонецЦикла;	
						
						
					КонецЦикла;	
					
				КонецЦикла;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Загрузка заказов завершена";
				Сообщение.Сообщить();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка загрузки заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить(); 
				
				ЗаписьЖурналаРегистрации("Ошибка загрузки заказов в реестр заказов", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Очистить();
				Объект.рар_мп_ПередачаНаКомиссию.Очистить();
				Объект.рар_мп_ТоварыИзЗаказов.Очистить();
				
			КонецПопытки;
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК рар_мп_Заказ,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиента.рар_мп_ЯндексМаркет_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ЗаказКлиента.рар_мп_ЯндексМаркет_ПодстатусЗаказа КАК рар_мп_СтатусОбработкиЗаказа
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказКлиента.Проведен = ИСТИНА
		|	И ЗаказКлиента.рар_мп_АккаунтМаркетплейса = &рар_мп_АккаунтМаркетплейса
		|	И ЗаказКлиента.ДатаОтгрузки = &рар_мп_ДатаОтгрузки
		|	И ЗаказКлиента.рар_мп_ЯндексМаркет_СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рар_мп_ЯндексМаркет_СтатусыЗаказов.PROCESSING)
		|	И ЗаказКлиента.рар_мп_ЯндексМаркет_ПодстатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рар_мп_ЯндексМаркет_ПодстатусыЗаказов.STARTED)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.рар_мп_Заказ КАК рар_мп_Заказ,
		|	ВТ_Заказы.рар_мп_НомерЗаказа КАК рар_мп_НомерЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусОбработкиЗаказа КАК рар_мп_СтатусОбработкиЗаказа,
		|	ВТ_Заказы.рар_мп_Заказ.Товары.(
		|		НомерСтроки КАК рар_мп_СтрокаИзТЧТовары,
		|		Номенклатура КАК рар_мп_Номенклатура,
		|		Характеристика КАК рар_мп_Характеристика,
		|		Номенклатура.Артикул КАК рар_мп_Артикул,
		|		КоличествоУпаковок КАК рар_мп_КоличествоУпаковок,
		|		Количество КАК рар_мп_Количество
		|	) КАК рар_мп_ТЧТовары
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_СтрокаИзТЧТовары КАК рар_мп_СтрокаИзТЧТовары,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Exemplar_Id КАК рар_мп_Exemplar_Id,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура КАК рар_мп_Номенклатура,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура.Артикул КАК рар_мп_Артикул,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Характеристика КАК рар_мп_Характеристика,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеМаркировки КАК рар_мп_ЗаполнениеМаркировки,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЧестныйЗнак КАК рар_мп_ЧестныйЗнак,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_IDТовара КАК рар_мп_IDТовара,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеГТД КАК рар_мп_ЗаполнениеГТД,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_НомерГТД КАК рар_мп_НомерГТД
		|ИЗ
		|	Документ.ЗаказКлиента.рар_мп_ТоварыДляМаркировки КАК ЗаказКлиентарар_мп_ТоварыДляМаркировки
		|ГДЕ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Заказы.рар_мп_Заказ
		|			ИЗ
		|				ВТ_Заказы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заказы.рар_мп_Заказ.рар_мп_УникальныйИдентификаторСклада КАК рар_мп_ИдентификаторСклада,
		|	0 КАК рар_мп_КоличествоГрузовыхМест
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы";
		
		Запрос.УстановитьПараметр("рар_мп_АккаунтМаркетплейса", Объект.рар_мп_АккаунтМаркетплейса);
		Запрос.УстановитьПараметр("рар_мп_ДатаОтгрузки", Объект.рар_мп_ДатаОтгрузки);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыгрузкаЗаказов 		   = РезультатЗапроса[1].Выгрузить();
		ВыгрузкаМаркируемыхТоваров = РезультатЗапроса[2].Выгрузить();
		ВыгрузкаСкладов			   = РезультатЗапроса[3].Выгрузить();
		
		Если ВыгрузкаЗаказов.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Заказов для обработки с датой отгрузки: %1 не загружено в базу", Формат(Объект.рар_мп_ДатаОтгрузки, "ДФ=дд.ММ.гггг"));
			Сообщение.Сообщить();
			
		Иначе
			
			Попытка
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_ПередачаНаКомиссию.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_МаркируемыеТовары.Загрузить(ВыгрузкаМаркируемыхТоваров);
				Объект.рар_мп_КоличествоГрузовыхМест.Загрузить(ВыгрузкаСкладов);
				
				Для каждого Строка Из ВыгрузкаЗаказов Цикл
					
					Для каждого СтрокаТЧ Из Строка.рар_мп_ТЧТовары Цикл
						
						Для Счетчик = 1 По СтрокаТЧ.рар_мп_КоличествоУпаковок Цикл
							
							НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
							
							НоваяСтрока.рар_мп_НомерЗаказа 		  = Строка.рар_мп_НомерЗаказа;
							НоваяСтрока.рар_мп_СтрокаИзТЧТовары   = СтрокаТЧ.рар_мп_СтрокаИзТЧТовары;
							НоваяСтрока.рар_мп_Номенклатура		  = СтрокаТЧ.рар_мп_Номенклатура;
							НоваяСтрока.рар_мп_Характеристика	  = СтрокаТЧ.рар_мп_Характеристика;
							НоваяСтрока.рар_мп_Артикул			  = СтрокаТЧ.рар_мп_Артикул;
							НоваяСтрока.рар_мп_КоличествоУпаковок = 1;
							НоваяСтрока.рар_мп_Количество		  = СтрокаТЧ.рар_мп_Количество / СтрокаТЧ.рар_мп_КоличествоУпаковок;
							
						КонецЦикла;	
						
						
					КонецЦикла;	
					
				КонецЦикла;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Загрузка заказов завершена";
				Сообщение.Сообщить();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка загрузки заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить(); 
				
				ЗаписьЖурналаРегистрации("Ошибка загрузки заказов в реестр заказов", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Очистить();
				Объект.рар_мп_ПередачаНаКомиссию.Очистить();
				Объект.рар_мп_ТоварыИзЗаказов.Очистить();
				
			КонецПопытки;
			
		КонецЕсли;		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК рар_мп_Заказ,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиента.рар_мп_Wildberries_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ЗаказКлиента.рар_мп_Wildberries_СтатусОбработкиЗаказа КАК рар_мп_СтатусОбработкиЗаказа
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказКлиента.Проведен = ИСТИНА
		|	И ЗаказКлиента.рар_мп_АккаунтМаркетплейса = &рар_мп_АккаунтМаркетплейса
		|	И ЗаказКлиента.ДатаОтгрузки <= КОНЕЦПЕРИОДА(&рар_мп_ДатаОтгрузки, ДЕНЬ)
		|	И ЗаказКлиента.рар_мп_Wildberries_СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рар_мп_Wildberries_СтатусыЗаказов.waiting)
		|	И ЗаказКлиента.рар_мп_Wildberries_СтатусОбработкиЗаказа = ЗНАЧЕНИЕ(Перечисление.рар_мп_Wildberries_СтатусыОбработкиЗаказов.new)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.рар_мп_Заказ КАК рар_мп_Заказ,
		|	ВТ_Заказы.рар_мп_НомерЗаказа КАК рар_мп_НомерЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусЗаказа КАК рар_мп_СтатусЗаказа,
		|	ВТ_Заказы.рар_мп_СтатусОбработкиЗаказа КАК рар_мп_СтатусОбработкиЗаказа,
		|	ВТ_Заказы.рар_мп_Заказ.Товары.(
		|		НомерСтроки КАК рар_мп_СтрокаИзТЧТовары,
		|		Номенклатура КАК рар_мп_Номенклатура,
		|		Характеристика КАК рар_мп_Характеристика,
		|		Номенклатура.Артикул КАК рар_мп_Артикул,
		|		КоличествоУпаковок КАК рар_мп_КоличествоУпаковок,
		|		Количество КАК рар_мп_Количество
		|	) КАК рар_мп_ТЧТовары
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка.НомерПоДаннымКлиента КАК рар_мп_НомерЗаказа,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_СтрокаИзТЧТовары КАК рар_мп_СтрокаИзТЧТовары,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Exemplar_Id КАК рар_мп_Exemplar_Id,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура КАК рар_мп_Номенклатура,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура.Артикул КАК рар_мп_Артикул,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_Характеристика КАК рар_мп_Характеристика,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеМаркировки КАК рар_мп_ЗаполнениеМаркировки,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЧестныйЗнак КАК рар_мп_ЧестныйЗнак,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_IDТовара КАК рар_мп_IDТовара,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеГТД КАК рар_мп_ЗаполнениеГТД,
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.рар_мп_НомерГТД КАК рар_мп_НомерГТД
		|ИЗ
		|	Документ.ЗаказКлиента.рар_мп_ТоварыДляМаркировки КАК ЗаказКлиентарар_мп_ТоварыДляМаркировки
		|ГДЕ
		|	ЗаказКлиентарар_мп_ТоварыДляМаркировки.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Заказы.рар_мп_Заказ
		|			ИЗ
		|				ВТ_Заказы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заказы.рар_мп_Заказ.рар_мп_УникальныйИдентификаторСклада КАК рар_мп_ИдентификаторСклада,
		|	0 КАК рар_мп_КоличествоГрузовыхМест
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы";
		
		Запрос.УстановитьПараметр("рар_мп_АккаунтМаркетплейса", Объект.рар_мп_АккаунтМаркетплейса);
		Запрос.УстановитьПараметр("рар_мп_ДатаОтгрузки", Объект.рар_мп_ДатаОтгрузки); 
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыгрузкаЗаказов 		   = РезультатЗапроса[1].Выгрузить();
		ВыгрузкаМаркируемыхТоваров = РезультатЗапроса[2].Выгрузить();
		ВыгрузкаСкладов			   = РезультатЗапроса[3].Выгрузить();
		
		Если ВыгрузкаЗаказов.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Заказов для обработки с датой отгрузки: %1 не загружено в базу", Формат(Объект.рар_мп_ДатаОтгрузки, "ДФ=дд.ММ.гггг"));
			Сообщение.Сообщить();	
			
		Иначе
			
			Попытка
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_ПередачаНаКомиссию.Загрузить(ВыгрузкаЗаказов);
				Объект.рар_мп_МаркируемыеТовары.Загрузить(ВыгрузкаМаркируемыхТоваров);
				Объект.рар_мп_КоличествоГрузовыхМест.Загрузить(ВыгрузкаСкладов);
				
				Для каждого Строка Из ВыгрузкаЗаказов Цикл
					
					Для каждого СтрокаТЧ Из Строка.рар_мп_ТЧТовары Цикл
						
						Для Счетчик = 1 По СтрокаТЧ.рар_мп_КоличествоУпаковок Цикл
							
							НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
							
							НоваяСтрока.рар_мп_НомерЗаказа 		  = Строка.рар_мп_НомерЗаказа;
							НоваяСтрока.рар_мп_СтрокаИзТЧТовары   = СтрокаТЧ.рар_мп_СтрокаИзТЧТовары;
							НоваяСтрока.рар_мп_Номенклатура		  = СтрокаТЧ.рар_мп_Номенклатура;
							НоваяСтрока.рар_мп_Характеристика	  = СтрокаТЧ.рар_мп_Характеристика;
							НоваяСтрока.рар_мп_Артикул			  = СтрокаТЧ.рар_мп_Артикул;
							НоваяСтрока.рар_мп_КоличествоУпаковок = 1;
							НоваяСтрока.рар_мп_Количество		  = СтрокаТЧ.рар_мп_Количество / СтрокаТЧ.рар_мп_КоличествоУпаковок;
							
						КонецЦикла;	
						
						
					КонецЦикла;	
					
				КонецЦикла;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Загрузка заказов завершена";
				Сообщение.Сообщить();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка загрузки заказов. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить(); 
				
				ЗаписьЖурналаРегистрации("Ошибка загрузки заказов в реестр заказов", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Очистить();
				Объект.рар_мп_ПередачаНаКомиссию.Очистить();
				Объект.рар_мп_ТоварыИзЗаказов.Очистить();
				
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область СозданиеПередачиНаКомиссию

&НаСервере
Процедура СоздатьПередачуНаКомиссиюНаСервере()
	
	Для каждого Строка Из Объект.рар_мп_ПередачаНаКомиссию Цикл 
		
		Если НЕ ЗначениеЗаполнено(Строка.рар_мп_ПередачаНаКомиссию) Тогда
			
			Заказ = Строка.рар_мп_Заказ.ПолучитьОбъект();
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				Если Заказ.НеОтгружатьЧастями <> Истина Тогда
					
					//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
					Заказ.НеОтгружатьЧастями = Истина;
					
					Заказ.ДатаОтгрузки = ТекущаяДатаСеанса();
					
				КонецЕсли;
				
			КонецЕсли;
			
			Для каждого СтрокаТЧ Из Заказ.Товары Цикл
				
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				Если СтрокаТЧ.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.Отгрузить Тогда
					
					//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
					СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
					
				КонецЕсли;
				
				
			КонецЦикла;
			
			Попытка
				
				Заказ.Записать(РежимЗаписиДокумента.Проведение);
				
				НовыйДокумент = Документы.ПередачаТоваровХранителю.СоздатьДокумент();
				НовыйДокумент.Заполнить(Строка.рар_мп_Заказ); 
				//@skip-check reading-attribute-from-database
				НовыйДокумент.Товары.Загрузить(Строка.рар_мп_Заказ.Товары.Выгрузить());
				
				Попытка
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					
				Исключение
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при проведении документа 'Передача на комиссию' для заказа %1", Строка.рар_мп_НомерЗаказа);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при проведении документа 'Передача на комиссию' для заказа %1", Строка.рар_мп_НомерЗаказа), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
					
				КонецПопытки;
				
				Строка.рар_мп_ПередачаНаКомиссию = НовыйДокумент.Ссылка;
				
			Исключение
				
				Заказ.Записать(РежимЗаписиДокумента.Запись);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при проведении документа 'Заказ клиента'  %1", Строка.рар_мп_НомерЗаказа);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при проведении документа 'Заказ клиента'  %1", Строка.рар_мп_НомерЗаказа), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
				
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создание передач на комиссию завершено";
	Сообщение.Сообщить();
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Асинх Процедура СоздатьПередачуНаКомиссию(Команда)
	Если Объект.рар_мп_ПередачаНаКомиссию.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заказов для создания документа передача на комиссию нет. Необходимо их загрузить";
		Сообщение.Сообщить();
		
	Иначе
		
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Данное действие приведет к созданию документов передача на комиссию по всем заказам в табличной части. 
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда 
			
			Возврат;
			
		КонецЕсли;
		
		СоздатьПередачуНаКомиссиюНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область СозданиеПоставки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СоздатьПоставку(Команда)
	Если ПроверитьЗаполнение() Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
			
			Если Объект.рар_мп_ЗаказыИзМаркетплейса.Количество() <> 0 Тогда
				
				СоздатьПоставкуНаСервере();	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не возможно создать поставку, так как не загружены заказы";
				Сообщение.Сообщить();	
				
			КонецЕсли;	
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Поставка уже создана. Повторное создание не возможно";
			Сообщение.Сообщить();	
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПоставкуНаСервере()
	
	Объект.рар_мп_Wildberries_НомерПоставки = рар_мп_ОбработкаЗаказов.Wildberries_СозданиеПоставки(Объект.рар_мп_АккаунтМаркетплейса, 
	"Поставка заказов от "+ ТекущаяДатаСеанса());      
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создание поставки завершено";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ДабавлениеЗаказовВПоставку

//@skip-check module-structure-form-event-regions
&НаКлиенте
Асинх Процедура ДобавитьЗаказыВПоставку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
			
			Если Объект.рар_мп_ЗаказыИзМаркетплейса.Количество() <> 0 Тогда
				
				Ответ = Ждать ВопросАсинх(НСтр("ru = 'Данное действие к добавлению всех заказов в поставку. 
				|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
				
				Если Ответ <> КодВозвратаДиалога.Да Тогда 
					
					Возврат;
					
				КонецЕсли;
				
				ДлительнаяОперация     = ДобавитьЗаказыВПоставкуНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Добавление заказов в поставку ...";
				Оповещение = Новый ОписаниеОповещения("ЗавершениеДобавленияЗаказовВПоставку", ЭтотОбъект);
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не возможно создать поставку, так как не загружены заказы";
				Сообщение.Сообщить();	
				
			КонецЕсли;	
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Поставка не создана. Перед добавлением заказов в поставку необходимо создать поставку";
			Сообщение.Сообщить();	
			
		КонецЕсли;				
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЗаказыВПоставкуНаСервере()
	
	ЗагруженныеЗаказы = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_НомерЗаказа");
	МассивЗаказов 	  = ЗагруженныеЗаказы.ВыгрузитьКолонку("рар_мп_НомерЗаказа");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	"рар_мп_ОбработкаЗаказов.Wildberries_ДобавитьЗаказКПоставке", 
	Объект.рар_мп_АккаунтМаркетплейса, 
	Объект.рар_мп_Wildberries_НомерПоставки, МассивЗаказов);	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеДобавленияЗаказовВПоставку(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗавершениеДобавленияЗаказовВПоставкуНаСервере(Результат);	
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеДобавленияЗаказовВПоставкуНаСервере(Результат)
	
	МассивНомеровЗаказов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Для каждого НомерЗаказа Из МассивНомеровЗаказов Цикл
		
		НайденныеСтроки = Объект.рар_мп_ЗаказыИзМаркетплейса.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			
			НужнаяСтрока = НайденныеСтроки.Получить(0);
			
			НужнаяСтрока.рар_мп_СтатусОбработкиЗаказа = Перечисления.рар_мп_Wildberries_СтатусыОбработкиЗаказов.confirm;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.рар_мп_ЗапрещеноИзменятьСоставаРеестра = Истина;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Добавление заказов в поставку завершено";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область ИзменениеВидимостиРеквизитов
&НаСервере
Процедура АккаунтМаркетплейсаПриИзмененииНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		//alsalt 09.06.25
		//Элементы.СозданиеПоставки.Видимость = Истина;
		
		Элементы.рар_мп_Wildberries_НомерПоставки.Видимость = Истина;
		
		Элементы.СоздатьПоставку.Видимость = Ложь;
		
		Элементы.ДобавитьЗаказыВПоставку.Видимость = Ложь;
		
		Элементы.Вторая.Видимость = Истина;
		//alsalt 09.06.25
		
		Элементы.ПередатьМаркировкиВМаркетплейс.Видимость = Истина; 
		
		Элементы.ИзменитьСтатусУЗаказов.Видимость = Истина;
		
		Элементы.ЗаказКлиента.Видимость = Истина;
		
		Элементы.СоздатьКоробку.Видимость = Истина;
		
		Элементы.УдалитьКоробку.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.Видимость = Истина;
		 
		Элементы.рар_мп_РаспределенныеТовары.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.ПодчиненныеЭлементы.рар_мп_Коробкирар_мп_НомерЗаказа.Видимость = Истина;
		
		Элементы.ГруппаКнопокПеремещенияТоваров.Видимость = Истина;
		
		Элементы.ПечатьQRКороба.Видимость = Ложь;
		
		Элементы.ФормаСформироватьЛистПодбора.Видимость = Истина; 
		
		Элементы.ФормаСформироватьЛистОтгрузки.Видимость = Истина;
		
		ПодключенаДоверительнаяПриемка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "ПодключенаДоверительнаяПриемка");
		
		Если ПодключенаДоверительнаяПриемка Тогда
			
			Элементы.СтраницаКоличествоГрузовыхМест.Видимость = Истина;	
			
		Иначе
			
			Элементы.СтраницаКоличествоГрузовыхМест.Видимость = Ложь;	
			
		КонецЕсли;
		
		Элементы.ПечатьСтикеровДляКоробов.Видимость = Ложь;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		//Элементы.СозданиеПоставки.Видимость = Ложь;
		
		Элементы.рар_мп_Wildberries_НомерПоставки.Видимость = Ложь;
		
		Элементы.СоздатьПоставку.Видимость = Ложь;
		
		Элементы.ДобавитьЗаказыВПоставку.Видимость = Ложь;
		
		Элементы.Вторая.Видимость = Ложь;
		
		Элементы.ПередатьМаркировкиВМаркетплейс.Видимость = Истина;
		
		Элементы.ИзменитьСтатусУЗаказов.Видимость = Истина; 
		
		Элементы.ЗаказКлиента.Видимость = Истина;
		
		Элементы.СоздатьКоробку.Видимость = Истина;
		
		Элементы.УдалитьКоробку.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.Видимость = Истина;
		
		Элементы.рар_мп_РаспределенныеТовары.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.ПодчиненныеЭлементы.рар_мп_Коробкирар_мп_НомерЗаказа.Видимость = Истина;
		
		Элементы.ГруппаКнопокПеремещенияТоваров.Видимость = Истина;
		
		Элементы.ПечатьQRКороба.Видимость = Ложь;
		
		Элементы.СтраницаКоличествоГрузовыхМест.Видимость = Ложь; 
		
		Элементы.ПечатьСтикеровДляКоробов.Видимость = Ложь;
		
		Элементы.ФормаСформироватьЛистПодбора.Видимость = Ложь;  
		
		Элементы.ФормаСформироватьЛистОтгрузки.Видимость = Ложь;
		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда	
		
		//Элементы.СозданиеПоставки.Видимость = Истина;
		
		Элементы.рар_мп_Wildberries_НомерПоставки.Видимость = Истина;
		
		Элементы.СоздатьПоставку.Видимость = Истина;
		
		Элементы.ДобавитьЗаказыВПоставку.Видимость = Истина;
		
		Элементы.Вторая.Видимость = Ложь;
		
		Элементы.ПередатьМаркировкиВМаркетплейс.Видимость = Истина;
		
		Элементы.ИзменитьСтатусУЗаказов.Видимость = Ложь;
		
		Элементы.ЗаказКлиента.Видимость = Ложь;
		
		Элементы.СоздатьКоробку.Видимость = Истина;
		
		Элементы.УдалитьКоробку.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.Видимость = Истина;   
		
		//mikhay ++ скрываем ТЧ_РаспределенныеТовары и кнопки перемещения
		Элементы.рар_мп_РаспределенныеТовары.Видимость = Ложь;
		
		Элементы.рар_мп_Коробки.ПодчиненныеЭлементы.рар_мп_Коробкирар_мп_НомерЗаказа.Видимость = Ложь;
		
		Элементы.ГруппаКнопокПеремещенияТоваров.Видимость = Ложь;
		//mikhay -- скрываем ТЧ_РаспределенныеТовары и кнопки перемещения
		
		Элементы.ПечатьQRКороба.Видимость = Истина;
		
		Элементы.СтраницаКоличествоГрузовыхМест.Видимость = Ложь;
		
		Элементы.ПечатьСтикеровДляКоробов.Видимость = Истина;
		
		Элементы.ФормаСформироватьЛистПодбора.Видимость = Истина;
		
		Элементы.ФормаСформироватьЛистОтгрузки.Видимость = Ложь;
		
	Иначе
		
		//Элементы.СозданиеПоставки.Видимость = Истина;
		
		Элементы.рар_мп_Wildberries_НомерПоставки.Видимость = Истина;
		
		Элементы.СоздатьПоставку.Видимость = Истина;
		
		Элементы.ДобавитьЗаказыВПоставку.Видимость = Истина;
		
		Элементы.Вторая.Видимость = Истина;
		
		Элементы.ПередатьМаркировкиВМаркетплейс.Видимость = Истина;
		
		Элементы.ИзменитьСтатусУЗаказов.Видимость = Истина;
		
		Элементы.ЗаказКлиента.Видимость = Истина;
		
		Элементы.СоздатьКоробку.Видимость = Истина;
		
		Элементы.УдалитьКоробку.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.Видимость = Истина;
		
		Элементы.рар_мп_РаспределенныеТовары.Видимость = Истина;
		
		Элементы.рар_мп_Коробки.ПодчиненныеЭлементы.рар_мп_Коробкирар_мп_НомерЗаказа.Видимость = Истина;
		
		Элементы.ГруппаКнопокПеремещенияТоваров.Видимость = Истина; 
		
		Элементы.ПечатьQRКороба.Видимость = Истина;
		
		Элементы.СтраницаКоличествоГрузовыхМест.Видимость = Истина;
		
		Элементы.ПечатьСтикеровДляКоробов.Видимость = Истина;
		
		Элементы.ФормаСформироватьЛистПодбора.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура АккаунтМаркетплейсаПриИзменении(Элемент)
	
	АккаунтМаркетплейсаПриИзмененииНаСервере(); 
	
	Объект.рар_мп_ЗаказыИзМаркетплейса.Очистить();
	Объект.рар_мп_Коробки.Очистить();
	Объект.рар_мп_ПередачаНаКомиссию.Очистить();
	Объект.рар_мп_РаспределенныеТовары.Очистить();
	Объект.рар_мп_ТоварыИзЗаказов.Очистить();
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПередачаМаркировкиВМаркетплейс

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПередатьМаркировкиВМаркетплейс(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если АккаунтИзWildberries() Тогда
			
			Если Объект.рар_мп_ЗаказыИзМаркетплейса.Количество() <> 0 Тогда	
				
				Если ПроверкаЗаполненияМаркируемыхТоваров() Тогда
					
					ДлительнаяОперация     = Wildberries_ПередатьМаркировкиВМаркетплейсНаСервере();
					ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
					ПараметрыОжидания.ВыводитьСообщения = Истина;
					ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
					ПараметрыОжидания.ТекстСообщения = "Передача маркировки в маркетплейс ...";
					Оповещение = Новый ОписаниеОповещения("ЗавершениеПередачиМаркировкиВМаркетплейс", ЭтотОбъект);
					ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
					
				КонецЕсли;	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не возможно передать марвировки на маркетплейс, так как не загружены заказы или не все товары распределны по коробкам";
				Сообщение.Сообщить();	
				
			КонецЕсли;
			
		ИначеЕсли АккаунтИзЯндексМаркет() Тогда
			
			Если ПроверкаЗаполненияМаркируемыхТоваров() Тогда
				
				Если Объект.рар_мп_ТоварыИзЗаказов.Количество() = 0 И Объект.рар_мп_Коробки. Количество() <> 0 И Объект.рар_мп_РаспределенныеТовары.Количество() <> 0 Тогда
					
					ДлительнаяОперация     = ЯндексМаркет_ПередатьМаркировкиВМаркетплейсНаСервере();
					ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
					ПараметрыОжидания.ВыводитьСообщения = Истина;
					ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
					ПараметрыОжидания.ТекстСообщения = "Передача маркировки в маркетплейс ...";
					Оповещение = Новый ОписаниеОповещения("ЗавершениеПередачиМаркировкиВМаркетплейс", ЭтотОбъект);
					ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не все товары распределены по коробкам";
					Сообщение.Сообщить();
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		ИначеЕсли АккаунтИзOzon() Тогда
			
			Если ПроверкаЗаполненияМаркируемыхТоваров() Тогда
				
				Если Объект.рар_мп_ТоварыИзЗаказов.Количество() = 0 И Объект.рар_мп_Коробки.Количество() <> 0 И Объект.рар_мп_РаспределенныеТовары.Количество() <> 0 Тогда
					
					ДлительнаяОперация     = Ozon_ПередатьМаркировкиВМаркетплейсНаСервере();
					ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
					ПараметрыОжидания.ВыводитьСообщения = Истина;
					ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
					ПараметрыОжидания.ТекстСообщения = "Передача маркировки в маркетплейс ...";
					Оповещение = Новый ОписаниеОповещения("ЗавершениеПередачиМаркировкиВМаркетплейс", ЭтотОбъект);
					ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не все товары распределены по коробкам";
					Сообщение.Сообщить();
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Wildberries_ПередатьМаркировкиВМаркетплейсНаСервере()
	
	МаркируемыеТовары = Объект.рар_мп_МаркируемыеТовары.Выгрузить();
	Заказы 			  = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	"рар_мп_ОбработкаЗаказов.Wildberries_ПередачаМаркировкиВМаркетплейс", 
	Объект.рар_мп_АккаунтМаркетплейса, Заказы, МаркируемыеТовары);
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаСервере
Функция ЯндексМаркет_ПередатьМаркировкиВМаркетплейсНаСервере()
	
	Заказы				 = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить();
	РаспределенныеТовары = Объект.рар_мп_РаспределенныеТовары.Выгрузить();
	МаркируемыеТовары	 = Объект.рар_мп_МаркируемыеТовары.Выгрузить();
	Коробки				 = Объект.рар_мп_Коробки.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	"рар_мп_ОбработкаЗаказов.ЯндексМаркет_ПередачаМаркировки", Объект.рар_мп_АккаунтМаркетплейса, 
	Заказы, РаспределенныеТовары, МаркируемыеТовары,Коробки);
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаСервере
Функция Ozon_ПередатьМаркировкиВМаркетплейсНаСервере()
	
	МаркируемыеТовары = Объект.рар_мп_МаркируемыеТовары.Выгрузить();
	СозданныеКоробки  = Объект.рар_мп_Коробки.Выгрузить();
	Заказы			  = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	"рар_мп_ОбработкаЗаказов.Ozon_ПередачаМаркировкиВМаркетплейс", 
	Объект.рар_мп_АккаунтМаркетплейса, МаркируемыеТовары, СозданныеКоробки, Заказы);
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаСервере
Функция ПроверкаЗаполненияМаркируемыхТоваров()
	
	ТаблицаЗаполненаПравильно = Истина;
	
	Для каждого Строка Из Объект.рар_мп_МаркируемыеТовары Цикл
		
		Если Строка.рар_мп_ЗаполнениеМаркировки И НЕ ЗначениеЗаполнено(Строка.рар_мп_ЧестныйЗнак) Тогда
			
			ТаблицаЗаполненаПравильно = Ложь;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не указана маркировка для номенклатуры: %1 (артикул %2) из заказа номер: %3", 
			Строка.рар_мп_Номенклатура, Строка.рар_мп_Артикул, Строка.рар_мп_НомерЗаказа);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ТаблицаЗаполненаПравильно;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПередачиМаркировкиВМаркетплейс(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда 
		
		ВозвратноеЗначение = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если ВозвратноеЗначение Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Передача маркировки на маркетплейс завершена успешно";
			Сообщение.Сообщить();
			
			Объект.рар_мп_ЗапрещеноИзменятьСоставаРеестра = Истина;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при передаче маркировок на маркетплейс";
			Сообщение.Сообщить();	
			
		КонецЕсли;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область ПодтверждениеОтгрузки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПодтвердитьОтгрузку(Команда)
	ПодтвердитьОтгрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьОтгрузкуНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ТаблицаЗаполнена = Истина;
		
		ПодключенаДоверительнаяПриемка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "ПодключенаДоверительнаяПриемка");
		
		Если ПодключенаДоверительнаяПриемка Тогда
			
			Для каждого Строка Из Объект.рар_мп_КоличествоГрузовыхМест Цикл
				
				Если Строка.рар_мп_КоличествоГрузовыхМест = 0 Тогда
					
					ТаблицаЗаполнена = Ложь;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Для идентификатора склада %1 не указано количество грузовых мест", Строка.рар_мп_ИдентификаторСклада);
					Сообщение.Сообщить();
					
				КонецЕсли;	
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если ТаблицаЗаполнена Тогда
			
			КоличествоГрузовыхМест = Объект.рар_мп_КоличествоГрузовыхМест.Выгрузить();
			
			ДанныеОтгрузки = рар_мп_ОбработкаЗаказов.Ozon_ПодтверждениеОтгрузки(Объект.рар_мп_АккаунтМаркетплейса, КоличествоГрузовыхМест, ПодключенаДоверительнаяПриемка);
			
			Если ДанныеОтгрузки.Подтверждена Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Отгрузка подтверждена";
				Сообщение.Сообщить();
				
				Объект.рар_мп_Wildberries_НомерПоставки = СтрЗаменить(ДанныеОтгрузки.НомерПеревозки, " ", "");
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ОтгрузкаПодтверждена = рар_мп_ОбработкаЗаказов.Wildberries_ПодтверждениеОтгрузки(Объект.рар_мп_АккаунтМаркетплейса, Объект.рар_мп_Wildberries_НомерПоставки);
		
		Если ОтгрузкаПодтверждена Тогда
			
			Для каждого Строка Из Объект.рар_мп_ЗаказыИзМаркетплейса Цикл
				
				Строка.рар_мп_СтатусОбработкиЗаказа = Перечисления.рар_мп_Wildberries_СтатусыОбработкиЗаказов.complete;	
				
			КонецЦикла;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отгрузка подтвеждена";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ВыгрузкаCampaignId = Объект.рар_мп_КоличествоГрузовыхМест.Выгрузить();
		
		СтатусПодтверждения = рар_мп_ОбработкаЗаказов.ЯндексМаркет_ПодтверждениеОтгрузки(Объект.рар_мп_АккаунтМаркетплейса, ВыгрузкаCampaignId);
		
		Если СтатусПодтверждения Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отгрузка подтверждена";
			Сообщение.Сообщить();
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отгрузка не подтверждена";
			Сообщение.Сообщить();	
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область СозданиеКоробки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СоздатьКоробку(Команда)
	
	Если АккаунтИзЯндексМаркет() Или АккаунтИзOzon() Тогда
		
		Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
			
			СоздатьКоробкуНаСервере();
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите заказы, для которых нужно создать коробоку";
			Сообщение.Сообщить();	
			
		КонецЕсли;
		
	ИначеЕсли АккаунтИзWildberries() Тогда
		
		Если ПроверитьЗаполнение() Тогда
			
			Если ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
				
				Wildberries_СоздатьКоробкуНаСервере();
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Нельзя создать коробку, так как не создана поставка";
				Сообщение.Сообщить();
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКоробкуНаСервере()
	
	Для каждого Заказ Из ЗаказКлиента Цикл
		
		//@skip-check reading-attribute-from-database
		НомерЗаказа = Заказ.Значение.НомерПоДаннымКлиента;
		
		КоличествоКоробок = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа)).Количество();		
		
		Строка = Объект.рар_мп_Коробки.Добавить();
		
		Строка.рар_мп_Коробка 	  = СтрШаблон("Коробка №%1", КоличествоКоробок + 1);
		Строка.рар_мп_НомерЗаказа = НомерЗаказа;	
		
	КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура Wildberries_СоздатьКоробкуНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для Ozon нельзя создавать коробки";
		Сообщение.Сообщить();	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Функциионал не реализован";
		Сообщение.Сообщить();	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		УникальныйИдентификаторКоробки = рар_мп_ОбработкаЗаказов.Wildberries_СоздатьКоробкуВПоставке(Объект.рар_мп_АккаунтМаркетплейса,
		Объект.рар_мп_Wildberries_НомерПоставки);
		
		Если УникальныйИдентификаторКоробки <> "" Тогда
			
			НоваяСтрока = Объект.рар_мп_Коробки.Добавить();
			
			НоваяСтрока.рар_мп_Коробка = УникальныйИдентификаторКоробки;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Коробка создана";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область УдалениеКоробки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура УдалитьКоробку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		УдалитьКоробкуНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКоробкуНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");	
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет 
		Или Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ВыбраннаяСтрока = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбраннаяСтрока.Количество() > 0 Тогда
			
			НужнаяСтрока = ВыбраннаяСтрока.Получить(0);
			
			СтрокиДляУдаления = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_Коробка, рар_мп_НомерЗаказа", 
			НужнаяСтрока.рар_мп_Коробка,
			НужнаяСтрока.рар_мп_НомерЗаказа));
			
			Для каждого Строка Из СтрокиДляУдаления Цикл
				
				НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
				
				НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
				НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
				НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
				НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
				НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
				НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
				НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
				
				Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(Строка));		
				
			КонецЦикла;
			
			Объект.рар_мп_Коробки.Удалить(Объект.рар_мп_Коробки.Индекс(НужнаяСтрока));
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Коробка удалена";
			Сообщение.Сообщить();
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для удаления необходимо выбрать коробку (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ВыбраннаяСтрока = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбраннаяСтрока.Количество() > 0 Тогда
			
			НужнаяСтрока = ВыбраннаяСтрока.Получить(0);
			
			СтатусУдаления = рар_мп_ОбработкаЗаказов.Wildberries_УдалитьКоробкуВПоставке(Объект.рар_мп_АккаунтМаркетплейса,
			Объект.рар_мп_Wildberries_НомерПоставки,
			НужнаяСтрока.рар_мп_Коробка);
			
			Если СтатусУдаления Тогда
			
				СтрокиДляУдаления = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_Коробка", НужнаяСтрока.рар_мп_Коробка));
				
				Для каждого Строка Из СтрокиДляУдаления Цикл
					
					НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
					
					НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
					НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
					НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
					НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
					НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
					НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
					НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
					
					
					Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(Строка));		
					
				КонецЦикла;  
				
				Объект.рар_мп_Коробки.Удалить(Объект.рар_мп_Коробки.Индекс(НужнаяСтрока));
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Коробка удалена";
				Сообщение.Сообщить();
				
			КонецЕсли;
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для удаления необходимо выбрать коробку (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ДобавлениеВКоробку

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ДобавитьВКоробку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ДобавитьВКоробкуНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВКоробкуНаСервере()
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");	
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Или
		Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ВыбраннаяКоробка = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбраннаяКоробка.Количество() > 0 Тогда
			
			НужнаяКоробка = ВыбраннаяКоробка.Получить(0);
			
			ВыбранныеСтроки = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
			
			Если ВыбранныеСтроки.Количество() > 0 Тогда
				
				Если ПроверитьЗаполнениеТабличнойЧастиТоварыИзЗаказов(ВыбранныеСтроки) Тогда
					
					Для каждого Строка Из ВыбранныеСтроки Цикл
						
						Если Строка.рар_мп_НомерЗаказа <> НужнаяКоробка.рар_мп_НомерЗаказа Тогда
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Номерклатура: %1 (Артикул: %2. Номер заказа: %3) не содержиться в заказе: %4",
							Строка.рар_мп_Номенклатура, Строка.рар_мп_Артикул, 
							Строка.рар_мп_НомерЗаказа, НужнаяКоробка.рар_мп_НомерЗаказа);
							Сообщение.Сообщить();
							
						Иначе
							
							НоваяСтрока = Объект.рар_мп_РаспределенныеТовары.Добавить();
							
							НоваяСтрока.рар_мп_Коробка			    = НужнаяКоробка.рар_мп_Коробка;
							НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
							НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
							НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
							НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
							НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
							НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
							НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
							
							Объект.рар_мп_ТоварыИзЗаказов.Удалить(Объект.рар_мп_ТоварыИзЗаказов.Индекс(Строка));	
							
						КонецЕсли;
						
						
					КонецЦикла;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Добавление в коробку завершено";
					Сообщение.Сообщить();
					
				КонецЕсли;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для добавления в коробку необходимо выбрать заказы (отметить строку галочкой)";
				Сообщение.Сообщить();	
				
			КонецЕсли;
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для добавления в коробку необходимо выбрать коробку (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ВыбраннаяКоробка = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбраннаяКоробка.Количество() > 0 Тогда
			
			НужнаяКоробка = ВыбраннаяКоробка.Получить(0);
			
			ВыбранныеСтроки = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
			
			Если ВыбранныеСтроки.Количество() > 0 Тогда
				
				Если ПроверитьЗаполнениеТабличнойЧастиТоварыИзЗаказов(ВыбранныеСтроки) Тогда
					
					МассивНомеровЗаказов = Новый Массив;
					
					Для каждого Строка Из ВыбранныеСтроки Цикл
						
						НомерЗаказа = Строка.рар_мп_НомерЗаказа;
						
						Если МассивНомеровЗаказов.Найти(НомерЗаказа) = Неопределено Тогда
							
							МассивНомеровЗаказов.Добавить(НомерЗаказа);		
							
						КонецЕсли;
						
					КонецЦикла;
					
					СтатусДобавления = рар_мп_ОбработкаЗаказов.Wildberries_ДобавитьВКоробку(Объект.рар_мп_АккаунтМаркетплейса,
					Объект.рар_мп_Wildberries_НомерПоставки,
					НужнаяКоробка.рар_мп_Коробка,
					МассивНомеровЗаказов);
					
					Если СтатусДобавления Тогда
						
						Для каждого Строка Из ВыбранныеСтроки Цикл
							
							НоваяСтрока = Объект.рар_мп_РаспределенныеТовары.Добавить();
							
							НоваяСтрока.рар_мп_Коробка			    = НужнаяКоробка.рар_мп_Коробка;
							НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
							НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
							НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
							НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
							НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
							НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
							НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
							
							Объект.рар_мп_ТоварыИзЗаказов.Удалить(Объект.рар_мп_ТоварыИзЗаказов.Индекс(Строка));		
							
						КонецЦикла;
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Добавление в коробку завершено";
						Сообщение.Сообщить();
						
					КонецЕсли;
					
				КонецЕсли;	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для добавления в коробку необходимо выбрать заказы (отметить строку галочкой)";
				Сообщение.Сообщить();	
				
			КонецЕсли;
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для добавления в коробку необходимо выбрать коробку (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеТабличнойЧастиТоварыИзЗаказов(ВыбранныеСтроки)
	
	ВсеЗаполнено = Истина;
	
	Для каждого Строка_ТоварыИзЗаказов Из ВыбранныеСтроки Цикл
		
		//@skip-check structure-consructor-too-many-keys
		НужныеСтроки = Объект.рар_мп_МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа, рар_мп_СтрокаИзТЧТовары, рар_мп_Артикул, рар_мп_Номенклатура, рар_мп_Характеристика", 
		Строка_ТоварыИзЗаказов.рар_мп_НомерЗаказа, Строка_ТоварыИзЗаказов.рар_мп_СтрокаИзТЧТовары,
		Строка_ТоварыИзЗаказов.рар_мп_Артикул, Строка_ТоварыИзЗаказов.рар_мп_Номенклатура,
		Строка_ТоварыИзЗаказов.рар_мп_Характеристика));
		
		Для каждого Строка Из НужныеСтроки Цикл
			
			Если Строка.рар_мп_ЗаполнениеМаркировки Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.рар_мп_ЧестныйЗнак) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не заполнена маркировка у номерклатуры: %1 (Заказ: %2. Номер строки из табличной части Товары: %3. Артикул: %4)",
					Строка.рар_мп_Номенклатура, Строка.рар_мп_НомерЗаказа, Строка.рар_мп_СтрокаИзТЧТовары, Строка.рар_мп_Артикул);
					Сообщение.Сообщить();
					
					ВсеЗаполнено = Ложь;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;															
		
		
	КонецЦикла;	
	
	Возврат ВсеЗаполнено; 
	
КонецФункции

#КонецОбласти 

//@skip-check module-structure-top-region
#Область УдалениеИзКоробки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура УдалитьИзКоробки(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ВыбранныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбранныеСтроки.Количество() > 0 Тогда
			
			Если АккаунтИзWildberries() Тогда
				
				ДлительнаяОперация     = Wildberries_УдалитьИзКоробкиНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Удаление из коробки ...";
				Оповещение = Новый ОписаниеОповещения("ЗавершениеУдаленияИзКоробки", ЭтотОбъект);
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
				
			ИначеЕсли АккаунтИзЯндексМаркет() Или АккаунтИзOzon() Тогда
				
				Для каждого Строка из ВыбранныеСтроки Цикл
					
					НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
					
					НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
					НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
					НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
					НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
					НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
					НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
					НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
					
					
					Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(Строка));
					
				КонецЦикла;	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Удаление из коробки завершено";
				Сообщение.Сообщить();
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для данного аккаунта нельзя удалять коробки";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для удаления из коробки необходимо выбрать заказы (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Wildberries_УдалитьИзКоробкиНаСервере()
	
	ВыбранныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
	
	НужныеСтроки = Объект.рар_мп_РаспределенныеТовары.Выгрузить(ВыбранныеСтроки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	"рар_мп_ОбработкаЗаказов.Wildberries_УдалитьИзКоробки", 
	Объект.рар_мп_АккаунтМаркетплейса, Объект.рар_мп_Wildberries_НомерПоставки,
	НужныеСтроки);		
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеУдаленияИзКоробки(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗавершениеУдаленияИзКоробкиНаСервере(Результат);	
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеУдаленияИзКоробкиНаСервере(Результат) 
	
	МассивСтрокДляУдаления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Для каждого Строка Из МассивСтрокДляУдаления Цикл
		
		НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
		
		НоваяСтрока.рар_мп_НомерЗаказа          = Строка.рар_мп_НомерЗаказа;
		НоваяСтрока.рар_мп_СтрокаИзТЧТовары     = Строка.рар_мп_СтрокаИзТЧТовары;
		НоваяСтрока.рар_мп_Артикул              = Строка.рар_мп_Артикул;
		НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
		НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;
		НоваяСтрока.рар_мп_КоличествоУпаковок	= Строка.рар_мп_КоличествоУпаковок;
		НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
		
		//@skip-check structure-consructor-too-many-keys
		СтуктураПоискаСтроки = Новый Структура("рар_мп_Коробка, рар_мп_НомерЗаказа, рар_мп_СтрокаИзТЧТовары, рар_мп_Номенклатура,рар_мп_Характеристика, рар_мп_Артикул", 
		Строка.рар_мп_Коробка, Строка.рар_мп_НомерЗаказа, Строка.рар_мп_СтрокаИзТЧТовары, Строка.рар_мп_Номенклатура, 
		Строка.рар_мп_Характеристика, Строка.рар_мп_Артикул);		
		НужнаяСтрока = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(СтуктураПоискаСтроки);
		
		Если НужнаяСтрока.Количество() <> 0 Тогда
			
			Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(НужнаяСтрока.Получить(0)));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Удаление из коробки завершено";
	Сообщение.Сообщить();	
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПечатьВсехЭтикеток

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПечатьЭтикеткокВсехЗаказов(Команда)
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.рар_мп_ЗаказыИзМаркетплейса.Количество() <> 0 Тогда
			
			ДлительнаяОперация     = ПолучениеВсехЭтикеток();
			ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьСообщения = Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ПараметрыОжидания.ТекстСообщения = "Получение этикеток для всех заказов...";                                    
			Оповещение = Новый ОписаниеОповещения("ЗавершениеПолученияЭтикеток", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Распечатать этикетки нельзя, так как не загружены заказы";
			Сообщение.Сообщить();	
			
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучениеВсехЭтикеток()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда 
		
		СписокЗаказов = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_НомерЗаказа");
		
		МассивНомеровЗаказов = СписокЗаказов.ВыгрузитьКолонку("рар_мп_НомерЗаказа");
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Ozon_ПолучитьЭтикетки", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		СписокЗаказов = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_НомерЗаказа");
		
		МассивНомеровЗаказов = СписокЗаказов.ВыгрузитьКолонку("рар_мп_НомерЗаказа");
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.ЯндексМаркет_ПолучитьЭтикеткиЗаказов", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		СписокЗаказов = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_НомерЗаказа");
		
		МассивНомеровЗаказов = СписокЗаказов.ВыгрузитьКолонку("рар_мп_НомерЗаказа");
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Wildberries_ПолучитьЭтикеткиЗаказов", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
		
	КонецЕсли; 
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияЭтикеток(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ТипФайла = ПолучитьТипФайлаЭтикеток();
		
		Если ТипФайла = "PDF" Тогда
			
			Попытка
				
				МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
				
				Если МассивДокументов.Количество() > 0 Тогда
					
					Страница = 1;
					
					Для каждого Документ Из МассивДокументов Цикл
						
						ДокументPDF = Новый ДокументPDF;
						
						Поток = Документ.ОткрытьПотокДляЧтения();
						
						//@skip-check bsl-legacy-check-dynamic-feature-access
						ДокументPDF.Прочитать(Поток);
						
						ДокументPDF.Показать(СтрШаблон("Этикетки. Страница %1", Страница));
						
						Страница = Страница + 1;
						
					КонецЦикла;	
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось вывести этикетки на печать. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить();  
				
				//@skip-check undefined-function
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при выводе этикеток на печать", "Ошибка", 
				ОписаниеОшибки(), ТекущаяДатаСеанса(), Истина);
				
			КонецПопытки;
			
		ИначеЕсли ТипФайла = "PNG" Тогда
			
			Попытка
				
				
				МассивЭтикеток = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
				
				ТабДок = СформироватьПечатнуюФормуЭтикетки(МассивЭтикеток);
				
				КоллекцияПечатныхФорм =  УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки");    
				
				КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
				КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетки сборочных заданий";			
				ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Этикетки сборочных заданий");
				УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"Этикетки",ПараметрыВывода);	
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось вывести этикетки на печать. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить(); 
				
				//@skip-check undefined-function
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при выводе этикеток на печать", "Ошибка", 
				ОписаниеОшибки(), ТекущаяДатаСеанса(), Истина);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипФайлаЭтикеток()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON ИЛИ Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Возврат "PDF";	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries тогда
		
		Возврат "PNG";	
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция СформироватьПечатнуюФормуЭтикетки(МассивЭтикеток)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетки";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.рар_мп_РеестрЗаказов.рар_мп_Wildberries_Этикетки");
	
	
	ОбластьКартинки	= Макет.ПолучитьОбласть("Картинка");
	
	ПервыйДокумент = Истина;
	
	Для каждого Этикетка Из МассивЭтикеток Цикл
		
		Если ПервыйДокумент Тогда
			
			ПервыйДокумент = Ложь;	
			
		Иначе
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			
		КонецЕсли;
		
		ОбластьКартинки.Рисунки.Этикетка.Картинка = Новый Картинка(Этикетка);
		
		ТабличныйДокумент.Вывести(ОбластьКартинки);
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПечатьЭтикетки

&НаКлиенте
Процедура ЗаказыИзМаркетплейсаПечатьЭтикетки()
	
	Если Элементы.ЗаказыИзМаркетплейса.ТекущиеДанные <> Неопределено Тогда
		
		НомерЗаказа = Элементы.ЗаказыИзМаркетплейса.ТекущиеДанные.рар_мп_НомерЗаказа;
		
		ДлительнаяОперация     = ПолучениеЭтикетки(НомерЗаказа);
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение этикетки для заказа...";                                    
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПолученияЭтикети", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучениеЭтикетки(НомерЗаказа)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда 
		
		МассивНомеровЗаказов = Новый Массив; 
		МассивНомеровЗаказов.Добавить(НомерЗаказа);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Ozon_ПолучитьЭтикетки", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		МассивНомеровЗаказов = Новый Массив; 
		МассивНомеровЗаказов.Добавить(НомерЗаказа);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.ЯндексМаркет_ПолучитьЭтикеткиЗаказов", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда 
		
		МассивНомеровЗаказов = Новый Массив; 
		МассивНомеровЗаказов.Добавить(НомерЗаказа);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Wildberries_ПолучитьЭтикеткиЗаказов", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
		
	КонецЕсли; 
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияЭтикети(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ТипФайла = ПолучитьТипФайлаЭтикеток();
		
		Если ТипФайла = "PDF" Тогда
			
			Попытка
				
				МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
				
				Если МассивДокументов.Количество() > 0 Тогда
					
					Страница = 1;
					
					Для каждого Документ Из МассивДокументов Цикл
						
						ДокументPDF = Новый ДокументPDF;
						
						Поток = Документ.ОткрытьПотокДляЧтения();
						
						//@skip-check bsl-legacy-check-dynamic-feature-access
						ДокументPDF.Прочитать(Поток);
						
						ДокументPDF.Показать(СтрШаблон("Этикетки. Страница %1", Страница));
						
						Страница = Страница + 1;
						
					КонецЦикла;	
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось вывести этикетки на печать. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить(); 
				
				//@skip-check undefined-function
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при выводе этикеток на печать", "Ошибка", 
				ОписаниеОшибки(), ТекущаяДатаСеанса(), Истина);
				
			КонецПопытки;
			
			
		ИначеЕсли ТипФайла = "PNG" Тогда
			
			Попытка
				
				МассивЭтикеток = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
				
				Если МассивЭтикеток.Количество() <> 0 Тогда
					
					ТабДок = СформироватьПечатнуюФормуЭтикетки(МассивЭтикеток);
					
					КоллекцияПечатныхФорм =  УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки");    
					
					КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
					КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетка сборочного задания";			
					ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Этикетка сборочного задания");
					УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"Этикетки",ПараметрыВывода);	
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось вывести этикетки на печать. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить(); 
				
				//@skip-check use-non-recommended-method
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при выводе этикеток на печать", "Ошибка", 
				ОписаниеОшибки(), ТекущаяДата(), Истина);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область УдалениеЗаказаИзРеестра

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура УдалитьЗаказИзРеестра(Команда)
	
	Если НЕ(Объект.рар_мп_ЗапрещеноИзменятьСоставаРеестра) Тогда
		
		ВыбранныеСтроки = Объект.рар_мп_ЗаказыИзМаркетплейса.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбранныеСтроки.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбран ни один заказ на удаление";
			Сообщение.Сообщить();	
			
		Иначе
			
			Для каждого Строка Из ВыбранныеСтроки Цикл
				
				НомерЗаказ = Строка.рар_мп_НомерЗаказа;
				
				СтрокиДляУдаленияИзТоварыИзЗаказов = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказ));
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзТоварыИзЗаказов Цикл
					
					Объект.рар_мп_ТоварыИзЗаказов.Удалить(Объект.рар_мп_ТоварыИзЗаказов.Индекс(СтрокаДляУдаления));		
					
				КонецЦикла;
				
				СтрокиДляУдаленияИзПередачаНаКомиссию = Объект.рар_мп_ПередачаНаКомиссию.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказ));
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзПередачаНаКомиссию Цикл
					
					Объект.рар_мп_ПередачаНаКомиссию.Удалить(Объект.рар_мп_ПередачаНаКомиссию.Индекс(СтрокаДляУдаления));		
					
				КонецЦикла;
				
				СтрокиДляУдаленияИзРаспределенныеТовары = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказ));
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзРаспределенныеТовары Цикл
					
					Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(СтрокаДляУдаления));		
					
				КонецЦикла;
				
				СтрокиДляУдаленияИзКоробки = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказ));
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзКоробки Цикл
					
					Объект.рар_мп_Коробки.Удалить(Объект.рар_мп_Коробки.Индекс(СтрокаДляУдаления));		
					
				КонецЦикла;
				
				СтрокиДляУдаленияИзМаркируемыеТовары = Объект.рар_мп_МаркируемыеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказ));
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзМаркируемыеТовары Цикл
					
					Объект.рар_мп_МаркируемыеТовары.Удалить(Объект.рар_мп_МаркируемыеТовары.Индекс(СтрокаДляУдаления));		
					
				КонецЦикла;
				
				Объект.рар_мп_ЗаказыИзМаркетплейса.Удалить(Объект.рар_мп_ЗаказыИзМаркетплейса.Индекс(Строка));
				
				СтруктураНомерСклада = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Строка.рар_мп_Заказ, "рар_мп_УникальныйИдентификаторСклада");
				
				НомерСклада = СтруктураНомерСклада.рар_мп_УникальныйИдентификаторСклада;
				
				КоличествоСтрокСНомеромСклада = 0;
				
				Для каждого СтрокаТЧ Из Объект.рар_мп_ЗаказыИзМаркетплейса Цикл
					
					НомерСкладаИзТекущегоЗаказа = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СтрокаТЧ.рар_мп_Заказ, "рар_мп_УникальныйИдентификаторСклада");
					
					Если НомерСклада = НомерСкладаИзТекущегоЗаказа.рар_мп_УникальныйИдентификаторСклада Тогда
						
						КоличествоСтрокСНомеромСклада = КоличествоСтрокСНомеромСклада + 1;
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоСтрокСНомеромСклада = 0 Тогда
					
					СтрокиДляУдаленияИзКоличествоГрузовыхМест = Объект.рар_мп_КоличествоГрузовыхМест.НайтиСтроки(Новый Структура("рар_мп_ИдентификаторСклада", НомерСклада));
					
					Для каждого СтрокаДляУдаления Из СтрокиДляУдаленияИзКоличествоГрузовыхМест Цикл
						
						Объект.рар_мп_КоличествоГрузовыхМест.Удалить(Объект.рар_мп_КоличествоГрузовыхМест.Индекс(СтрокаДляУдаления));		
						
					КонецЦикла;		
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Удаление заказов завершено";
		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Удалить заказы из реестра на данном этапе не возвожно";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область СохранениеЭтикетки

&НаСервере
Процедура ЗаказыИзМаркетплейсаСкачатьЭтикетку(НомерЗаказа)
	
	Если Не ПустаяСтрока(Константы.рар_мп_МестоХраненияФайлов.Получить()) Тогда
		
		МассивНомеровЗаказов = Новый Массив;
		
		МассивНомеровЗаказов.Добавить(НомерЗаказа);
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда 
			
			Попытка
				
				МассивЭтикеток = рар_мп_ОбработкаЗаказов.Ozon_ПолучитьЭтикетки(Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
				
				Если МассивЭтикеток.Количество() > 0 Тогда
					
					МестоСохранения = Константы.рар_мп_МестоХраненияФайлов.Получить();
					
					Этикетка = МассивЭтикеток.Получить(0);
					
					Путь = МестоСохранения + СтрШаблон("\Этикетка_Заказ_%1.pdf", НомерЗаказа);
					
					Этикетка.Записать(Путь);
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Файл загружен в папку";
					Сообщение.Сообщить();
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сохранить этикетку. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить(); 
				
				ЗаписьЖурналаРегистрации("Ошибка при сохранении этикеток", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(), );
				
			КонецПопытки;
			
			
		ИначеЕсли  Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			
			Попытка
				
				МассивЭтикеток = рар_мп_ОбработкаЗаказов.ЯндексМаркет_ПолучитьЭтикеткиЗаказов(Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
				
				Если МассивЭтикеток.Количество() > 0 Тогда
					
					МестоСохранения = Константы.рар_мп_МестоХраненияФайлов.Получить();
					
					Этикетка = МассивЭтикеток.Получить(0);
					
					Путь = МестоСохранения + СтрШаблон("\Этикетка_Заказ_%1.pdf", НомерЗаказа);
					
					Этикетка.Записать(Путь);
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Файл загружен в папку";
					Сообщение.Сообщить();
					
				КонецЕсли;
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сохранить этикетку. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить();  
				
				ЗаписьЖурналаРегистрации("Ошибка при сохранении этикеток", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(), );
				
			КонецПопытки;
			
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Попытка
				
				МассивЭтикеток = рар_мп_ОбработкаЗаказов.Wildberries_ПолучитьЭтикеткиЗаказов(Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов);
				
				Если МассивЭтикеток.Количество() > 0 Тогда
					
					ДвоичныеДанные = МассивЭтикеток.Получить(0);
					
					МестоСохранения = Константы.рар_мп_МестоХраненияФайлов.Получить();
					
					Путь = МестоСохранения + СтрШаблон("\Этикетка_СборочноеЗадание_%1.png", НомерЗаказа); 
					
					ДвоичныеДанные.Записать(Путь);
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Файл загружен в папку";
					Сообщение.Сообщить();
					
				КонецЕсли;	
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сохранить этикетку. Описание ошибки в журнале регистрации";
				Сообщение.Сообщить();  
				
				ЗаписьЖурналаРегистрации("Ошибка при сохранении этикеток", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки(), );
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сохранить этикетку невозможно. Не указан путь до папки, в которую сохранять файлы";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПечатьЭтикеткиПоставки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПечатьЭтикеткиПоставки(Команда)
	Если ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
		
		ДвоичныеДанные = рар_мп_ОбработкаЗаказов.Wildberries_ПолучитьЭтикеткуПоставки(Объект.рар_мп_АккаунтМаркетплейса, 
		Объект.рар_мп_Wildberries_НомерПоставки); 
		
		Если ДвоичныеДанные <> "" Тогда
			
			МассивЭтикеток = Новый Массив;
			МассивЭтикеток.Добавить(ДвоичныеДанные);
			
			Попытка
				
				ТабДок = СформироватьПечатнуюФормуЭтикетки(МассивЭтикеток);
				
				КоллекцияПечатныхФорм =  УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки");    
				
				КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
				КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетка поставки";			
				ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Этикетка поставки");
				УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"Этикетки",ПараметрыВывода);	
				
			Исключение 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении этикетки поставки";
				Сообщение.Сообщить();
				
			КонецПопытки;
			
			
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед печатью этикетки для поставки необходимо создать поставку";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область ИзменениеСтатуса

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ИзменитьСтатусУЗаказов(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.рар_мп_ЗаказыИзМаркетплейса.Количество() <> 0 Тогда
			
			Если АккаунтИзЯндексМаркет() Тогда	
				
				ДлительнаяОперация     = ЯндексМаркет_ИзменитьСтатусУЗаказовНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Изменение статусов заказов...";                                    
				Оповещение = Новый ОписаниеОповещения("ЯндексМаркет_ЗавершениеИзмененияСтатусов", ЭтотОбъект);
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
				
			ИначеЕсли АккаунтИзOzon() Тогда
				
				ДлительнаяОперация     = Ozon_ИзменитьСтатусУЗаказовНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Изменение статусов заказов...";                                    
				Оповещение = Новый ОписаниеОповещения("Ozon_ЗавершениеИзмененияСтатусов", ЭтотОбъект);
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);		
				
			КонецЕсли;		
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Изменить статусы нельзя. Не загружены заказы";
			Сообщение.Сообщить();	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЯндексМаркет_ИзменитьСтатусУЗаказовНаСервере()
	
	ЗаказыИзМаркетплейса = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить();
	
	Статус = ЯндексМаркет_ПолучитьИмяПеречисления(Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов.PROCESSING);
	
	Подстатус = ЯндексМаркет_ПолучитьИмяПеречисления(Перечисления.рар_мп_ЯндексМаркет_ПодстатусыЗаказов.READY_TO_SHIP);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.ЯндексМаркет_ИзменениеСтатуса", 
	Объект.рар_мп_АккаунтМаркетплейса, ЗаказыИзМаркетплейса, Статус, Подстатус); 
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаСервере
Функция ЯндексМаркет_ПолучитьИмяПеречисления(ЗначениеПеречисления)
	
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
	Возврат ИмяЗначенияПеречисления; 
	
КонецФункции

&НаСервере
Функция Ozon_ИзменитьСтатусУЗаказовНаСервере()
	
	ЗаказыИзМаркетплейса = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить();
	
	РаспределенныеТовары = Объект.рар_мп_РаспределенныеТовары.Выгрузить();
	
	МаркируемыеТовары = Объект.рар_мп_МаркируемыеТовары.Выгрузить();
	
	Коробки = Объект.рар_мп_Коробки.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Ozon_СобратьЗаказ", 
	Объект.рар_мп_АккаунтМаркетплейса, РаспределенныеТовары, ЗаказыИзМаркетплейса, МаркируемыеТовары, Коробки); 
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура Ozon_ЗавершениеИзмененияСтатусов(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		СтатусИзмененияСтатусов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если СтатусИзмененияСтатусов Тогда
			
			Для каждого Заказ Из Объект.рар_мп_ЗаказыИзМаркетплейса Цикл
				
				Заказ.рар_мп_СтатусЗаказа = ПолучитьСтатусЗаказа_awaiting_deliver();
				
			КонецЦикла;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Статусы изменены";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусЗаказа_awaiting_deliver()
	
	Возврат Перечисления.рар_мп_Ozon_СтатусыЗаказов.awaiting_deliver;	
	
КонецФункции

&НаКлиенте
Процедура ЯндексМаркет_ЗавершениеИзмененияСтатусов(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		СтатусИзмененияСтатусов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если СтатусИзмененияСтатусов Тогда
			
			Для каждого Заказ Из Объект.рар_мп_ЗаказыИзМаркетплейса Цикл
				
				Заказ.рар_мп_СтатусЗаказа		   = ПолучитьСтатусЗаказа_PROCESSING();
				Заказ.рар_мп_СтатусОбработкиЗаказа = ПолучитьПодстатусЗаказа_READY_TO_SHIP();
				
			КонецЦикла;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Статусы изменены";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусЗаказа_PROCESSING()
	
	Возврат Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов.PROCESSING;	
	
КонецФункции 

&НаСервере
Функция ПолучитьПодстатусЗаказа_READY_TO_SHIP()
	
	Возврат Перечисления.рар_мп_ЯндексМаркет_ПодстатусыЗаказов.READY_TO_SHIP;	
	
КонецФункции

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПечатьСтикеровДляКоробов

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПечатьСтикеровДляКоробов(Команда)
	
	Если Объект.рар_мп_Коробки.Количество() > 0 Тогда
		
		ДлительнаяОперация     = ПечатьСтикеровДляКоробовНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение стикеров для коробок...";                                    
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПолученияСтикеровДляКоробов", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя распечатать этикетки для коробок, так как коробки не созданы";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьСтикеровДляКоробовНаСервере()
	
	НомерПоставки = Объект.рар_мп_Wildberries_НомерПоставки;
	
	Коробки = Объект.рар_мп_Коробки.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Wildberries_ПолучитьСтикерыКоробовПоставки", 
	Объект.рар_мп_АккаунтМаркетплейса, НомерПоставки, Коробки);
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПолученияСтикеровДляКоробов(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		Попытка
			
			МассивЭтикеток = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			ТабДок = СформироватьПечатнуюФормуЭтикетки(МассивЭтикеток);
			
			КоллекцияПечатныхФорм =  УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки");    
			
			КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
			КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетки коробок";			
			ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Этикетки коробок");
			УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"Этикетки",ПараметрыВывода);	
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось вывести этикетки на печать. Описание ошибки в журнале регистрации";
			Сообщение.Сообщить();  
			
			//@skip-check undefined-function
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при выводе этикеток на печать", "Ошибка", 
			ОписаниеОшибки(), ТекущаяДатаСеанса(), Истина);
			
		КонецПопытки;
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ФормированиеЛистаПодбора

&НаКлиенте
Процедура ЗавершениеФормированияЛистаПодбора(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Попытка
			
			МассивЭтикеток = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если МассивЭтикеток.Количество() = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при формировании листа подбора. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
			Иначе
				
				ТабДок = ЗавершениеФормированияЛистаПодбораНаСервере(МассивЭтикеток);
				
				КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("рар_мп_Wildberries_ЛистПодбора");    
				
				КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
				КоллекцияПечатныхФорм[0].СинонимМакета = "Лист подбора Wildberries"; 
				
				ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Лист подбора Wildberries");
				УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"рар_мп_Wildberries_ЛистПодбора",ПараметрыВывода);	
				
			КонецЕсли;		
			
		Исключение 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при формировании листа подбора. Подробное описание в журнале регистрации";
			Сообщение.Сообщить();
			
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при формировании листа подбора", "Ошибка", ОписаниеОшибки(),,Истина); 
			
		КонецПопытки;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗавершениеФормированияЛистаПодбораНаСервере(МассивЭтикеток)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДанныеЭтикетокИЗаказов";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.рар_мп_РеестрЗаказов.рар_мп_Wildberries_ЛистПодбора");
	
	ОбластьЗаголовок	    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьТЧДляПФШапка	    = Макет.ПолучитьОбласть("ТЧДляПФШапка");
	ОбластьТЧДляПФ   	    = Макет.ПолучитьОбласть("ТЧДляПФ");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьТЧДляПФШапка);
	
	Счетчик = 0;
	
	Для каждого Элемент Из МассивЭтикеток Цикл
		
		НомерЗаказа = Элемент.НомерЗаказа;
		
		НужныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("рар_мп_НомерЗаказа", НомерЗаказа));
		
		Для каждого Строка Из НужныеСтроки Цикл
			
			Счетчик = Счетчик + 1;
			
			ОбластьТЧДляПФ.Параметры.НомерСтроки = Счетчик;
			
			ОбластьТЧДляПФ.Параметры.НомерСборочногоЗадания = НомерЗаказа;
			
			ОбластьТЧДляПФ.Параметры.Номенклатура = Строка.рар_мп_Номенклатура;
			
			ОбластьТЧДляПФ.Параметры.Характеристика = Строка.рар_мп_Характеристика;
			
			ОбластьТЧДляПФ.Параметры.Артикул = Строка.рар_мп_Артикул;
			
			ОбластьТЧДляПФ.Параметры.СерияЭтикетки = Элемент.partA;
			
			ОбластьТЧДляПФ.Параметры.НомерЭтикетки = Элемент.partB;
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьТЧДляПФ) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьТЧДляПФШапка);
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьТЧДляПФ);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеФормированияЛистаПодбора_Ozon(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Попытка
			
			МассивОтправлений = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если МассивОтправлений.Количество() = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при формировании листа подбора. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
			Иначе
				
				ТабДок = ЗавершениеФормированияЛистаПодбораНаСервере_Ozon(МассивОтправлений);
				
				КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("рар_мп_Ozon_ЛистПодбора");    
				
				КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
				КоллекцияПечатныхФорм[0].СинонимМакета = "Лист подбора Ozon"; 
				
				ПараметрыВывода = Новый Структура("ЗаголовокФормы", "Лист подбора Ozon");
				УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,"рар_мп_Ozon_ЛистПодбора",ПараметрыВывода);	
				
			КонецЕсли;		
			
		Исключение 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при формировании листа подбора. Подробное описание в журнале регистрации";
			Сообщение.Сообщить();
			
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при формировании листа подбора", "Ошибка", ОписаниеОшибки(),,Истина); 
			
		КонецПопытки;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗавершениеФормированияЛистаПодбораНаСервере_Ozon(МассивОтправлений)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДанныеЭтикетокИЗаказов";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.рар_мп_РеестрЗаказов.рар_мп_Ozon_ЛистПодбора");
	
	ОбластьЗаголовок	    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьТЧДляПФШапка	    = Макет.ПолучитьОбласть("ТЧДляПФШапка");
	ОбластьТЧДляПФ   	    = Макет.ПолучитьОбласть("ТЧДляПФ");
	
	ОбластьЗаголовок.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");     
	ОбластьЗаголовок.Параметры.КоличествоОтправлений = МассивОтправлений.Количество();
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьТЧДляПФШапка);  
	
	НомерСтроки = 1;
	
	Для каждого Отправление Из МассивОтправлений Цикл
		
		Для каждого Товар Из Отправление.products Цикл
		
			ОбластьТЧДляПФ.Параметры.НомерСтроки      = НомерСтроки;
			ОбластьТЧДляПФ.Параметры.НомерОтправления = Отправление.posting_number;
			ОбластьТЧДляПФ.Параметры.Номенклатура     = Товар.name;
			ОбластьТЧДляПФ.Параметры.Артикул          = Товар.offer_id;
			ОбластьТЧДляПФ.Параметры.Количество       = Товар.quantity;

			
		    НомерСтроки = НомерСтроки + 1;   
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьТЧДляПФ) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьТЧДляПФШапка);
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьТЧДляПФ);
			
		КонецЦикла;
	КонецЦикла;
	
		
		
	Возврат ТабличныйДокумент;	
	
КонецФункции

&НаСервере
Функция СформироватьЛистПодбораНаСервере()
	
	Заказы = Объект.рар_мп_ЗаказыИзМаркетплейса.Выгрузить(,"рар_мп_НомерЗаказа");
	
	МассивНомеровЗаказов = Заказы.ВыгрузитьКолонку("рар_мп_НомерЗаказа");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);     
	
	Если АккаунтИзOzon() Тогда
	
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Ozon_СформироватьЛистПодбора", 
		Объект.рар_мп_АккаунтМаркетплейса, Объект.рар_мп_Wildberries_НомерПоставки); 
		
	ИначеЕсли АккаунтИзWildberries() Тогда
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Wildberries_СформироватьЛистПодбора", 
		Объект.рар_мп_АккаунтМаркетплейса, МассивНомеровЗаказов); 
	
	КонецЕсли;
		
	Возврат ВозвратныеДанные;
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СформироватьЛистПодбора(Команда)
	
	Если ПроверитьЗаполнение() Тогда     
		
		Если АккаунтИзOzon() Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Лист подбора сформировать нельзя. Не создана поставка";
				Сообщение.Сообщить();
				
			Иначе
				
				ДлительнаяОперация     = СформироватьЛистПодбораНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Формирование листа подбора...";     
				
				Оповещение = Новый ОписаниеОповещения("ЗавершениеФормированияЛистаПодбора_Ozon", ЭтотОбъект);
				
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
			
			КонецЕсли;
			
			
		ИначеЕсли АккаунтИзWildberries() Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Лист подбора сформировать нельзя. Не создана поставка";
				Сообщение.Сообщить(); 	
				
			ИначеЕсли Объект.рар_мп_РаспределенныеТовары.Количество() = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Лист подбора сформировать нельзя. Не создана поставка";
				Сообщение.Сообщить();
					
			Иначе
				
				ДлительнаяОперация     = СформироватьЛистПодбораНаСервере();
				ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьСообщения = Истина;
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
				ПараметрыОжидания.ТекстСообщения = "Формирование листа подбора...";     
				
				Оповещение = Новый ОписаниеОповещения("ЗавершениеФормированияЛистаПодбора", ЭтотОбъект);
				
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);			   
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       

//@skip-check module-structure-top-region
#Область ФормированиеЛистаОтгрузки
&НаСервере
Функция СформироватьЛистОтгрузкиНаСервере()                   
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);     

	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ОбработкаЗаказов.Ozon_СформироватьЛистОтгрузки", 
		Объект.рар_мп_АккаунтМаркетплейса, Объект.рар_мп_Wildberries_НомерПоставки); 
		
	Возврат ВозвратныеДанные;
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СформироватьЛистОтгрузкиOzon(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Лист отгрузки сформировать нельзя. Не создана поставка";
			Сообщение.Сообщить();    
		Иначе	
			
			ДлительнаяОперация     = СформироватьЛистОтгрузкиНаСервере();
			ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьСообщения = Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ПараметрыОжидания.ТекстСообщения = "Формирование листа отгрузки...";     
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеФормированияЛистаОтгрузки", ЭтотОбъект);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	
КонецПроцедуры         

&НаКлиенте
Процедура ЗавершениеФормированияЛистаОтгрузки(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Возврат;	
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Попытка
			
			Путь = "";
			
			Отчет = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			//@skip-check undefined-function
			//@skip-check missing-temporary-file-deletion
			Путь = ПолучитьИмяВременногоФайла("pdf");
			
			Отчет.Записать(Путь);
			
			PDF = Новый ДокументPDF;
			
			PDF.ПрочитатьАсинх(Путь);
			
			PDF.Показать(, "Лист отгрузки");
			
			//ДанныеЛистаПодбора = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			//
			//Если ДанныеЛистаПодбора <> "" Тогда     
			//	
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = ДанныеЛистаПодбора.Сообщение;
			//	Сообщение.Сообщить();
			//	
			//	
			//Иначе
			//	
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = "Ошибка при формировании листа отгрузки. Подробное описание ошибки можно посмотреть в журнале регистрации";
			//	Сообщение.Сообщить();
			//	
			//КонецЕсли;		
			
		Исключение 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при формировании листа отгрузки. Подробное описание в журнале регистрации";
			Сообщение.Сообщить();
			
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при формировании листа отгрузки", "Ошибка", ОписаниеОшибки(),,Истина); 
			
		КонецПопытки;
		
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда 
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПолучениеШтрихкодаОтгрузки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПолучитьШтрихкодОтгрузки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.рар_мп_Wildberries_НомерПоставки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер поставки для получения штрихкода отгрузки";
		Сообщение.Сообщить();
	Иначе	
		ПолучитьШтрихкод();
	КонецЕсли;
	
КонецПроцедуры 

//@skip-check module-unused-method
&НаСервере
Функция ПолучитьКонстантуМестаХраненияФайлов()
	Возврат Константы.рар_мп_МестоХраненияФайлов.Получить();
КонецФункции

&НаСервере
Процедура ПолучитьШтрихкод()
	
	ОтветныеДанные = рар_мп_Ozon_Методы.Метод_ШтрихкодДляОтгрузкиОтправления(Объект.рар_мп_АккаунтМаркетплейса, Объект.рар_мп_Wildberries_НомерПоставки);
	
	Если ОтветныеДанные.КодСостояния <> 200 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при получении штрихкода (код ошибки: %1)", 
										ОтветныеДанные.КодСостояния);
		Сообщение.Сообщить();
		
		//@skip-check reading-attribute-from-database
		ЗаписьЖурналаРегистрации("Ошибка при получении штрихкода. Реестр заказов Ozon", 
									УровеньЖурналаРегистрации.Ошибка,,,
									СтрШаблон("Аккаунт: %1. Код ошибки: %2", Объект.рар_мп_АккаунтМаркетплейса.Наименование, ОтветныеДанные.КодСостояния));
		
	Иначе
		
		//Выводим на форму
		Штрихкод = ПоместитьВоВременноеХранилище(ОтветныеДанные.ОтветКакДвоичныеДанные, УникальныйИдентификатор);
		
		//Сохранение в место для хранения файлов (записано в константе)
		//МестоХранения = ПолучитьКонстантуМестаХраненияФайлов();
		//
		//Ответ.ПолучитьТелоКакДвоичныеДанные().Записать(СтрШаблон("%1\ШтрихкодОтгрузки_%2.png", МестоХранения, Объект.рар_мп_Wildberries_НомерПоставки));
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти