#Область ПрочиеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	АккаунтМаркетплейса = Неопределено;
	Параметры.Свойство("АккаунтМаркетплейса", АккаунтМаркетплейса);
	Список.Параметры.УстановитьЗначениеПараметра("АккаунтМаркетплейса", АккаунтМаркетплейса);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Структура = Новый Структура("Склад", Элемент.ТекущиеДанные.СкладСсылка);
	Оповестить("ПередачаПараметраСклад", Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		МассивДанных = Новый Массив;
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		
		Для Каждого ТекВыд Из ВыделенныеСтроки Цикл
			
			Элементы.Список.ТекущаяСтрока = ТекВыд;
			
			Структура = Новый Структура;
			Структура.Вставить("Наименование",	Элементы.Список.ТекущиеДанные.Наименование);
			Структура.Вставить("Ссылка", 		ТекВыд);
			Структура.Вставить("campaignId", 	Элементы.Список.ТекущиеДанные.рар_мп_ЯМ_campaignId);
			
			МассивДанных.Добавить(Структура);
			
		КонецЦикла;
		
		ОповеститьОВыборе(МассивДанных);
		
	Иначе
		
		Структура = Новый Структура("Склад, campaignId", Значение, Элемент.ТекущиеДанные.рар_мп_ЯМ_campaignId);
		ОповеститьОВыборе(Структура);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти