
#Область ЯндексМаркет

Функция ПолучитьКоличествоТоваров_ЯндексМаркет(Аккаунт, campaignId, ТипЗагрузки, ПутьКФайлуОстатков, МассивНомеровКолонок, НачальнаяСтрока) Экспорт
	
	МассивОтчетов = ПолучитьОтчет_ЯндексМаркет(Аккаунт, campaignId);
	
	ПутьОтчетПоОстаткамНаСкладах = ПолучитьПутьКОтчету_ЯндексМаркет(МассивОтчетов);
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 			Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("SKU", 					Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара КАК SKUТовара,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	Если ТипЗагрузки = "API" Тогда
		
		ПолучитьДанныеИзОтчетаПоОстаткамНаСкладах_ЯндексМаркет(Аккаунт, ПутьОтчетПоОстаткамНаСкладах, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
		
	ИначеЕсли ТипЗагрузки = "Excel" Тогда
		
		ПолучитьОстаткиИзExcel_ЯндексМаркет(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, ВыборкаСопоставленныхТоваров, МассивНомеровКолонок, НачальнаяСтрока);
		
	КонецЕсли;
	
	Возврат ТабЗначДанных;
	
КонецФункции

Функция ПолучитьОтчет_ЯндексМаркет(Аккаунт, campaignId)
	
	МассивФайлов = Новый Массив;
	
	HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьОтчетПоОстаткамНаСкладах(Аккаунт, campaignId);
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
			
			ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
										Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			МассивФайлов.Очистить();
			
			Возврат МассивФайлов;
			
		Иначе
			
			Если HTTPОтвет.ОтветAPI.status = "OK" Тогда
				
				Если HTTPОтвет.ОтветAPI.result.Свойство("reportId") Тогда
					
					НомерОтчета = HTTPОтвет.ОтветAPI.result.reportId;
					
					Статус = "";
					
					Пока Статус <> "DONE" И Статус <> "FAILED" Цикл
						
						HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьГотовыйОтчет(Аккаунт, НомерОтчета);
						
						КодЗапроса = HTTPОтвет.КодСостояния;
						
						Если HTTPОтвет.Свойство("ОтветAPI") Тогда
							
							Если КодЗапроса <> 200 Тогда
								
								НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
								
								ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
								
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
								Сообщение.Сообщить();
								
								Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
															Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
								
								ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
								
								МассивФайлов.Очистить();
								
								Возврат МассивФайлов;
								
							Иначе
								
								Статус = HTTPОтвет.ОтветAPI.result.status;	
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
							
							ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
														Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							МассивФайлов.Очистить();
							
							Возврат МассивФайлов;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если Статус = "DONE" Тогда
						
						Если Не HTTPОтвет.ОтветAPI.result.Свойство("subStatus") Тогда
							
							СсылкаНаФайл = HTTPОтвет.ОтветAPI.result.file;
							
							СсылкаНаСоединение = "market-mbi-prod.s3-private.mds.yandex.net";
							
							СсылкаНаФайл = СтрЗаменить(СсылкаНаФайл, "https://" + СсылкаНаСоединение + "/", "");
							
							Соединение = Новый HTTPСоединение(СсылкаНаСоединение, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
							Запрос = Новый HTTPЗапрос(СсылкаНаФайл);
							Ответ = Соединение.Получить(Запрос);
							ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
							
							МассивФайлов.Добавить(ДвоичныеДанные);
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
							
							ОписаниеОшибки = СтрШаблон("Подстатус генерации отчета: %1", HTTPОтвет.ОтветAPI.result.subStatus);	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
							Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							МассивФайлов.Очистить();
							
							Возврат МассивФайлов;
							
						КонецЕсли;
						
					Иначе
						
						НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
						
						ОписаниеОшибки = "Статус получения отчета по остаткам на складах 'FAILED'";	
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
													Символы.ПС, Аккаунт, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						МассивФайлов.Очистить();
						
						Возврат МассивФайлов;
						
					КонецЕсли;
					
				Иначе
					
					НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
					
					ОписаниеОшибки = ОписаниеОшибки();	
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
												Символы.ПС, Аккаунт, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивФайлов.Очистить();
					
					Возврат МассивФайлов;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
				
				ОписаниеОшибки = "При обработке запроса произошла ошибка";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				МассивФайлов.Очистить();
				
				Возврат МассивФайлов;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении отчета по остаткам на складах в Яндекс Маркет";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении отчета по остаткам на складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		МассивФайлов.Очистить();
		
		Возврат МассивФайлов;
		
	КонецЕсли;
	
	Возврат МассивФайлов;
	
КонецФункции

Функция ПолучитьПутьКОтчету_ЯндексМаркет(МассивОтчетов)
	
	Отчет = МассивОтчетов.Получить(0);
	
	Путь = ПолучитьИмяВременногоФайла("xlsx");
	
	Отчет.Записать(Путь);
	
	Возврат Путь;
	
КонецФункции

Функция ПолучитьДанныеИзОтчетаПоОстаткамНаСкладах_ЯндексМаркет(Аккаунт, ПутьКФайлу, ТабЗначДанных, СопоставленныеТовары)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение                                                       
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать отчет по реализации. Подробное описание можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при чтении данных из отчета по реализации. Отчет комиссионера Яндекс Маркет", 
									УровеньЖурналаРегистрации.Ошибка,,,
									СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
		
	КонецПопытки;
	
	ОбластьСписокТоваров = ТабДок.ПолучитьОбласть("Список_товаров");
	
	НачальнаяСтрока = 4;
	
	КоличествоСтрок = ОбластьСписокТоваров.ВысотаТаблицы;
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		Попытка
			
			НоваяСтрока = ТабЗначДанных.Добавить();
			НоваяСтрока.НомерСтроки 	= ТабЗначДанных.Количество();
			НоваяСтрока.SKU				= ОбластьСписокТоваров.Область(НомерСтроки, 3).Текст;
			
			НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", НоваяСтрока.SKU));
			
			Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
				НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
				НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с sku: %1 в сопоставленных товарах (строка №%2)", НоваяСтрока.SKU, НоваяСтрока.НомерСтроки);
				Сообщение.Сообщить();
			КонецЕсли;
			
			НоваяСтрока.Количество = ОбластьСписокТоваров.Область(НомерСтроки, 5).Текст;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с sku: %1", ОбластьСписокТоваров.Область(НомерСтроки, 3).Текст);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Ввод первоначальных остатков Яндекс Маркет", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

Процедура ПолучитьОстаткиИзExcel_ЯндексМаркет(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, СопоставленныеТовары, МассивНомеровКолонок, НачальнаяСтрока)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлуОстатков);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл. Подробное описание в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при чтении Excel файла. Загрузка первоначальных остатков Яндекс Маркет", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	КонецПопытки;
									
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	НомерКолонкиSKUТовара 	= МассивНомеровКолонок[0];
	НомерКолонкиКоличество 	= МассивНомеровКолонок[1];
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		Попытка
			
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст) Тогда
				
				НоваяСтрока = ТабЗначДанных.Добавить();
				НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
				НоваяСтрока.SKU			= ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст;
				
				НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", НоваяСтрока.SKU));
				
				Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
					НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
					НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с SKU: %1 в сопоставленных товарах (строка №%2)", НоваяСтрока.SKU, НоваяСтрока.НомерСтроки);
					Сообщение.Сообщить();
				КонецЕсли;
				
				НоваяСтрока.Количество = ТабДок.Область(НомерСтроки, НомерКолонкиКоличество).Текст;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с SKU: %1", ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков Яндекс Маркет", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Ozon

Функция ПолучитьКоличествоТоваров_Ozon(Аккаунт, Склад, ТипЗагрузки, ПутьКФайлуОстатков, МассивНомеровКолонок, НачальнаяСтрока) Экспорт
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 			Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("SKU", 					Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("IDТовара", 				Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул,
	|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
	|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
	|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	рар_мп_Ozon_СопоставленныеТовары.SKUТовара КАК SKUТовара
	|ИЗ
	|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
	|ГДЕ
	|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт"; 
		
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	Если ТипЗагрузки = "API" Тогда
		
		МассивНоменклатуры = ТабЗначВМассив(ВыборкаСопоставленныхТоваров); 
				
		Если Аккаунт.СхемаРаботы = Перечисления.рар_мп_СхемыРаботы.FBO Тогда
			
			ОтветныеДанные = рар_мп_Ozon_Методы.Метод_ОтчетПоОстаткамИТоварамFBO(Аккаунт); 
			
			Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
				
				Если ОтветныеДанные.КодСостояния <> 200 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении данных. Ошибка: %1 (код ошибки: %2). Подробное описание можно посмотреть в журнале регистрации", 
													ОтветныеДанные.Заголовки, ОтветныеДанные.КодСостояния);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков Ozon", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОтветныеДанные.ОтветAPI.message));
					
				Иначе
					
					Если ОтветныеДанные.ОтветAPI.Количество() <> 0 Тогда
						
						ПолучениеДанныхИзОтчетаОбОстатках_FBO_Ozon(Аккаунт, ОтветныеДанные, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении данных в Ozon";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
			КонецЕсли;
			
		ИначеЕсли Аккаунт.СхемаРаботы = Перечисления.рар_мп_СхемыРаботы.FBS Тогда  
			
			ОтветныеДанные = ПолучитьОтчетОбОстаткахFBS_Ozon(Аккаунт, МассивНоменклатуры);
			
			Если ОтветныеДанные <> Null Тогда
				
				Если ОтветныеДанные.Количество() <> 0 Тогда
					
					ПолучениеДанныхИзОтчетаОбОстатках_FBS_Ozon(Аккаунт, ОтветныеДанные, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗагрузки = "Excel" Тогда
		
		ПолучитьОстаткиИзExcel_Ozon(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, ВыборкаСопоставленныхТоваров, МассивНомеровКолонок, НачальнаяСтрока);
		
	КонецЕсли;
		
	Возврат ТабЗначДанных;
		
КонецФункции  

Функция ПолучитьОтчетОбОстаткахFBS_Ozon(Аккаунт, МассивНоменклатуры)
	
	Если МассивНоменклатуры.Количество() <= 500 Тогда           
		
		ОтветныеДанные = рар_мп_Ozon_Методы.Метод_ИнформацияОбОстаткахНаСкладахПродавца_FBS_rFBS(Аккаунт, МассивНоменклатуры);
		
		Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
			
			Если ОтветныеДанные.КодСостояния <> 200 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при получении данных. Ошибка: %1 (код ошибки: %2). Подробное описание можно посмотреть в журнале регистрации", 
												ОтветныеДанные.Заголовки, ОтветныеДанные.КодСостояния);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков Ozon", 
											УровеньЖурналаРегистрации.Ошибка,,,
											СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОтветныеДанные.ОтветAPI.message));
				
				Возврат Null;
			Иначе
				
				Возврат ОтветныеДанные.ОтветAPI;
				
			КонецЕсли;
			
		Иначе
			
			НазваниеОшибки = "Ошибка при получении данных в Ozon";
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Описание ошибки: %3", 
										Символы.ПС, Аккаунт, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
		КонецЕсли;
		
	Иначе
		
		КоличествоЗапросов = 0;
		
		ИтоговыйОтвет = Новый Структура;
		
		ВсегоСтрок = МассивНоменклатуры.Количество();
		
		РазмерПакета = 500;
		
		КоличествоИтераций = Цел(ВсегоСТрок/РазмерПакета);
		Если ВсегоСтрок % РазмерПакета > 0 Тогда
			КоличествоИтераций = КоличествоИтераций + 1;
		КонецЕсли;
		
		Для НомерИтерации = 0 По КоличествоИтераций - 1 Цикл
			
			НачальныйИндекс = НомерИтерации * РазмерПакета;
			КонечныйИндекс = Мин(НачальныйИндекс + РазмерПакета - 1, ВсегоСтрок - 1);
			
			ВременнаяТаблица = Новый ТаблицаЗначений;
			ВременнаяТаблица.Колонки.Добавить("SKUТовара");
			
			Для Индекс = НачальныйИндекс По КонечныйИндекс Цикл
				Если ЗначениеЗаполнено(МассивНоменклатуры[Индекс].SKUТовара) Тогда	
					НоваяСтрока = ВременнаяТаблица.Добавить();
					НоваяСтрока.SKUТовара = МассивНоменклатуры[Индекс].SKUТовара; 
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			ОтветныеДанные = рар_мп_Ozon_Методы.Метод_ИнформацияОбОстаткахНаСкладахПродавца_FBS_rFBS(Аккаунт, ВременнаяТаблица);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
				
				Если ОтветныеДанные.КодСостояния <> 200 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении данных. Ошибка: %1 (код ошибки: %2). Подробное описание можно посмотреть в журнале регистрации", 
													ОтветныеДанные.Заголовки, ОтветныеДанные.КодСостояния);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков Ozon", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОтветныеДанные.ОтветAPI.message));
					
				Иначе
					
					Для Каждого КлючЗначение Из ОтветныеДанные.ОтветAPI Цикл
						ИтоговыйОтвет.Вставить(КлючЗначение.Ключ + Строка(НомерИтерации), КлючЗначение.Значение);
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении данных в Ozon";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ИтоговыйОтвет;
		
	КонецЕсли;
	
КонецФункции
	
Функция ПолучениеДанныхИзОтчетаОбОстатках_FBO_Ozon(Аккаунт, Данные, ТабЗначДанных, СопоставленныеТовары)
	
	Для Каждого Строка Из Данные.ОтветAPI.result.rows Цикл
		
		Количество = Строка.free_to_sell_amount;
		
		Если Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НоваяСтрока = ТабЗначДанных.Добавить();
			НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
			НоваяСтрока.SKU			= Строка.sku;
			НоваяСтрока.IDТовара	= Строка.item_code;
			
			Если ЗначениеЗаполнено(Строка.Sku) Тогда
				
				НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", Строка(Строка.sku)));
				
				Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
					НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
					НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с sku: %1 в сопоставленных товарах (строка №%2)", Строка.sku, НоваяСтрока.НомерСтроки);
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Количество;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с sku: %1", Строка.sku);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков Ozon", 
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки; 
		
	КонецЦикла;
	
КонецФункции
	
Функция ПолучениеДанныхИзОтчетаОбОстатках_FBS_Ozon(Аккаунт, Данные, ТабЗначДанных, СопоставленныеТовары)
	
	Для Каждого Пакет Из Данные Цикл
		
		Для Каждого Строка Из Пакет.Значение Цикл
			
			Если Строка.present <> 0 Тогда
				
				Попытка
					
					НоваяСтрока = ТабЗначДанных.Добавить();
					НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
					НоваяСтрока.SKU			= Строка.sku;
					НоваяСтрока.IDТовара	= Строка.product_id;
					
					Если ЗначениеЗаполнено(Строка.sku) Тогда
						
						НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", Строка(Строка.sku)));
						
						Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
							НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
							НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
							НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
						Иначе
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с sku: %1 в сопоставленных товарах (строка №%2)", Строка.sku, НоваяСтрока.НомерСтроки);
							Сообщение.Сообщить();
						КонецЕсли;
						
						
					КонецЕсли;
					
					НоваяСтрока.Количество = Строка.present;
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с sku: %1", Строка.sku);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков Ozon", 
					УровеньЖурналаРегистрации.Ошибка,,,
					СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция ТабЗначВМассив(ТаблицаЗначений) Экспорт
	
    ПреобразованныйМассив = Новый Массив; 
	
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл 
		
        НоваяСтруктура = Новый Структура;
        Счетчик 	   = 0;  
		
		Для Каждого СтрокаСтруктуры из СтрокаТаблицы Цикл 
			
			Если НЕ ТипЗнч(СтрокаСтруктуры) = Тип(ТаблицаЗначений) тогда 
				
                НоваяСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,СтрокаТаблицы[Счетчик]);
				
			Иначе
				
                НоваяСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,ТабЗначВМассив(СтрокаСтруктуры)); 
				
			КонецЕсли;  
			
            Счетчик = Счетчик + 1; 
			
		КонецЦикла;   
		
        ПреобразованныйМассив.Добавить(НоваяСтруктура); 
		
	КонецЦикла;     
	
    Возврат(ПреобразованныйМассив);  
	
КонецФункции

Процедура ПолучитьОстаткиИзExcel_Ozon(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, СопоставленныеТовары, МассивНомеровКолонок, НачальнаяСтрока)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлуОстатков);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл. Подробное описание в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при чтении Excel файла. Загрузка первоначальных остатков Ozon", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	КонецПопытки;
									
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	НомерКолонкиIDТовара	= МассивНомеровКолонок[0];
	НомерКолонкиSKUТовара 	= МассивНомеровКолонок[1];
	НомерКолонкиКоличество 	= МассивНомеровКолонок[2];
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		Попытка
			
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст) Тогда
				
				НоваяСтрока = ТабЗначДанных.Добавить();
				НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
				НоваяСтрока.SKU			= ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст;
				НоваяСтрока.IDТовара	= ТабДок.Область(НомерСтроки, НомерКолонкиIDТовара).Текст;
				
				НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", НоваяСтрока.SKU));
				
				Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
					НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
					НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с SKU: %1 в сопоставленных товарах (строка №%2)", НоваяСтрока.SKU, НоваяСтрока.НомерСтроки);
					Сообщение.Сообщить();
				КонецЕсли;
				
				НоваяСтрока.Количество = ТабДок.Область(НомерСтроки, НомерКолонкиКоличество).Текст;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с SKU: %1", ТабДок.Область(НомерСтроки, НомерКолонкиSKUТовара).Текст);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков Ozon", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Wildberries

Функция ПолучитьКоличествоТоваров_Wildberries(Аккаунт, Склад, ТипЗагрузки, ПутьКФайлуОстатков, МассивНомеровКолонок, НачальнаяСтрока) Экспорт
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 			Новый ОписаниеТипов("Число")); 
	ТабЗначДанных.Колонки.Добавить("Баракод", 				Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	Если ТипЗагрузки = "API" Тогда
		
		Если Аккаунт.СхемаРаботы = Перечисления.рар_мп_СхемыРаботы.FBO Тогда
			
			ОтветныеДанные = ПолучитьОтчетОбОстаткахFBO_Wildberries(Аккаунт);
			
			ПолучениеДанныхИзОтчетаОбОстаткахFBO_Wildberries(Аккаунт, ОтветныеДанные, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада
			|ИЗ
			|	РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
			|ГДЕ
			|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса = &АккаунтМаркетплейса
			|	И рар_мп_СопоставленныеСклады.Склад = &Склад";
			
			Запрос.УстановитьПараметр("АккаунтМаркетплейса", Аккаунт);
			Запрос.УстановитьПараметр("Склад", Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ИдентификаторСклада = Выборка.УникальныйИдентификаторСклада;
			КонецЦикла;
			
			ОтветныеДанные = ПолучитьОтчетОбОстаткахFBS_Wildberries(Аккаунт, ИдентификаторСклада, ВыборкаСопоставленныхТоваров);
			
			ПолучениеДанныхИзОтчетаОбОстаткахFBS_Wildberries(Аккаунт, ОтветныеДанные, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗагрузки = "Excel" Тогда
		
		ПолучитьОстаткиИзExcel_Wildberries(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, ВыборкаСопоставленныхТоваров, МассивНомеровКолонок, НачальнаяСтрока);
		
	КонецЕсли;

	Возврат ТабЗначДанных;
	
КонецФункции

Функция ПолучитьОтчетОбОстаткахFBO_Wildberries(Аккаунт)
	
	ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_СоздатьОтчетОбОстаткахНаСкладах(Аккаунт);
	
	Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
		
		Если ОтветныеДанные.КодСостояния <> 200 Тогда
			
			Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
				ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
			Иначе
				ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при создании отчета об остатках. Подробное описание можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
			
			Возврат Null;
			
		Иначе
			
			ИдентификаторГенерации = ОтветныеДанные.ОтветAPI.data.taskId;
			
			ВремяОжидания = 60;
			
			ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
			
			Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
				// Ожидаем время для следующего запроса
			КонецЦикла;
			
			ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПроверитьСтатусСозданияОтчетаОбОстаткахНаСкладах(Аккаунт, ИдентификаторГенерации);
			
			Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
				
				Если ОтветныеДанные.КодСостояния <> 200 Тогда
					
					Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
						ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
					Иначе
						ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
					КонецЕсли;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при проверке статуса готовности отчета об остатках. Подробное описание можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
					
					Возврат Null;
					
				Иначе
					
					Пока ОтветныеДанные.ОтветAPI.data.status <> "done" И ОтветныеДанные.ОтветAPI.data.status <> "canceled" Цикл
						
						ВремяОжидания = 5;
						
						ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
						
						Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
							// Ожидаем время для следующего запроса
						КонецЦикла;
						
						ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПроверитьСтатусСозданияОтчетаОбОстаткахНаСкладах(Аккаунт, ИдентификаторГенерации);
						
						Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
							
							Если ОтветныеДанные.КодСостояния <> 200 Тогда
								
								Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
									ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
								Иначе
									ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
								КонецЕсли;
								
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = "Ошибка при проверке статуса готовности отчета об остатках. Подробное описание можно посмотреть в журнале регистрации";
								Сообщение.Сообщить();
								
								ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
															УровеньЖурналаРегистрации.Ошибка,,,
															СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
								
								Возврат Null;
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении данных в Wildberries";
							
							ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
														Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							Возврат Null;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ОтветныеДанные.ОтветAPI.data.status = "done" Тогда
						
						ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПолучитьОтчетОбОстаткахНаСкладах(Аккаунт, ИдентификаторГенерации);
						
						Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
							
							Если ОтветныеДанные.КодСостояния <> 200 Тогда
								
								Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
									ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
								Иначе
									ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
								КонецЕсли;
								
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = "Ошибка при получении отчета об остатках. Подробное описание можно посмотреть в журнале регистрации";
								Сообщение.Сообщить();
								
								ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
															УровеньЖурналаРегистрации.Ошибка,,,
															СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
								
								Возврат Null;
								
							Иначе
								
								ВремяОжидания = 60;
								
								ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
								
								Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
									// Ожидаем время для следующего запроса
								КонецЦикла;
								
								Возврат ОтветныеДанные.ОтветAPI;
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении данных в Wildberries";
							
							ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
														Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							Возврат Null;
							
						КонецЕсли;
						
					Иначе
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при создании отчета об остатках. Подробное описание можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
													УровеньЖурналаРегистрации.Ошибка,,,
													СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, "Запрос на создание отчета об остатках на складах отклонен"));
						
						Возврат Null;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении данных в Wildberries";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Null;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении данных в Wildberries";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		Возврат Null;
		
	КонецЕсли;
	
	Возврат Null;
	
КонецФункции

Функция ПолучениеДанныхИзОтчетаОбОстаткахFBO_Wildberries(Аккаунт, Данные, ТабЗначДанных, СопоставленныеТовары)
	
	Для Каждого Строка Из Данные Цикл
		
		Количество = 0;
		
		Если Строка.warehouses.Количество() <> 0 Тогда
			Для Каждого Склад Из Строка.warehouses Цикл
				Если Склад.warehouseName = "Всего находится на складах" Тогда
					Количество = Склад.quantity;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НоваяСтрока = ТабЗначДанных.Добавить();
			НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
			НоваяСтрока.Баракод		= Строка.barcode;
			
			Если ЗначениеЗаполнено(Строка.barcode) Тогда
				
				НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("Баракод", Строка.barcode));
				
				Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
					НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
					НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с баракодом: %1 в сопоставленных товарах (строка №%2)", Строка.barcode, НоваяСтрока.НомерСтроки);
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Количество = Количество;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с баркодом: %1", Строка.barcode);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков WB", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьОтчетОбОстаткахFBS_Wildberries(Аккаунт, ИдентификаторСклада, Данные)
	
	Если Данные.Количество() <= 1000 Тогда
		
		ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПолучитьОстаткиТоваров(Аккаунт, Данные, ИдентификаторСклада);
		
		Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
			
			Если ОтветныеДанные.КодСостояния <> 200 Тогда
				
				Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
					ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
				Иначе
					ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных об остатках. Подробное описание можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
											УровеньЖурналаРегистрации.Ошибка,,,
											СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
				
				Возврат Null;
				
			Иначе
				
				Возврат ОтветныеДанные.ОтветAPI;
				
			КонецЕсли;
			
		Иначе
			
			НазваниеОшибки = "Ошибка при получении данных в Wildberries";
			
			ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
										Символы.ПС, Аккаунт, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат Null;
			
		КонецЕсли;
		
	Иначе
		
		ИтоговыйОтвет = Новый Структура;
		
		ВсегоСтрок = Данные.Количество();
		
		РазмерПакета = 1000;
		
		КоличествоИтераций = Цел(ВсегоСТрок/РазмерПакета);
		Если ВсегоСтрок % РазмерПакета > 0 Тогда
			КоличествоИтераций = КоличествоИтераций + 1;
		КонецЕсли;
		
		Для НомерИтерации = 0 По КоличествоИтераций - 1 Цикл
			
			НачальныйИндекс = НомерИтерации * РазмерПакета;
			КонечныйИндекс = Мин(НачальныйИндекс + РазмерПакета - 1, ВсегоСтрок - 1);
			
			ВременнаяТаблица = Новый ТаблицаЗначений;
			ВременнаяТаблица.Колонки.Добавить("Баракод");
			
			Для Индекс = НачальныйИндекс По КонечныйИндекс Цикл
				НоваяСтрока = ВременнаяТаблица.Добавить();
				НоваяСтрока.Баракод = Данные[Индекс].Баракод;
			КонецЦикла;
			
			ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПолучитьОстаткиТоваров(Аккаунт, ВременнаяТаблица, ИдентификаторСклада);
			
			Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
				
				Если ОтветныеДанные.КодСостояния <> 200 Тогда
					
					Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
						ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
					Иначе
						ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
					КонецЕсли;
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении данных об остатках. Подробное описание можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных. Загрузка первоначальных остатков WB", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
					
					Возврат Null;
					
				Иначе
					
					Для Каждого КлючЗначение Из ОтветныеДанные.ОтветAPI Цикл
						ИтоговыйОтвет.Вставить(КлючЗначение.Ключ + Строка(НомерИтерации), КлючЗначение.Значение);
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении данных в Wildberries";
				
				ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
										Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат Null;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ИтоговыйОтвет;
		
	КонецЕсли;
	
	Возврат Null;
	
КонецФункции

Функция ПолучениеДанныхИзОтчетаОбОстаткахFBS_Wildberries(Аккаунт, Данные, ТабЗначДанных, СопоставленныеТовары)
	
	Для Каждого Пакет Из Данные Цикл
		
		Для Каждого Строка Из Пакет.Значение Цикл
			
			Если Строка.amount <> 0 Тогда
				
				Попытка
					
					НоваяСтрока = ТабЗначДанных.Добавить();
					НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
					НоваяСтрока.Баракод		= Строка.sku;
					
					Если ЗначениеЗаполнено(Строка.sku) Тогда
						
						НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("Баракод", Строка.sku));
						
						Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
							НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
							НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
							НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
						Иначе
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с баракодом: %1 в сопоставленных товарах (строка №%2)", Строка.barcode, НоваяСтрока.НомерСтроки);
							Сообщение.Сообщить();
						КонецЕсли;
						
					КонецЕсли;
					
					НоваяСтрока.Количество = Строка.amount;
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с баркодом: %1", Строка.barcode);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков WB", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Процедура ПолучитьОстаткиИзExcel_Wildberries(Аккаунт, ТабЗначДанных, ПутьКФайлуОстатков, СопоставленныеТовары, МассивНомеровКолонок, НачальнаяСтрока)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлуОстатков);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл. Подробное описание в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при чтении Excel файла. Загрузка первоначальных остатков WB", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	КонецПопытки;
									
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	НомерКолонкиБаракод 	= МассивНомеровКолонок[0];
	НомерКолонкиКоличество 	= МассивНомеровКолонок[1];
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		Попытка
			
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки, НомерКолонкиБаракод).Текст) Тогда
				
				НоваяСтрока = ТабЗначДанных.Добавить();
				НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
				НоваяСтрока.Баракод		= ТабДок.Область(НомерСтроки, НомерКолонкиБаракод).Текст;
				
				НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("Баракод", НоваяСтрока.Баракод));
				
				Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
					НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
					НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с баракодом: %1 в сопоставленных товарах (строка №%2)", НоваяСтрока.Баракод, НоваяСтрока.НомерСтроки);
					Сообщение.Сообщить();
				КонецЕсли;
				
				НоваяСтрока.Количество = ТабДок.Область(НомерСтроки, НомерКолонкиКоличество).Текст;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с баркодом: %1", ТабДок.Область(НомерСтроки, НомерКолонкиБаракод).Текст);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Загрузка первоначальных остатков WB", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Общие

Функция ПолучитьЦеныТоваров_Общая(Аккаунт, ТаблицаТоваров, ТипЗагрузки, ВидЦены, ПутьКФайлуЦен, МассивНомеровКолонок, НачальнаяСтрока) Экспорт
	
	Если ТипЗагрузки = "ВидЦен" Тогда
		
		СписокНоменклатуры = Новый Массив;
		
		ЗаполнитьМассивНоменклатурой(СписокНоменклатуры, ТаблицаТоваров);
		
		ЗаполнитьЦеныПоВидуЦены_Общая(ТаблицаТоваров, СписокНоменклатуры, ВидЦены, Аккаунт.Валюта);
		
	ИначеЕсли ТипЗагрузки = "ОтдельныйExcel" Тогда
		
		ЗаполнитьЦеныИзExcel_Общая(Аккаунт, ТаблицаТоваров, ПутьКФайлуЦен, МассивНомеровКолонок, НачальнаяСтрока);
		
	ИначеЕсли ТипЗагрузки = "СовместныйExcel" Тогда
		
		ЗаполнитьЦеныИзExcel_Общая(Аккаунт, ТаблицаТоваров, ПутьКФайлуЦен, МассивНомеровКолонок, НачальнаяСтрока);
		
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ЗаполнитьЦеныПоВидуЦены_Общая(ТаблицаТоваров, СписокНоменклатуры, ВидЦены, Валюта)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура В (&СписокНоменклатуры)
		|				И ВидЦены = &ВидЦены
		|				И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтрокиНоменклатуры = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
		
		Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
			
			Для Каждого Строка Из НайденныеСтрокиНоменклатуры Цикл
				Строка.Цена = Выборка.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЦеныИзExcel_Общая(Аккаунт, ТаблицаТоваров, ПутьКФайлуЦен, МассивНомеровКолонок, НачальнаяСтрока)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		Название 		= "WB";
		Идентификатор 	= "Баракод";
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		Название 		= "OZON";
		Идентификатор 	= "SKU";
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
		Название 		= "Яндекс Маркет";
		Идентификатор 	= "SKU";
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлуЦен);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл. Подробное описание в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при чтении Excel файла. Загрузка первоначальных остатков %1", Название), 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	КонецПопытки;
									
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	НомерКолонкиИдентификатора 	= МассивНомеровКолонок[0];
	НомерКолонкиЦена 			= МассивНомеровКолонок[1];
	
	Для НомерСтроки = НачальнаяСтрока По КоличествоСтрок Цикл
		
		НайденныеСтрокиНоменклатуры = ТаблицаТоваров.НайтиСтроки(Новый Структура(Идентификатор, ТабДок.Область(НомерСтроки, НомерКолонкиИдентификатора).Текст));
		
		Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
			
			Для Каждого Строка Из НайденныеСтрокиНоменклатуры Цикл
				Строка.Цена = ТабДок.Область(НомерСтроки, НомерКолонкиЦена).Текст;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовПервоначальных

Функция СоздатьВводПервоначальныхОстатков(Данные, Аккаунт, Партия, ОстаткиПодДеятельность, Склад, Помещение, ЗонаПриемки) Экспорт
	
	НовыйДокумент = Документы.ВводОстатков.СоздатьДокумент();
	
	НовыйДокумент.Дата 						= ТекущаяДата();
	НовыйДокумент.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ВводОстатковСобственныхТоваров;
	НовыйДокумент.Организация 				= Аккаунт.Организация;
	НовыйДокумент.Партия					= Партия;
	НовыйДокумент.ВидДеятельностиНДС		= ОстаткиПодДеятельность;
	НовыйДокумент.Склад 					= Склад;
	НовыйДокумент.Помещение					= Помещение;
	НовыйДокумент.ЗонаПриемки				= ЗонаПриемки;
	НовыйДокумент.Контрагент 				= Аккаунт.Контрагент;
	НовыйДокумент.Партнер 					= Аккаунт.Контрагент.Партнер;
	НовыйДокумент.Договор 					= Аккаунт.Договор;
	НовыйДокумент.Валюта 					= Аккаунт.Валюта;
	НовыйДокумент.ЦенаВключаетНДС 			= Аккаунт.ЦенаВключаетНДС;
	НовыйДокумент.НалогообложениеНДС 		= Аккаунт.НалогообложениеНДС;
	НовыйДокумент.Подразделение				= Аккаунт.Подразделение;
	НовыйДокумент.Менеджер 					= Аккаунт.Менеджер;
	НовыйДокумент.ОтражатьВОперативномУчете = Истина;
	НовыйДокумент.ОтражатьСебестоимость 	= Истина;
	НовыйДокумент.ОтражатьВБУиНУ			= Аккаунт.ОтражатьВБУиНУ;
	НовыйДокумент.ОтражатьВУУ				= Аккаунт.ОтражатьВУУ;
	НовыйДокумент.Комментарий				= "Создано обработкой ""Загрузка первоначальных остатков (1С-Рарус)""";
	НовыйДокумент.Автор						= Пользователи.ТекущийПользователь();
	
	Для каждого Строка Из Данные Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			СтрокаТЧДокумента = НовыйДокумент.Товары.Добавить();
			СтрокаТЧДокумента.Номенклатура 			= Строка.Номенклатура;
			СтрокаТЧДокумента.Упаковка 				= Строка.ЕдиницаИзмерения;
			СтрокаТЧДокумента.Характеристика 		= Строка.Характеристика;
			СтрокаТЧДокумента.КоличествоУпаковок 	= Строка.Количество;
			СтрокаТЧДокумента.Количество 			= Строка.Количество;
			СтрокаТЧДокумента.Цена					= Строка.Цена;
			СтрокаТЧДокумента.Сумма					= Строка.Количество * Строка. Цена;
			СтрокаТЧДокумента.СтавкаНДС 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "СтавкаНДС");
			СтрокаТЧДокумента.СуммаНДС				= УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧДокумента.Сумма, НовыйДокумент.ЦенаВключаетНДС, СтрокаТЧДокумента.СтавкаНДС.Ставка);
			СтрокаТЧДокумента.СуммаБезНДС			= ?(Аккаунт.ЦенаВключаетНДС, СтрокаТЧДокумента.Сумма - СтрокаТЧДокумента.СуммаНДС, СтрокаТЧДокумента.Сумма);
			СтрокаТЧДокумента.СуммаСНДС				= ?(Аккаунт.ЦенаВключаетНДС, СтрокаТЧДокумента.Сумма, СтрокаТЧДокумента.Сумма + СтрокаТЧДокумента.СуммаНДС);
			СтрокаТЧДокумента.СуммаРегл				= СтрокаТЧДокумента.СуммаБезНДС;
			СтрокаТЧДокумента.НДСРегл				= СтрокаТЧДокумента.СуммаНДС;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ввод первоначальных остатков создан");
		Сообщение.Сообщить();
	
	Исключение
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось провести ввод первоначальных остатков. Подробное описание можно посмотреть в журнале регистрации");
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Не удалось провести ввод первоначальных остатков", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Функция СоздатьВводПервоначальныхВзаиморасчетов(Данные, Аккаунт, Подразделение) Экспорт
	
	НовыйДокумент = Документы.ВводОстатковПрочихАктивовПассивов.СоздатьДокумент();
	
	НовыйДокумент.Дата 						= ТекущаяДата();                 
	НовыйДокумент.Организация 				= Аккаунт.Организация; 
	НовыйДокумент.Подразделение				= Подразделение;   
	НовыйДокумент.Валюта 					= Аккаунт.Валюта;
	НовыйДокумент.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ВводОстатковПрочихАктивовПассивов;
	НовыйДокумент.Комментарий				= "Создано обработкой ""Загрузка первоначальных остатков (1С-Рарус)""";	
	
	Для каждого Строка Из Данные Цикл
		
		Если ЗначениеЗаполнено(Строка.Сумма_ВР) Тогда
			
			СтрокаТЧДокумента = НовыйДокумент.ПрочиеАктивыПассивы.Добавить(); 
			
			СтрокаТЧДокумента.НаправлениеДеятельности = Строка.НаправлениеДеятельности_ВР; 
			СтрокаТЧДокумента.Статья                  = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки;
			СтрокаТЧДокумента.Сумма 				  = Строка.Сумма_ВР;
			                                            			
		КонецЕсли;
	
	КонецЦикла;
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ввод первоначальных взаиморасчетов создан");
		Сообщение.Сообщить();
	
	Исключение
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось провести ввод первоначальных взаиморасчетов. Подробное описание можно посмотреть в журнале регистрации");
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Не удалось провести ввод первоначальных взаиморасчетов", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
	
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьМассивНоменклатурой(МассивНоменклатуры, ТаблицаТоваров)
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			МассивНоменклатуры.Добавить(Строка.Номенклатура);
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти