Процедура СоздатьУзелОбмена(ОтветАвторизаци, Пользователь) Экспорт
	УзелОбмена = ПолучитьУзелОбменаПользователя(Пользователь);
	ОтветАвторизаци.Вставить("КодПланаОмена", УзелОбмена.Код);
КонецПроцедуры

Функция ПолучитьУзелОбменаПользователя(Пользователь)  
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Мобильные.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбменДаннымиМобильноеПриложение КАК Мобильные
	|ГДЕ
	|	Мобильные.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Обмен.ЗарегистрироватьИзмененияДанных(Выборка.Ссылка);
		Возврат Выборка.Ссылка;
	Иначе
		НовыйУзел = ПланыОбмена.ОбменДаннымиМобильноеПриложение.СоздатьУзел();
		НовыйУзел.Наименование = Пользователь.Наименование;
		НовыйУзел.Пользователь = Пользователь;
		НовыйУзел.УстановитьНовыйКод("МП");

		Попытка
			НовыйУзел.Записать();
			Обмен.ЗарегистрироватьИзмененияДанных(НовыйУзел.Ссылка);
		Исключение
			Описание = ОписаниеОшибки();
		КонецПопытки; 
		
		Возврат НовыйУзел.Ссылка;
	КонецЕсли;
КонецФункции

Процедура ПроверитьЗаполненностьПредопределенногоУзла() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменДаннымиМобильноеПриложение.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменДаннымиМобильноеПриложение КАК ОбменДаннымиМобильноеПриложение
		|ГДЕ
		|	ОбменДаннымиМобильноеПриложение.ЭтотУзел
		|	И ОбменДаннымиМобильноеПриложение.Код = ""ЦБ""
		|	И ОбменДаннымиМобильноеПриложение.Наименование = ""Центральная база""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		УзелОбъект = ПланыОбмена.ОбменДаннымиМобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
		УзелОбъект.Код = "ЦБ";
		УзелОбъект.Наименование = "Центральная база"; 
		УзелОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры
