Процедура УстановитьТекущегоПользователя(Пользователь) Экспорт	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
КонецПроцедуры

Функция ХешироватьПароль(Пароль) Экспорт
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
    Хеш.Добавить(Пароль);
    Возврат Base64Строка(Хеш.ХешСумма);	
КонецФункции

Функция ЭтоЗначениеПримитивногоТипа(Значение) Экспорт 
	Возврат ЭтоПримитивныйТип(ТипЗнч(Значение));
КонецФункции

Функция ЭтоПримитивныйТип(ПроверяемыйТип)
	Если ПроверяемыйТип = Тип("Неопределено")
		Или ПроверяемыйТип = Тип("Булево")
		Или ПроверяемыйТип = Тип("Строка")
		Или ПроверяемыйТип = Тип("Число")
		Или ПроверяемыйТип = Тип("Дата") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//Если не надет, то создает нового пользователя
Функция ПолучитьМобильногоПользователя(Логин, Наименование) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МобильныеПользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МобильныеПользователи КАК МобильныеПользователи
		|ГДЕ
		|	МобильныеПользователи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НовыйПользователь = Справочники.МобильныеПользователи.СоздатьЭлемент();
		НовыйПользователь.Код = Логин;
		НовыйПользователь.Наименование = Наименование;
		НовыйПользователь.ДатаРегистрации = ТекущаяДата();
		НовыйПользователь.Логин = Логин;
		НовыйПользователь.Записать();
		Возврат НовыйПользователь.Ссылка;
	КонецЕсли;
КонецФункции

Функция ПолучитьМобильногоПользователяПоЛогину(Логин) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МобильныеПользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МобильныеПользователи КАК МобильныеПользователи
		|ГДЕ
		|	МобильныеПользователи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

Функция ПолучитьМобильногоПользователяПоТокенуДоступа(ТокенДоступа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТокеныДоступа.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ТокеныДоступа КАК ТокеныДоступа
		|ГДЕ
		|	ТокеныДоступа.ТокенДоступа = &ТокенДоступа";
	
	Запрос.УстановитьПараметр("ТокенДоступа", ТокенДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Пользователь;
	КонецЦикла;
КонецФункции

Функция ПолучитьСотрудникаПоМобильномуПользователю(МобильныйПользователь) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.МобильныйПользователь = &МобильныйПользователь";
	
	Запрос.УстановитьПараметр("МобильныйПользователь", МобильныйПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	КонецЕсли;
КонецФункции

Функция ПолучитьРольСотрудникаВЧеклистеПоМобильномуПользователю(Чеклист, МобильныйПользователь) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТМХ_ЧекЛистУчастникиПриемки.Роль КАК Роль
		|ИЗ
		|	Документ.ТМХ_ЧекЛист.УчастникиПриемки КАК ТМХ_ЧекЛистУчастникиПриемки
		|ГДЕ
		|	ТМХ_ЧекЛистУчастникиПриемки.Ссылка = &Ссылка
		|	И ТМХ_ЧекЛистУчастникиПриемки.Сотрудник.МобильныйПользователь = &МобильныйПользователь";
	
	Запрос.УстановитьПараметр("МобильныйПользователь", МобильныйПользователь);
	Запрос.УстановитьПараметр("Ссылка", Чеклист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Роль;
	КонецЕсли;
КонецФункции

Функция ПолучитьРольСотрудникаВЧеклистеПоСотруднику(Чеклист, Сотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТМХ_ЧекЛистУчастникиПриемки.Роль КАК Роль
		|ИЗ
		|	Документ.ТМХ_ЧекЛист.УчастникиПриемки КАК ТМХ_ЧекЛистУчастникиПриемки
		|ГДЕ
		|	ТМХ_ЧекЛистУчастникиПриемки.Ссылка = &Ссылка
		|	И ТМХ_ЧекЛистУчастникиПриемки.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Чеклист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Роль;
	КонецЕсли;
КонецФункции

Функция ПолучитьСотрудникаПоКоду(КодСотрудника) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	КонецЕсли;
КонецФункции

Процедура ВставитьВСтруктуруВерсиюОбмена(Структура) Экспорт 
	ТекущаяВерсияОбмена = ПолучитьВерсиюОбменаМП(); 
	СообщениеДляНекорректнойВерсииОбмена = "Не та версия обмена!";
	Структура.Вставить("ТекущаяВерсияОбмена", ТекущаяВерсияОбмена);
	Структура.Вставить("СообщениеДляНекорректнойВерсииОбмена", СообщениеДляНекорректнойВерсииОбмена);
КонецПроцедуры

Функция ПолучитьВерсиюОбменаМП() Экспорт
	Возврат "1.0.1";
КонецФункции

//не используется
Функция ТребуетсяУказаниеСерий(Номенклатура, Документ)
	
	ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
	
	Если НЕ ВидНоменклатуры.ИспользоватьСерии ИЛИ НЕ ЗначениеЗаполнено(Документ.Склад) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Пока НЕ ВидНоменклатуры.ВладелецСерий = Неопределено Цикл 
		ВидНоменклатуры = ВидНоменклатуры.ВладелецСерий;
	КонецЦикла;
	
	Политика = ВидНоменклатуры.ПолитикаУчетаСерий;
	
	Если ВидНоменклатуры.ПолитикиУчетаСерий.Количество>0 Тогда 
		Для Каждого ИндивидуальнаяПолитика Из ВидНоменклатуры.ПолитикиУчетаСерий Цикл 
			Если ИндивидуальнаяПолитика.Склад = Документ.Склад Тогда 
				Политика = ИндивидуальнаяПолитика.ПолитикаУчетаСерий;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если Политика.УказыватьПриПриемкеОтПоставщика Тогда 
		Если Документ.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		    	Возврат Истина;
			КонецЕсли;
		Иначе 
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		    	Возврат Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	
	
	
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		
	КонецЕсли;
	
		
	

	
	
	

КонецФункции // ТребуетсяУказаниеСерий()

Функция ПреобразованиеМассивВТаблицуЗначений(Массив) Экспорт 

   ТЗ = Новый ТаблицаЗначений;

   Для Каждого СтрокаМассива Из Массив Цикл

       Если ТЗ.Колонки.Количество() = 0 Тогда
           Для Каждого ЭлементМассива Из СтрокаМассива Цикл
               ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
           КонецЦикла;
       КонецЕсли;

       НоваяСтрока = ТЗ.Добавить();
       Для Каждого ЭлементМассива Из СтрокаМассива Цикл
           НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
       КонецЦикла;
   КонецЦикла;

   Возврат ТЗ;

КонецФункции

#Область Сериализация
Функция ЗаписатьДанныеВJSON(Данные) Экспорт
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());     
		
		НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
		НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
		НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;

		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON);
		
		Возврат ЗаписьJSON.Закрыть();
	Исключение
	    //ns_ОбработкаОшибок.ЗаписатьОшибку(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции

Функция ПрочитатьДанныеИзJSON(СтрокаJSON) Экспорт
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина,,, "ДесериализацияJSON", ОбщегоНазначения);
	Исключение
		//ns_ОбработкаОшибок.ЗаписатьОшибку(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции

Функция ДесериализацияJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	Если Свойство = "Recipient" Тогда
		Возврат ОбщегоНазначения.ДесериализоватьXDTO(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли; 
КонецФункции
 
Функция СериализоватьXDTO(ИсходныйОбъект) Экспорт
	
	ОбъектЗначениеXDTO = СериализаторXDTO.ЗаписатьXDTO(ИсходныйОбъект);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектЗначениеXDTO);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Функция ДесериализоватьXDTO(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ИсходныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть(); 
	
	Возврат ИсходныйОбъект;
КонецФункции

#КонецОбласти

// Функция преобразует таблицу значений в массив структур 
Функция ТаблицаЗначенийВМассивСтруктур(ТаблицаЗначений) Экспорт
 
 Результат = Новый Массив;
 // Обходим таблицу значений
 Для Каждого Строка Из ТаблицаЗначений Цикл
  // Создаем структуру
  Свойства = Новый Структура;
  // Заполняем структуру колонками таблицы значений
  Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
   Свойства.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
  КонецЦикла;
  // Добавляем созданную структуру в таблицу значений
  Результат.Добавить(Свойства);
 КонецЦикла;
 
 Возврат Результат;
 
КонецФункции