
#Область Wildberries

Функция СформироватьExcelСпискаТоваров_Wildberries(СписокТоваров) Экспорт
	
	Попытка
		ПриложениеExcel = Новый COMОбъект("Excel.Application");
		
		КнигаExcel = ПриложениеExcel.Workbooks.Add();
		
		Лист1 = КнигаExcel.Sheets(1);   
		
		Лист1.Cells(1, 1).Value = "Баркод"; 
		Лист1.Cells(1, 2).Value = "Количество"; 
		
	
		Для Строка = 2 По СписокТоваров.Количество()+1 Цикл
			
			Лист1.Cells(Строка, 1).Value = Строка(СписокТоваров[Строка-2].рар_мп_Баркод);       
			Лист1.Cells(Строка, 2).Value = СписокТоваров[Строка-2].рар_мп_Количество;

			
		КонецЦикла;    
		
		ПолнаяДата = СтрЗаменить(ТекущаяДата(), ":", "-");

		КнигаExcel.SaveAs(СтрШаблон("%1\Wildberries. Список товаров для поставки FBW от %2.xlsx", Константы.рар_мп_МестоХраненияФайлов.Получить(), ПолнаяДата));   
		
		ПриложениеExcel.Quit();    
		
		Возврат Истина;
		
		
	Исключение  
		
		ЗаписьЖурналаРегистрации("Ошибка при создании файла Excel по списку товаров WB. Подготовка файлов поставки.", 
								УровеньЖурналаРегистрации.Ошибка,,,
								ОписаниеОшибки());

		Возврат Ложь;
		
	КонецПопытки;    
	
КонецФункции 

Функция СформироватьExcelРаспределенныхТоваров_Wildberries(РаспределенныеТовары) Экспорт
	
	Попытка
		ПриложениеExcel = Новый COMОбъект("Excel.Application");
		
		КнигаExcel = ПриложениеExcel.Workbooks.Add();
		
		Лист1 = КнигаExcel.Sheets(1);   
		
		Лист1.Cells(1, 1).Value = "Баркод товара"; 
		Лист1.Cells(1, 2).Value = "Кол-во товаров";
		Лист1.Cells(1, 3).Value = "ШК короба";
		Лист1.Cells(1, 4).Value = "Срок годности";
		
		Для Строка = 2 По РаспределенныеТовары.Количество()+1 Цикл
			
			Лист1.Cells(Строка, 1).Value = Строка(РаспределенныеТовары[Строка-2].рар_мп_Баркод);       
			Лист1.Cells(Строка, 2).Value = РаспределенныеТовары[Строка-2].рар_мп_Количество;
			Лист1.Cells(Строка, 3).Value = РаспределенныеТовары[Строка-2].рар_мп_Коробка;
			
		КонецЦикла;    
		
		ПолнаяДата = СтрЗаменить(ТекущаяДата(), ":", "-");
		
		КнигаExcel.SaveAs(СтрШаблон("%1\Wildberries. Распределенные товары по коробкам для поставки FBW от %2.xlsx", Константы.рар_мп_МестоХраненияФайлов.Получить(), ПолнаяДата));   
		
		ПриложениеExcel.Quit();    
		
		Возврат Истина;
		
		
	Исключение  
		
		ЗаписьЖурналаРегистрации("Ошибка при создании файла Excel по распределенным товарам WB. Подготовка файлов поставки.", 
								УровеньЖурналаРегистрации.Ошибка,,,
								ОписаниеОшибки());

		Возврат Ложь;
		
	КонецПопытки;    
	
КонецФункции 


#КонецОбласти  

#Область Ozon

Функция СформироватьExcelСпискаТоваров_Ozon(СписокТоваров) Экспорт
	
	Попытка
		ПриложениеExcel = Новый COMОбъект("Excel.Application");
		
		КнигаExcel = ПриложениеExcel.Workbooks.Add();
		
		Лист1 = КнигаExcel.Sheets(1);   
		
		Лист1.Cells(1, 1).Value = "Артикул"; 
		Лист1.Cells(1, 2).Value = "Количество";
		
		
		Для Строка = 2 По СписокТоваров.Количество()+1 Цикл
			
			Лист1.Cells(Строка, 1).Value = СписокТоваров[Строка-2].рар_мп_Артикул;       
			Лист1.Cells(Строка, 2).Value = СписокТоваров[Строка-2].рар_мп_Количество;

			
		КонецЦикла; 
		
		ПолнаяДата = СтрЗаменить(ТекущаяДата(), ":", "-");
		
		КнигаExcel.SaveAs(СтрШаблон("%1\Ozon. Список товаров для поставки FBO от %2.xlsx", Константы.рар_мп_МестоХраненияФайлов.Получить(), ПолнаяДата));   
		
		ПриложениеExcel.Quit();    
		
		Возврат Истина;
		
		
	Исключение  
		
		ЗаписьЖурналаРегистрации("Ошибка при создании файла Excel по списку товаров Ozon. Подготовка файлов поставки.", 
								УровеньЖурналаРегистрации.Ошибка,,,
								ОписаниеОшибки());

		Возврат Ложь; 
		
	КонецПопытки;
		
КонецФункции 

#КонецОбласти