#Область СлужебныйПрограммныйИнтерфейс

&После("ПриНачалеРаботыСистемы")
Процедура Рар_МП_ЛицензияПриНачале() 
	ДоступныПрава 					  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_ОсновнаяРоль");
	ДоступныПрава_Ozon 				  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_Ozon");
	ДоступныПрава_Wildberries 		  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_Wildberries");
	ДоступныПрава_ЯндексМаркет 		  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_ЯндексМаркет");
	ДоступныПрава_Ozon_FBO 			  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_Ozon_FBO");
	ДоступныПрава_Wildberries_FBO 	  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_Wildberries_FBO");
	ДоступныПрава_ЯндексМаркет_FBO	  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("рар_мп_ЯндексМаркет_FBO");
	ДоступныПрава_РаботаСВебСервисами = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("РаботаСВебСервисами");
	ДоступныПрава_ПолныеПрава 		  = рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ЕстьРоль("ПолныеПрава");
	
	Если ДоступныПрава_ПолныеПрава ИЛИ ДоступныПрава ИЛИ ДоступныПрава_Ozon ИЛИ ДоступныПрава_Wildberries ИЛИ ДоступныПрава_ЯндексМаркет ИЛИ ДоступныПрава_Ozon_FBO
		ИЛИ ДоступныПрава_Wildberries_FBO ИЛИ ДоступныПрава_ЯндексМаркет_FBO ИЛИ ДоступныПрава_РаботаСВебСервисами Тогда
		
		СсылкаНаБазу = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		Если СтрНайти(СсылкаНаБазу, "1cfresh.com") Тогда   
			рар_мп_РаботаССогласиемВызовСервера.Рар_МП_УстановитьСогласие();
		Иначе       
			Если НЕ рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ПолучитьСогласие()
				ИЛИ рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ВерсияРасширения() <> рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ПолучитьСтаруюВерсиюРасширения() Тогда
				рар_мп_РаботаССогласиемВызовСервера.Рар_МП_УстановитьНовуюВерсиюРасширения(рар_мп_РаботаССогласиемВызовСервера.Рар_МП_ВерсияРасширения());
				Форма = ПолучитьФорму("ОбщаяФорма.рар_мп_ПользовательскоеЛицензионноеСоглашение");
				Форма.Открыть();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры 
#КонецОбласти