
#Область Ozon

Функция ПолучитьСписокТоваровСХарактеристиками_Ozon(Аккаунт, ВидНоменклатуры) Экспорт
	
	ИдентификаторСтраницы = "";
	
	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("IDТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("СтавкаНДС");
	ТабЗначТоваров.Колонки.Добавить("Штрихкод");
	ТабЗначТоваров.Колонки.Добавить("Вес");
	ТабЗначТоваров.Колонки.Добавить("ЕдИзмеренияВеса");
	ТабЗначТоваров.Колонки.Добавить("КартинкаТовара");
	ТабЗначТоваров.Колонки.Добавить("SKUТовара");
	ТабЗначТоваров.Колонки.Добавить("Номенклатура");
	ТабЗначТоваров.Колонки.Добавить("Упаковка");
	ТабЗначТоваров.Колонки.Добавить("НомерСтроки");
		
	HTTPОтвет = рар_мп_Ozon_Методы.Метод_СписокТоваров(Аккаунт, ИдентификаторСтраницы); 
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.message, Аккаунт);
				
			ЗаписьЖурналаРегистрации("Ошибка при получении ", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);

			Возврат	ТабЗначТоваров; 
				
		КонецЕсли;
		
		ИдентификаторСтраницы 	= HTTPОтвет.ОтветAPI.result.last_id; 
		КоличествоСтраниц 		= Цел(HTTPОтвет.ОтветAPI.result.total/1000);
		МассивТоваровИзЗапроса 	= HTTPОтвет.ОтветAPI.result.items;
		
		КоличествоЗапросов = 0;
		
		Пока КоличествоСтраниц > 0 Цикл
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			HTTPОтвет = рар_мп_Ozon_Методы.Метод_СписокТоваров(Аккаунт, ИдентификаторСтраницы);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Если HTTPОтвет.КодСостояния <> 200 Тогда
					
					ТабЗначТоваров.Очистить();
				
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.message, Аккаунт);
						
					ЗаписьЖурналаРегистрации("Ошибка при получении ", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);

					Возврат ТабЗначТоваров;
						
				КонецЕсли;
				
				ИдентификаторСтраницы = HTTPОтвет.ОтветAPI.result.last_id;
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваровИзЗапроса, HTTPОтвет.ОтветAPI.result.items, Истина);		
				КоличествоСтраниц = КоличествоСтраниц - 1; 
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			КонецЕсли;
			
		КонецЦикла;
		
		ПакетыТоваров = РазделениеМассиваНаПакеты(МассивТоваровИзЗапроса, 1000);
		
		Для Каждого Пакет Из ПакетыТоваров Цикл
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
		
			HTTPОтветОписанияХарактеристикТовара = рар_мп_Ozon_Методы.Метод_ПолучитьОписаниеХарактеристикТовара(Аккаунт, Пакет.Значение);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если HTTPОтветОписанияХарактеристикТовара.Свойство("ОтветAPI") Тогда
				
				Если HTTPОтветОписанияХарактеристикТовара.КодСостояния <> 200 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении информации о товарах. 
												|Подробное описание ошибки можно посмотреть в журнале регистрации");
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", 
												HTTPОтветОписанияХарактеристикТовара.КодСостояния, HTTPОтветОписанияХарактеристикТовара.ОтветAPI.message, Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении информации о товарах", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
				Иначе
					
					Если КоличествоЗапросов = 50 Тогда
						
						КоличествоЗапросов = 0;
						
						ВремяОжидания = 5;
						
						ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
						
						Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
							// Ожидаем время для следующего запроса	
						КонецЦикла;
						
					КонецЕсли;
					
					HTTPОтветОписанияХарактеристикТовараДляНоменклатуры = рар_мп_Ozon_Методы.Метод_ПолучитьОписаниеХарактеристикТовараДляНоменклатуры(Аккаунт, Пакет.Значение);
					
					КоличествоЗапросов = КоличествоЗапросов + 1;
					
					ТаблицаХарактеристик = Новый ТаблицаЗначений;
					
					Если HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.Свойство("ОтветAPI") Тогда
						
						Если HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.КодСостояния <> 200 Тогда
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Ошибка при получении характеристик товаров. 
														|Подробное описание ошибки можно посмотреть в журнале регистрации");
														Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", 
														HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.КодСостояния, 
														HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.ОтветAPI.message, Аккаунт);
							
							ЗаписьЖурналаРегистрации("Ошибка при получении характеристик товаров", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
						Иначе	
							
							ТаблицаХарактеристик = ПреобразоватьМассивВТаблицуЗначений(HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.ОтветAPI.result);
							
						КонецЕсли;
						
					Иначе
						
						ТабЗначТоваров.Очистить();
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении характеристик товаров. Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
						
						ЗаписьЖурналаРегистрации("Ошибка при получении характеристик товаров", 
													УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", 
													HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
						
						Возврат ТабЗначТоваров;
						
					КонецЕсли;
					
					Для Каждого Товар Из HTTPОтветОписанияХарактеристикТовара.ОтветAPI.items Цикл
						
						Попытка
														
							IDТовара		   	= Формат(Товар.id,"ЧГ=");
							Артикул  		   	= Формат(Товар.offer_id,"ЧГ=");
							НаименованиеТовара 	= Товар.name;
							СтавкаНДС			= Товар.vat;
							SKU					= "";
							
							Если Товар.sources.Количество() <> 0 Тогда
								
								SKU = Товар.sources[0].sku;
								
							КонецЕсли;
							
							НайтиНоменклатуру	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
							
							Запись				= РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьМенеджерЗаписи();
							Запись.Аккаунт		= Аккаунт;
							Запись.IDТовара		= IDТовара;
							Запись.Артикул		= Артикул;
							Запись.SKUТовара    = SKU; 
							
							Запись.Прочитать();
							
							Если НЕ Запись.Выбран() Тогда
								
								НоваяСтрока = ТабЗначТоваров.Добавить();
								
								НоваяСтрока.IDТовара  	  		= IDТовара;
								НоваяСтрока.Артикул		 	  	= Артикул;   
								НоваяСтрока.НаименованиеТовара	= НаименованиеТовара;
								НоваяСтрока.SKUТовара			= SKU;
								НоваяСтрока.СтавкаНДС 			= СопостовлениеНДС_Ozon(СтавкаНДС);
								
								Если НайтиНоменклатуру <> Справочники.Номенклатура.ПустаяСсылка() И НЕ ПустаяСтрока(Артикул) И НЕ НайтиНоменклатуру.ПометкаУдаления Тогда 
									
									НоваяСтрока.Номенклатура 	= НайтиНоменклатуру;
									НоваяСтрока.Упаковка		= НайтиНоменклатуру.ЕдиницаИзмерения;
									
								КонецЕсли;	
								
								Если Товар.barcodes.Количество() > 0 Тогда
									
									НоваяСтрока.Штрихкод = Товар.barcodes[0];	
									
								КонецЕсли;	

								Если HTTPОтветОписанияХарактеристикТовараДляНоменклатуры.КодСостояния = 200 Тогда
									
									НайденныеСтроки = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("id", Товар.id));
									
									Если НайденныеСтроки.Количество() <> 0 Тогда
										
										СтрокаХарактеристик = НайденныеСтроки.Получить(0);
										
										НоваяСтрока.Вес				= СтрокаХарактеристик.weight;
										НоваяСтрока.ЕдИзмеренияВеса = СопостовлениеВеса(СтрокаХарактеристик.weight_unit);
										НоваяСтрока.КартинкаТовара	= СтрокаХарактеристик.primary_image;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						Исключение
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Ошибка при получении информации о товаре с id: %1. 
														|Подробное описание ошибки можно посмотреть в журнале регистрации",
														Товар.id);
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
							
							ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при получении информации о товаре с id: %1", Товар.id), 
														УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
						КонецПопытки;
						
					КонецЦикла;
					
				КонецЕсли;		
				
			Иначе
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,
											СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
				
				Возврат ТабЗначТоваров;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
		
		Возврат ТабЗначТоваров;
		
	КонецЕсли;
	
	Массив = Новый Массив;
	
	Для Сч = 1 По ТабЗначТоваров.Количество() Цикл
		
		Массив.Добавить(Сч);
		
	КонецЦикла;
	
	ТабЗначТоваров.ЗагрузитьКолонку(Массив,"НомерСтроки");
	
	Возврат ТабЗначТоваров;

КонецФункции

Функция РазделениеМассиваНаПакеты(ИсходныйМассив, РазмерПакета)
	
	// Создаем структуру для хранения пакетов
	Пакеты = Новый Структура;
	
	// Параметры для разделения
	КоличествоПакетов = Цел(ИсходныйМассив.Количество() / РазмерПакета);
	Если ИсходныйМассив.Количество() % РазмерПакета > 0 Тогда
		КоличествоПакетов = КоличествоПакетов + 1;
	КонецЕсли;
	
	// Разделяем массив на пакеты
	Для НомерПакета = 1 По КоличествоПакетов Цикл
		НовыйПакет = Новый Массив;
		НачальныйИндекс = (НомерПакета - 1) * РазмерПакета;
		КонечныйИндекс = Мин(НачальныйИндекс + РазмерПакета - 1, ИсходныйМассив.Количество() - 1);
		
		Для Индекс = НачальныйИндекс По КонечныйИндекс Цикл
			НовыйПакет.Добавить(ИсходныйМассив[Индекс]);
		КонецЦикла;
		
		// Добавляем пакет в структуру с ключом "ПакетN"
		Пакеты.Вставить("Пакет" + Формат(НомерПакета, "ЧГ=0"), НовыйПакет);
	КонецЦикла;
	
	Возврат Пакеты;
	
КонецФункции

Функция ПреобразоватьМассивВТаблицуЗначений(МассивСтруктур)
    
    Данные = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		
		Если Данные.Колонки.Количество() = 0 Тогда
			
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				
				МассивДопустимыеТипы = Новый Массив;
				
				ТипКолонки = ТипЗнч(ЗначениеСтруктуры.Значение); 
				
    			МассивДопустимыеТипы.Добавить(ТипКолонки);  
				
    			Описание_Типов = Новый ОписаниеТипов(МассивДопустимыеТипы);
				
				Данные.Колонки.Добавить(ЗначениеСтруктуры.Ключ, Описание_Типов);
				
			КонецЦикла;
			
		КонецЕсли;
		
        НоваяСтрока = Данные.Добавить();
		
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
		
    КонецЦикла;
    
    Возврат Данные;
    
КонецФункции

#КонецОбласти 

#Область Wildberries

Функция ПолучитьСписокТоваровСХарактеристиками_Wildberries(Аккаунт, ВидНоменклатуры) Экспорт

	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("IDТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("Штрихкод");
	ТабЗначТоваров.Колонки.Добавить("Размер");
	ТабЗначТоваров.Колонки.Добавить("Вес");
	ТабЗначТоваров.Колонки.Добавить("ЕдИзмеренияВеса");
	ТабЗначТоваров.Колонки.Добавить("КартинкаТовара");
	ТабЗначТоваров.Колонки.Добавить("Номенклатура");
	ТабЗначТоваров.Колонки.Добавить("Упаковка");
	ТабЗначТоваров.Колонки.Добавить("НомерСтроки");
	ТабЗначТоваров.Колонки.Добавить("Характеристика");
	ТабЗначТоваров.Колонки.Добавить("IDРазмера");
	ТабЗначТоваров.Колонки.Добавить("ВозможностьСменыЦенДляРазмеров");
		
	КоличествоНоменклатуры = 100;
	ОграничениеНаСтранице  = 100;
	ДатаИзменения 		   = ""; 
	НомерСтраницы 		   = "";
	
	Пока КоличествоНоменклатуры >= ОграничениеНаСтранице Цикл
	
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_СписокКарточекТоваров(Аккаунт, ДатаИзменения, НомерСтраницы);
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. 
								   |Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
			
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				
				Иначе
				
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
				КонецЕсли; 
				
				Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
				
				ЗаписьЖурналаРегистрации("Ошибка при получении товаров из маркетплейса", 
										 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат ТабЗначТоваров; 	
				
			Иначе
				
				Попытка
				
					ДатаИзменения = HTTPОтвет.ОтветAPI.cursor.updatedAt;					
					НомерСтраницы = HTTPОтвет.ОтветAPI.cursor.nmID;					
					КоличествоНоменклатуры = HTTPОтвет.ОтветAPI.cursor.total;
					
					Для каждого Строка Из HTTPОтвет.ОтветAPI.cards Цикл
						                             					
						Для каждого Размер Из Строка.sizes Цикл
							
							Запись			= РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
							Запись.Аккаунт	= Аккаунт;
							Запись.IDТовара	= Формат(Строка.nmID, "ЧГ=");
							Запись.Артикул	= Строка.vendorCode;
							
							Если Размер.skus.Количество() > 0 Тогда
								Запись.Баракод = Размер.skus.Получить(0);	
							КонецЕсли;
							
							Запись.Размер	 = Размер.techSize;
							Запись.IDРазмера = Размер.chrtID;
							
							Запись.Прочитать();

							Если НЕ Запись.Выбран() Тогда 
								
								Артикул						= Строка.vendorCode;
								НайтиНоменклатуру			= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
							
								СтрокаТЗ					= ТабЗначТоваров.Добавить(); 
								СтрокаТЗ.IDТовара			= Формат(Строка.nmID, "ЧГ=");
								СтрокаТЗ.Артикул			= Артикул;
								
								Если НайтиНоменклатуру <> Справочники.Номенклатура.ПустаяСсылка() И НЕ ПустаяСтрока(Артикул) И НЕ НайтиНоменклатуру.ПометкаУдаления Тогда 
				
									СтрокаТЗ.Номенклатура 	= НайтиНоменклатуру;
									СтрокаТЗ.Упаковка		= НайтиНоменклатуру.ЕдиницаИзмерения;
									СтрокаТЗ.Характеристика	= ПолучитьХарактеристику(Размер.techSize, ВидНоменклатуры, НайтиНоменклатуру, Ложь);
									
								КонецЕсли;
								
								СтрокаТЗ.Штрихкод			= Размер.skus.Получить(0);
								СтрокаТЗ.НаименованиеТовара	= Строка.title;
								СтрокаТЗ.Размер				= Размер.techSize;
								СтрокаТЗ.IDРазмера			= Размер.chrtID;
								СтрокаТЗ.КартинкаТовара		= Строка.photos.Получить(0).c246x328;
								СтрокаТЗ.Вес				= Строка.dimensions.weightBrutto;
								СтрокаТЗ.ЕдИзмеренияВеса	= Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("кг");
																	
							КонецЕсли;	
						
						КонецЦикла;		
					
					КонецЦикла;
				
				Исключение
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении данных о товарах.  
									   |Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат ТабЗначТоваров;
				
				КонецПопытки;	
				
			КонецЕсли;
			
		Иначе
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			Возврат ТабЗначТоваров;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ПроверитьНаИзменениеЦен(Аккаунт, ТабЗначТоваров);
	
	Массив = Новый Массив;
	
	Для Сч = 1 По ТабЗначТоваров.Количество() Цикл
		
		Массив.Добавить(Сч);
		
	КонецЦикла;
	
	ТабЗначТоваров.ЗагрузитьКолонку(Массив,"НомерСтроки");
	
	Возврат ТабЗначТоваров;	
	
КонецФункции

Процедура ПроверитьНаИзменениеЦен(Аккаунт, ТабЗначТоваров)
	
	Смещение = 0;
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьТоварыСЦенами(Аккаунт, Смещение);
	
	КоличествоЗапросов = 1;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
								|Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли; 
			
			Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
			
			ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
										УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат; 	
			
		Иначе
			
			Пока HTTPОтвет.ОтветAPI.data.listGoods.Количество() <> 0 Цикл
				
				Попытка
					
					Для Каждого Строка Из HTTPОтвет.ОтветAPI.data.listGoods Цикл
						
						НайденныеСтрокиНоменклатуры = ТабЗначТоваров.НайтиСтроки(Новый Структура("Артикул", Строка.vendorCode));
						
						Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
							
							Для Каждого НайденнаяСтрока Из НайденныеСтрокиНоменклатуры Цикл
								
								НайденнаяСтрока.ВозможностьСменыЦенДляРазмеров = Строка.editableSizePrice;
								
							КонецЦикла;
						
						КонецЕсли;
						
					КонецЦикла;
					
				Исключение
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
									   |Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат;
					
				КонецПопытки;
				
				Смещение = Смещение + 1000;
				
				Если КоличествоЗапросов = 10 Тогда
					
					ВремяОжидания = 6;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
					
					КоличествоЗапросов = 0;
					
				КонецЕсли;
				
				HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьТоварыСЦенами(Аккаунт, Строка(Смещение));
				
				КоличествоЗапросов = КоличествоЗапросов + 1;
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если HTTPОтвет.КодСостояния <> 200 Тогда
						
						ТабЗначТоваров.Очистить();
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
											|Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
							
							ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
							
						Иначе
							
							ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
							
						КонецЕсли; 
						
						Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
						
						ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
													УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						Возврат;
						
					КонецЕсли;
					
				Иначе
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
					
					Возврат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ТабЗначТоваров.Очистить();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЯндексМаркет 

Функция ПолучитьСписокТоваровСХарактеристиками_ЯндексМаркет(Аккаунт, ВидНоменклатуры) Экспорт

	ПослядняяСтраница = Ложь;
	СледующаяСтраница = "";
	
	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("SKUТовара");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("Штрихкод");
	ТабЗначТоваров.Колонки.Добавить("Вес");
	ТабЗначТоваров.Колонки.Добавить("КартинкаТовара");
	ТабЗначТоваров.Колонки.Добавить("ЕдИзмеренияВеса");
	ТабЗначТоваров.Колонки.Добавить("Номенклатура");
	ТабЗначТоваров.Колонки.Добавить("Упаковка");
	ТабЗначТоваров.Колонки.Добавить("НомерСтроки");
		
	Пока НЕ ПослядняяСтраница Цикл
	
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ИнформацияОТоварахВКаталогах(Аккаунт, СледующаяСтраница);
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. 
								   |Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.errors.Получить(0).message, Аккаунт);
				
				ЗаписьЖурналаРегистрации("Ошибка при получении товаров из маркетплейса.", 
										 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат ТабЗначТоваров;	
				
			Иначе
				
				Попытка
			
					Для каждого Строка Из HTTPОтвет.ОтветAPI.result.offerMappings Цикл
						
						Запись 			 = РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьМенеджерЗаписи();
						Запись.Аккаунт   = Аккаунт;
						Запись.SKUТовара = Строка.offer.offerId;
						Запись.Артикул   = ?(Строка.offer.Свойство("vendorCode"), Строка.offer.vendorCode, "");
						
						
						Запись.Прочитать();

						Если НЕ Запись.Выбран() Тогда
							
							Артикул 					= ?(Строка.offer.Свойство("vendorCode"), Строка.offer.vendorCode, "");
			                НайтиНоменклатуру			= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
							
							СтрокаТЗ		     	  	= ТабЗначТоваров.Добавить(); 
							СтрокаТЗ.SKUТовара 	 		= Строка.offer.offerId;
							СтрокаТЗ.Артикул 	 	  	= Артикул;
							СтрокаТЗ.НаименованиеТовара	= Строка.offer.name;
							
							Если НайтиНоменклатуру <> Справочники.Номенклатура.ПустаяСсылка() И НЕ ПустаяСтрока(Артикул) И НЕ НайтиНоменклатуру.ПометкаУдаления Тогда 
				
								СтрокаТЗ.Номенклатура 	= НайтиНоменклатуру;
								СтрокаТЗ.Упаковка		= НайтиНоменклатуру.ЕдиницаИзмерения;
									
							КонецЕсли;
								
							СтрокаТЗ.Штрихкод			= Строка.offer.barcodes.Получить(0);
							СтрокаТЗ.КартинкаТовара		= Строка.offer.pictures.Получить(0);
							СтрокаТЗ.Вес				= Строка.offer.weightDimensions.weight;
							СтрокаТЗ.ЕдИзмеренияВеса	= Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("кг");
														
						КонецЕсли;	
						
					КонецЦикла;
					
					Если HTTPОтвет.ОтветAPI.result.paging.Свойство("nextPageToken") Тогда
						СледующаяСтраница = HTTPОтвет.ОтветAPI.result.paging.nextPageToken;			
					Иначе
						ПослядняяСтраница = Истина;	
					КонецЕсли;	
				
				Исключение 
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров из маркетплейса.
									   |Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров из маркетплейса.", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат ТабЗначТоваров;
				
				КонецПопытки;	
				
			КонецЕсли;
			
		Иначе
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			Возврат ТабЗначТоваров;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Массив = Новый Массив;
	
	Для Сч = 1 По ТабЗначТоваров.Количество() Цикл
		
		Массив.Добавить(Сч);
		
	КонецЦикла;
	
	ТабЗначТоваров.ЗагрузитьКолонку(Массив,"НомерСтроки");
	
	Возврат ТабЗначТоваров;
	
КонецФункции	
	
#КонецОбласти

#Область СоздатьНоменклатуру 

Функция СоздатьНоменклатуру(АккаунтМаркетплейса, ТабличнаяЧасть, ВидНоменклатуры,  УстановитьСтавкуНДС, СоздаватьНоменклатуруОтдельноДляКаждогоРазмера) Экспорт
	
	РеквизитыВидаНоменклатуры 		= ПолучитьРеквизитыВидаНоменклатуры(ВидНоменклатуры).Получить(0);

	ВыбранныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("ИзменитьПозицию", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда		 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для создания номенклатуры";
		Сообщение.Сообщить();
	   	
	Иначе		
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON  Тогда	
		//Ozon	
			Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
				
				Если СтрокаТабличнойЧасти.ИзменитьПозицию = Ложь Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ПустаяСтрока(СтрокаТабличнойЧасти.Артикул) Тогда
				
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Номенклатура не создана, в строке - %1 не заполнен артикул.", СтрокаТабличнойЧасти.НомерСтроки);
					Сообщение.Сообщить();
					
					Продолжить;	
				
				КонецЕсли;
				
				ПоискЭлемента = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
				
				Если ПоискЭлемента <> Справочники.Номенклатура.ПустаяСсылка() Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Номенклатура с артикулом - %1 уже существует!", СтрокаТабличнойЧасти.Артикул);
					Сообщение.Сообщить();
					
					Продолжить;
					
				КонецЕсли;
				
				НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
				
				НовыйЭлемент.Наименование					= СтрокаТабличнойЧасти.НаименованиеТовара;
				НовыйЭлемент.Артикул						= СтрокаТабличнойЧасти.Артикул;
				НовыйЭлемент.ВидНоменклатуры				= ВидНоменклатуры;
				НовыйЭлемент.ТипНоменклатуры				= РеквизитыВидаНоменклатуры.ТипНоменклатуры;
				НовыйЭлемент.ИспользованиеХарактеристик		= РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик;
				НовыйЭлемент.ВариантОформленияПродажи		= РеквизитыВидаНоменклатуры.ВариантОформленияПродажи;
				НовыйЭлемент.ЕдиницаИзмерения				= РеквизитыВидаНоменклатуры.ЕдиницаИзмерения;
				НовыйЭлемент.Качество						= Перечисления.ГрадацииКачества.Новый;
				НовыйЭлемент.КодОКВЭД						= РеквизитыВидаНоменклатуры.КодОКВЭД;
				НовыйЭлемент.КодОКП							= РеквизитыВидаНоменклатуры.КодОКП;
	  			НовыйЭлемент.КодОКВЭД2						= РеквизитыВидаНоменклатуры.КодОКВЭД2;
				НовыйЭлемент.КодОКПД2						= РеквизитыВидаНоменклатуры.КодОКПД2;
				НовыйЭлемент.КодТНВЭД						= РеквизитыВидаНоменклатуры.КодТНВЭД;
				НовыйЭлемент.СкладскаяГруппа				= РеквизитыВидаНоменклатуры.СкладскаяГруппа;
				НовыйЭлемент.ГруппаАналитическогоУчета		= РеквизитыВидаНоменклатуры.ГруппаАналитическогоУчета;
				НовыйЭлемент.ГруппаФинансовогоУчета			= РеквизитыВидаНоменклатуры.ГруппаФинансовогоУчета;
				НовыйЭлемент.ВестиУчетПоГТД					= РеквизитыВидаНоменклатуры.ВестиУчетПоГТД;
				НовыйЭлемент.ПодакцизныйТовар				= РеквизитыВидаНоменклатуры.ПодакцизныйТовар;
				НовыйЭлемент.ОблагаетсяНДСУПокупателя		= РеквизитыВидаНоменклатуры.ОблагаетсяНДСУПокупателя;
				НовыйЭлемент.КодРаздел7ДекларацииНДС		= РеквизитыВидаНоменклатуры.КодРаздел7ДекларацииНДС;
				НовыйЭлемент.ВидАлкогольнойПродукции		= РеквизитыВидаНоменклатуры.ВидАлкогольнойПродукции;
				НовыйЭлемент.ИмпортнаяАлкогольнаяПродукция	= РеквизитыВидаНоменклатуры.ИмпортнаяАлкогольнаяПродукция;
				НовыйЭлемент.Крепость						= РеквизитыВидаНоменклатуры.Крепость;
				НовыйЭлемент.ОбособленнаяЗакупкаПродажа		= РеквизитыВидаНоменклатуры.ОбособленнаяЗакупкаПродажа;
				НовыйЭлемент.СпособОбеспеченияПотребностей	= РеквизитыВидаНоменклатуры.СпособОбеспеченияПотребностей;
				НовыйЭлемент.СхемаОбеспечения				= РеквизитыВидаНоменклатуры.СхемаОбеспечения;
				НовыйЭлемент.СезоннаяГруппа					= РеквизитыВидаНоменклатуры.СезоннаяГруппа;
				НовыйЭлемент.ЦеноваяГруппа					= РеквизитыВидаНоменклатуры.ЦеноваяГруппа;
				НовыйЭлемент.ШаблонЦенника					= РеквизитыВидаНоменклатуры.ШаблонЦенника;
				НовыйЭлемент.ШаблонЭтикетки					= РеквизитыВидаНоменклатуры.ШаблонЭтикетки;
								
				Если УстановитьСтавкуНДС Тогда
					
					НовыйЭлемент.СтавкаНДС = РеквизитыВидаНоменклатуры.СтавкаНДС;
					
				Иначе	
					
					НовыйЭлемент.СтавкаНДС = СтрокаТабличнойЧасти.СтавкаНДС; 
					
				КонецЕсли;
				
				Если РеквизитыВидаНоменклатуры.ИспользоватьУпаковки Тогда 
					
					НовыйЭлемент.ИспользоватьУпаковки	= РеквизитыВидаНоменклатуры.ИспользоватьУпаковки;
					НовыйЭлемент.НаборУпаковок			= РеквизитыВидаНоменклатуры.НаборУпаковок;	
					
				КонецЕсли;				 
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Вес) Тогда 
					
					НовыйЭлемент.ВесИспользовать		= Истина;
					НовыйЭлемент.ВесЗнаменатель			= 1;
					НовыйЭлемент.ВесЧислитель			= СтрокаТабличнойЧасти.Вес;
					НовыйЭлемент.ВесЕдиницаИзмерения	= СтрокаТабличнойЧасти.ЕдИзмеренияВеса;
					
				КонецЕсли;		
				
				
				Попытка
					
					НовыйЭлемент.Записать();
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при создании номенклатуры - %1 
												|Подробное описание ошибки можно посмотреть в журнале регистрации.", СтрокаТабличнойЧасти.НаименованиеТовара);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при создании номенклатуры с артикулом: %1, названием: %2 и номером строки: %3", 
											  				СтрокаТабличнойЧасти.Артикул, СтрокаТабличнойЧасти.НаименованиеТовара, СтрокаТабличнойЧасти.НомерСтроки), 
											   					УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);		
				               				
				КонецПопытки;
				
				НайтиНоменклатуру = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
								
				СтрокаТабличнойЧасти.Номенклатура 	= НайтиНоменклатуру;
				СтрокаТабличнойЧасти.Упаковка 		= НайтиНоменклатуру.ЕдиницаИзмерения;
				
				ДобавитьШтрихкод(НайтиНоменклатуру, СтрокаТабличнойЧасти.Штрихкод, СтрокаТабличнойЧасти.Характеристика, 
								СтрокаТабличнойЧасти.Упаковка, СтрокаТабличнойЧасти.НомерСтроки, СтрокаТабличнойЧасти.Артикул);
				
				Если Не ПустаяСтрока(СтрокаТабличнойЧасти.КартинкаТовара) Тогда
					
					ЗагрузитьИзображение(НайтиНоменклатуру, СтрокаТабличнойЧасти.КартинкаТовара, СтрокаТабличнойЧасти.Артикул);
					
				КонецЕсли; 
				
			КонецЦикла;	
		//Ozon							
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		//WB			
			Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
			
				Если СтрокаТабличнойЧасти.ИзменитьПозицию = Ложь Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ПустаяСтрока(СтрокаТабличнойЧасти.Артикул) Тогда
				
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Номенклатура не создана, в строке - %1 не заполнен артикул.", СтрокаТабличнойЧасти.НомерСтроки);
					Сообщение.Сообщить();
					
					Продолжить;	
				
				КонецЕсли;
				
				Если СоздаватьНоменклатуруОтдельноДляКаждогоРазмера Тогда
				
					НаименованиеТовара 	= СтрШаблон("%1-%2", СтрокаТабличнойЧасти.НаименованиеТовара, СтрокаТабличнойЧасти.Размер);
					Артикул				= СтрШаблон("%1-%2", СтрокаТабличнойЧасти.Артикул, СтрокаТабличнойЧасти.Размер);
					
					ПоискЭлемента = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
					
					Если ПоискЭлемента <> Справочники.Номенклатура.ПустаяСсылка() Тогда
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Номенклатура с артикулом - %1 уже существует!", Артикул);
						Сообщение.Сообщить();
						
						Продолжить;
						
					КонецЕсли;
														
					НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
					
					НовыйЭлемент.Наименование					= НаименованиеТовара;
					НовыйЭлемент.Артикул						= Артикул;
					НовыйЭлемент.ВидНоменклатуры				= ВидНоменклатуры;
					НовыйЭлемент.СтавкаНДС						= РеквизитыВидаНоменклатуры.СтавкаНДС;
					НовыйЭлемент.ТипНоменклатуры				= РеквизитыВидаНоменклатуры.ТипНоменклатуры;
					НовыйЭлемент.ИспользованиеХарактеристик		= РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик;
					НовыйЭлемент.ВариантОформленияПродажи		= РеквизитыВидаНоменклатуры.ВариантОформленияПродажи;
					НовыйЭлемент.ЕдиницаИзмерения				= РеквизитыВидаНоменклатуры.ЕдиницаИзмерения;
					НовыйЭлемент.Качество						= Перечисления.ГрадацииКачества.Новый;
					НовыйЭлемент.КодОКВЭД						= РеквизитыВидаНоменклатуры.КодОКВЭД;
					НовыйЭлемент.КодОКП							= РеквизитыВидаНоменклатуры.КодОКП;
		  			НовыйЭлемент.КодОКВЭД2						= РеквизитыВидаНоменклатуры.КодОКВЭД2;
					НовыйЭлемент.КодОКПД2						= РеквизитыВидаНоменклатуры.КодОКПД2;
					НовыйЭлемент.КодТНВЭД						= РеквизитыВидаНоменклатуры.КодТНВЭД;
					НовыйЭлемент.СкладскаяГруппа				= РеквизитыВидаНоменклатуры.СкладскаяГруппа;
					НовыйЭлемент.ГруппаАналитическогоУчета		= РеквизитыВидаНоменклатуры.ГруппаАналитическогоУчета;
					НовыйЭлемент.ГруппаФинансовогоУчета			= РеквизитыВидаНоменклатуры.ГруппаФинансовогоУчета;
					НовыйЭлемент.ВестиУчетПоГТД					= РеквизитыВидаНоменклатуры.ВестиУчетПоГТД;
					НовыйЭлемент.ПодакцизныйТовар				= РеквизитыВидаНоменклатуры.ПодакцизныйТовар;
					НовыйЭлемент.ОблагаетсяНДСУПокупателя		= РеквизитыВидаНоменклатуры.ОблагаетсяНДСУПокупателя;
					НовыйЭлемент.КодРаздел7ДекларацииНДС		= РеквизитыВидаНоменклатуры.КодРаздел7ДекларацииНДС;
					НовыйЭлемент.ВидАлкогольнойПродукции		= РеквизитыВидаНоменклатуры.ВидАлкогольнойПродукции;
					НовыйЭлемент.ИмпортнаяАлкогольнаяПродукция	= РеквизитыВидаНоменклатуры.ИмпортнаяАлкогольнаяПродукция;
					НовыйЭлемент.Крепость						= РеквизитыВидаНоменклатуры.Крепость;
					НовыйЭлемент.ОбособленнаяЗакупкаПродажа		= РеквизитыВидаНоменклатуры.ОбособленнаяЗакупкаПродажа;
					НовыйЭлемент.СпособОбеспеченияПотребностей	= РеквизитыВидаНоменклатуры.СпособОбеспеченияПотребностей;
					НовыйЭлемент.СхемаОбеспечения				= РеквизитыВидаНоменклатуры.СхемаОбеспечения;
					НовыйЭлемент.СезоннаяГруппа					= РеквизитыВидаНоменклатуры.СезоннаяГруппа;
					НовыйЭлемент.ЦеноваяГруппа					= РеквизитыВидаНоменклатуры.ЦеноваяГруппа;
					НовыйЭлемент.ШаблонЦенника					= РеквизитыВидаНоменклатуры.ШаблонЦенника;
					НовыйЭлемент.ШаблонЭтикетки					= РеквизитыВидаНоменклатуры.ШаблонЭтикетки;
									
					Если РеквизитыВидаНоменклатуры.ИспользоватьУпаковки Тогда 
						
						НовыйЭлемент.ИспользоватьУпаковки	= РеквизитыВидаНоменклатуры.ИспользоватьУпаковки;
						НовыйЭлемент.НаборУпаковок			= РеквизитыВидаНоменклатуры.НаборУпаковок;	
						
					КонецЕсли;
						
					Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Вес) Тогда 
						
						НовыйЭлемент.ВесИспользовать		= Истина;
						НовыйЭлемент.ВесЗнаменатель			= 1;
						НовыйЭлемент.ВесЧислитель			= СтрокаТабличнойЧасти.Вес;
						НовыйЭлемент.ВесЕдиницаИзмерения	= СтрокаТабличнойЧасти.ЕдИзмеренияВеса;
						
					КонецЕсли;	
					
					Попытка
						
						НовыйЭлемент.Записать(); 						
						
					Исключение
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Ошибка при создании номенклатуры - %1 
													|Подробное описание ошибки можно посмотреть в журнале регистрации.", НаименованиеТовара);
						Сообщение.Сообщить();
						
						ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при создании номенклатуры с артикулом: %1, названием: %2 и номером строки: %3", 
												  				Артикул, НаименованиеТовара, СтрокаТабличнойЧасти.НомерСтроки), 
												   					УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);		
					КонецПопытки;
					
					НайтиНоменклатуру 	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
					НайтиХарактеристику	= ПолучитьХарактеристику(СтрокаТабличнойЧасти.Размер, ВидНоменклатуры, НайтиНоменклатуру, Истина);
								
					СтрокаТабличнойЧасти.Номенклатура 	= НайтиНоменклатуру;
					СтрокаТабличнойЧасти.Упаковка 		= НайтиНоменклатуру.ЕдиницаИзмерения;
					СтрокаТабличнойЧасти.Характеристика	= НайтиХарактеристику; 
					
					ДобавитьШтрихкод(НайтиНоменклатуру, СтрокаТабличнойЧасти.Штрихкод, НайтиХарактеристику, 
										СтрокаТабличнойЧасти.Упаковка, СтрокаТабличнойЧасти.НомерСтроки, Артикул);
					
					Если Не ПустаяСтрока(СтрокаТабличнойЧасти.КартинкаТовара) Тогда
						
						ЗагрузитьИзображение(НайтиНоменклатуру, СтрокаТабличнойЧасти.КартинкаТовара, Артикул);
						
					КонецЕсли;
					
				Иначе
					
					ПоискПоАртикулуНоменклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
					
					Если ПоискПоАртикулуНоменклатуры = Справочники.Номенклатура.ПустаяСсылка() Тогда
		
						НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
						
						НовыйЭлемент.Наименование					= СтрокаТабличнойЧасти.НаименованиеТовара;
						НовыйЭлемент.Артикул						= СтрокаТабличнойЧасти.Артикул;
						НовыйЭлемент.ВидНоменклатуры				= ВидНоменклатуры;
						НовыйЭлемент.СтавкаНДС                     	= РеквизитыВидаНоменклатуры.СтавкаНДС;
						НовыйЭлемент.ТипНоменклатуры				= РеквизитыВидаНоменклатуры.ТипНоменклатуры;
						НовыйЭлемент.ИспользованиеХарактеристик		= РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик;
						НовыйЭлемент.ВариантОформленияПродажи		= РеквизитыВидаНоменклатуры.ВариантОформленияПродажи;
						НовыйЭлемент.ЕдиницаИзмерения				= РеквизитыВидаНоменклатуры.ЕдиницаИзмерения;
						НовыйЭлемент.Качество						= Перечисления.ГрадацииКачества.Новый;
						НовыйЭлемент.КодОКВЭД						= РеквизитыВидаНоменклатуры.КодОКВЭД;
						НовыйЭлемент.КодОКП							= РеквизитыВидаНоменклатуры.КодОКП;
			  			НовыйЭлемент.КодОКВЭД2						= РеквизитыВидаНоменклатуры.КодОКВЭД2;
						НовыйЭлемент.КодОКПД2  						= РеквизитыВидаНоменклатуры.КодОКПД2;
						НовыйЭлемент.КодТНВЭД						= РеквизитыВидаНоменклатуры.КодТНВЭД;
						НовыйЭлемент.СкладскаяГруппа				= РеквизитыВидаНоменклатуры.СкладскаяГруппа;
						НовыйЭлемент.ГруппаАналитическогоУчета		= РеквизитыВидаНоменклатуры.ГруппаАналитическогоУчета;
						НовыйЭлемент.ГруппаФинансовогоУчета			= РеквизитыВидаНоменклатуры.ГруппаФинансовогоУчета;
						НовыйЭлемент.ВестиУчетПоГТД					= РеквизитыВидаНоменклатуры.ВестиУчетПоГТД;
						НовыйЭлемент.ПодакцизныйТовар				= РеквизитыВидаНоменклатуры.ПодакцизныйТовар;
						НовыйЭлемент.ОблагаетсяНДСУПокупателя		= РеквизитыВидаНоменклатуры.ОблагаетсяНДСУПокупателя;
						НовыйЭлемент.КодРаздел7ДекларацииНДС		= РеквизитыВидаНоменклатуры.КодРаздел7ДекларацииНДС;
						НовыйЭлемент.ВидАлкогольнойПродукции		= РеквизитыВидаНоменклатуры.ВидАлкогольнойПродукции;
						НовыйЭлемент.ИмпортнаяАлкогольнаяПродукция	= РеквизитыВидаНоменклатуры.ИмпортнаяАлкогольнаяПродукция;
						НовыйЭлемент.Крепость						= РеквизитыВидаНоменклатуры.Крепость;
						НовыйЭлемент.ОбособленнаяЗакупкаПродажа		= РеквизитыВидаНоменклатуры.ОбособленнаяЗакупкаПродажа;
						НовыйЭлемент.СпособОбеспеченияПотребностей	= РеквизитыВидаНоменклатуры.СпособОбеспеченияПотребностей;
						НовыйЭлемент.СхемаОбеспечения				= РеквизитыВидаНоменклатуры.СхемаОбеспечения;
						НовыйЭлемент.СезоннаяГруппа					= РеквизитыВидаНоменклатуры.СезоннаяГруппа;
						НовыйЭлемент.ЦеноваяГруппа					= РеквизитыВидаНоменклатуры.ЦеноваяГруппа;
						НовыйЭлемент.ШаблонЦенника					= РеквизитыВидаНоменклатуры.ШаблонЦенника;
						НовыйЭлемент.ШаблонЭтикетки					= РеквизитыВидаНоменклатуры.ШаблонЭтикетки;
						
						Если РеквизитыВидаНоменклатуры.ИспользоватьУпаковки Тогда 
							
							НовыйЭлемент.ИспользоватьУпаковки	= РеквизитыВидаНоменклатуры.ИспользоватьУпаковки;
							НовыйЭлемент.НаборУпаковок			= РеквизитыВидаНоменклатуры.НаборУпаковок;	
							
						КонецЕсли;	 
						  		
						Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Вес) Тогда 
							
							НовыйЭлемент.ВесИспользовать		= Истина;
							НовыйЭлемент.ВесЗнаменатель			= 1;
							НовыйЭлемент.ВесЧислитель			= СтрокаТабличнойЧасти.Вес;
							НовыйЭлемент.ВесЕдиницаИзмерения	= СтрокаТабличнойЧасти.ЕдИзмеренияВеса;
							
						КонецЕсли;	
											
						Попытка
							
							НовыйЭлемент.Записать(); 
				             				
						Исключение
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Ошибка при создании номенклатуры - %1 
														|Подробное описание ошибки можно посмотреть в журнале регистрации.", СтрокаТабличнойЧасти.НаименованиеТовара);
							Сообщение.Сообщить();
							
							ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при создании номенклатуры с артикулом: %1, названием: %2 и номером строки: %3", 
													  				СтрокаТабличнойЧасти.Артикул, СтрокаТабличнойЧасти.НаименованиеТовара, СтрокаТабличнойЧасти.НомерСтроки), 
													   					УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);		
						КонецПопытки;
																	
						НайтиНоменклатуру 	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
						НайтиХарактеристику = ПолучитьХарактеристику(СтрокаТабличнойЧасти.Размер, ВидНоменклатуры, НайтиНоменклатуру, Истина);	
								
						СтрокаТабличнойЧасти.Номенклатура 	= НайтиНоменклатуру;
						СтрокаТабличнойЧасти.Упаковка 		= НайтиНоменклатуру.ЕдиницаИзмерения;
						СтрокаТабличнойЧасти.Характеристика	= НайтиХарактеристику;
						
						ДобавитьШтрихкод(НайтиНоменклатуру, СтрокаТабличнойЧасти.Штрихкод, НайтиХарактеристику, 
											СтрокаТабличнойЧасти.Упаковка,СтрокаТабличнойЧасти.НомерСтроки, СтрокаТабличнойЧасти.Артикул);
																	
						Если Не ПустаяСтрока(СтрокаТабличнойЧасти.КартинкаТовара) Тогда
							
							ЗагрузитьИзображение(НайтиНоменклатуру, СтрокаТабличнойЧасти.КартинкаТовара, СтрокаТабличнойЧасти.Артикул);
							
						КонецЕсли;
						
					Иначе
						
						Характеристика = ПолучитьХарактеристику(СтрокаТабличнойЧасти.Размер, ВидНоменклатуры, ПоискПоАртикулуНоменклатуры, Истина);
						ДобавитьШтрихкод(ПоискПоАртикулуНоменклатуры, СтрокаТабличнойЧасти.Штрихкод, Характеристика, ПоискПоАртикулуНоменклатуры.ЕдиницаИзмерения, 
											СтрокаТабличнойЧасти.НомерСтроки, СтрокаТабличнойЧасти.Артикул); 
							
						СтрокаТабличнойЧасти.Номенклатура 	= ПоискПоАртикулуНоменклатуры;
						СтрокаТабличнойЧасти.Упаковка 		= ПоискПоАртикулуНоменклатуры.ЕдиницаИзмерения;
						СтрокаТабличнойЧасти.Характеристика	= Характеристика;					

					КонецЕсли;					
					
				КонецЕсли;	
				
			КонецЦикла; 
		//WB			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет  Тогда 
		//ЯМ		
			Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
				
				Если СтрокаТабличнойЧасти.ИзменитьПозицию = Ложь Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				Если ПустаяСтрока(СтрокаТабличнойЧасти.Артикул) Тогда
				
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Номенклатура не создана, в строке - %1 не заполнен артикул.", СтрокаТабличнойЧасти.НомерСтроки);
					Сообщение.Сообщить();
					
					Продолжить;	
				
				КонецЕсли;
				
				ПоискЭлемента = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
				
				Если ПоискЭлемента <> Справочники.Номенклатура.ПустаяСсылка() Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Номенклатура с артикулом - %1 уже существует!", СтрокаТабличнойЧасти.Артикул);
					Сообщение.Сообщить(); 
					
					Продолжить;
					
				КонецЕсли;
				
				НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
				
				НовыйЭлемент.Наименование					= СтрокаТабличнойЧасти.НаименованиеТовара;
				НовыйЭлемент.Артикул						= СтрокаТабличнойЧасти.Артикул;
				НовыйЭлемент.ВидНоменклатуры				= ВидНоменклатуры;
				НовыйЭлемент.СтавкаНДС						= РеквизитыВидаНоменклатуры.СтавкаНДС;
				НовыйЭлемент.ТипНоменклатуры				= РеквизитыВидаНоменклатуры.ТипНоменклатуры;
				НовыйЭлемент.ИспользованиеХарактеристик		= РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик;
				НовыйЭлемент.ВариантОформленияПродажи		= РеквизитыВидаНоменклатуры.ВариантОформленияПродажи;
				НовыйЭлемент.ЕдиницаИзмерения				= РеквизитыВидаНоменклатуры.ЕдиницаИзмерения;
				НовыйЭлемент.Качество						= Перечисления.ГрадацииКачества.Новый;
				НовыйЭлемент.КодОКВЭД						= РеквизитыВидаНоменклатуры.КодОКВЭД;
				НовыйЭлемент.КодОКП							= РеквизитыВидаНоменклатуры.КодОКП;
	  			НовыйЭлемент.КодОКВЭД2						= РеквизитыВидаНоменклатуры.КодОКВЭД2;
				НовыйЭлемент.КодОКПД2  						= РеквизитыВидаНоменклатуры.КодОКПД2;
				НовыйЭлемент.КодТНВЭД						= РеквизитыВидаНоменклатуры.КодТНВЭД;
				НовыйЭлемент.СкладскаяГруппа				= РеквизитыВидаНоменклатуры.СкладскаяГруппа;
				НовыйЭлемент.ГруппаАналитическогоУчета		= РеквизитыВидаНоменклатуры.ГруппаАналитическогоУчета;
				НовыйЭлемент.ГруппаФинансовогоУчета			= РеквизитыВидаНоменклатуры.ГруппаФинансовогоУчета;
				НовыйЭлемент.ВестиУчетПоГТД 				= РеквизитыВидаНоменклатуры.ВестиУчетПоГТД;
				НовыйЭлемент.ПодакцизныйТовар				= РеквизитыВидаНоменклатуры.ПодакцизныйТовар;
				НовыйЭлемент.ОблагаетсяНДСУПокупателя		= РеквизитыВидаНоменклатуры.ОблагаетсяНДСУПокупателя;
				НовыйЭлемент.КодРаздел7ДекларацииНДС		= РеквизитыВидаНоменклатуры.КодРаздел7ДекларацииНДС;
				НовыйЭлемент.ВидАлкогольнойПродукции		= РеквизитыВидаНоменклатуры.ВидАлкогольнойПродукции;
				НовыйЭлемент.ИмпортнаяАлкогольнаяПродукция	= РеквизитыВидаНоменклатуры.ИмпортнаяАлкогольнаяПродукция;
				НовыйЭлемент.Крепость						= РеквизитыВидаНоменклатуры.Крепость;
				НовыйЭлемент.ОбособленнаяЗакупкаПродажа		= РеквизитыВидаНоменклатуры.ОбособленнаяЗакупкаПродажа;
				НовыйЭлемент.СпособОбеспеченияПотребностей	= РеквизитыВидаНоменклатуры.СпособОбеспеченияПотребностей;
				НовыйЭлемент.СхемаОбеспечения				= РеквизитыВидаНоменклатуры.СхемаОбеспечения;
				НовыйЭлемент.СезоннаяГруппа					= РеквизитыВидаНоменклатуры.СезоннаяГруппа;
				НовыйЭлемент.ЦеноваяГруппа					= РеквизитыВидаНоменклатуры.ЦеноваяГруппа;
				НовыйЭлемент.ШаблонЦенника					= РеквизитыВидаНоменклатуры.ШаблонЦенника;
				НовыйЭлемент.ШаблонЭтикетки					= РеквизитыВидаНоменклатуры.ШаблонЭтикетки;

								
				Если РеквизитыВидаНоменклатуры.ИспользоватьУпаковки Тогда 
					
					НовыйЭлемент.ИспользоватьУпаковки	= РеквизитыВидаНоменклатуры.ИспользоватьУпаковки;
					НовыйЭлемент.НаборУпаковок			= РеквизитыВидаНоменклатуры.НаборУпаковок;	
					
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Вес) Тогда 
					
					НовыйЭлемент.ВесИспользовать		= Истина;
					НовыйЭлемент.ВесЗнаменатель			= 1;
					НовыйЭлемент.ВесЧислитель			= СтрокаТабличнойЧасти.Вес;
					НовыйЭлемент.ВесЕдиницаИзмерения	= СтрокаТабличнойЧасти.ЕдИзмеренияВеса;
					
				КонецЕсли;			
	
				Попытка
					
					НовыйЭлемент.Записать();
			
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при создании номенклатуры - %1 
												|Подробное описание ошибки можно посмотреть в журнале регистрации.", СтрокаТабличнойЧасти.НаименованиеТовара);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при создании номенклатуры с артикулом: %1, названием: %2 и номером строки: %3", 
											  				СтрокаТабличнойЧасти.Артикул, СтрокаТабличнойЧасти.НаименованиеТовара, СтрокаТабличнойЧасти.НомерСтроки), 
											   					УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);					
				КонецПопытки;
				
				НайтиНоменклатуру = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТабличнойЧасти.Артикул);
							
				СтрокаТабличнойЧасти.Номенклатура 	= НайтиНоменклатуру;
				СтрокаТабличнойЧасти.Упаковка 		= НайтиНоменклатуру.ЕдиницаИзмерения;
				
				ДобавитьШтрихкод(НайтиНоменклатуру, СтрокаТабличнойЧасти.Штрихкод, СтрокаТабличнойЧасти.Характеристика, 
									СтрокаТабличнойЧасти.Упаковка, СтрокаТабличнойЧасти.НомерСтроки, СтрокаТабличнойЧасти.Артикул);  
				
				Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.КартинкаТовара) Тогда
					
					ЗагрузитьИзображение(НайтиНоменклатуру, СтрокаТабличнойЧасти.КартинкаТовара, СтрокаТабличнойЧасти.Артикул);
					
				КонецЕсли;
					
			КонецЦикла;
		//ЯМ	
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ТабличнаяЧасть;

КонецФункции // СохранитьНоменклатуру
	
#КонецОбласти

#Область СопоставитьНоменклатуру

Функция СопоставитьНоменклатуру(ТоварыКСопоставлению, АккаунтМаркетплейса) Экспорт

	ВыбранныеСтроки = ТоварыКСопоставлению.НайтиСтроки(Новый Структура("ИзменитьПозицию", Истина));
	Маркетплейс		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для сопоставления номенклатуры";
		Сообщение.Сообщить();
         	
	Иначе
			
		Для каждого Стр Из ВыбранныеСтроки Цикл
			
			Если Стр.ИзменитьПозицию = Ложь Тогда
					
					Продолжить;	
					
				КонецЕсли;
		
			Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда			
			   		
				Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Аккаунт			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.IDТовара			  = Стр.IDТовара;
					МенеджерЗаписи.Артикул			  = Стр.Артикул;
					МенеджерЗаписи.Баракод			  = Стр.Штрихкод;
					МенеджерЗаписи.Размер 			  = Стр.Размер;
					МенеджерЗаписи.IDРазмера          = Стр.IDРазмера;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не удалось сопоставить номенклатуру так как не указано значение в поле 'Упаковка' для товара 
						|с артикулом: %1 и названием: %2 и номером строки: %3", Стр.Артикул, Стр.НаименованиеТовара, Стр.НомерСтроки);
						Сообщение.Сообщить();
						
						Продолжить;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара 				= Стр.НаименованиеТовара;
					МенеджерЗаписи.ВозможностьСменыЦенДляРазмеров	= Стр.ВозможностьСменыЦенДляРазмеров;
					
				ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет  Тогда
					
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Аккаунт 			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.SKUТовара 		  = Стр.SKUТовара;
					МенеджерЗаписи.Артикул 			  = Стр.Артикул;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
					
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не удалось сопоставить номенклатуру так как не указано значение в поле 'Упаковка' для товара 
						|с артикулом: %1 и названием: %2 и номером строки: %3", Стр.Артикул, Стр.НаименованиеТовара, Стр.НомерСтроки);
						Сообщение.Сообщить();
						
						Продолжить;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара = Стр.НаименованиеТовара;
					
				ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON  Тогда
				
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьМенеджерЗаписи();	
				    МенеджерЗаписи.Аккаунт			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.IDТовара			  = Стр.IDТовара;
					МенеджерЗаписи.SKUТовара 		  = Стр.SKUТовара;
					МенеджерЗаписи.Артикул			  = Стр.Артикул;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
					
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не удалось сопоставить номенклатуру так как не указано значение в поле 'Упаковка' для товара 
						|с артикулом: %1 и названием: %2 и номером строки: %3", Стр.Артикул, Стр.НаименованиеТовара, Стр.НомерСтроки);
						Сообщение.Сообщить();
						
						Продолжить;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара = Стр.НаименованиеТовара;	
					
				КонецЕсли;
				
				Попытка
				
					МенеджерЗаписи.Записать();
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении товара с артикулом: %1 и названием: %2. 
												|Продробную ошибку можно посмотреть в журнале регистрации", 
												Стр.Артикул, Стр.НаименованиеТовара);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при сопоставлении товара с артикулом: %1, названием: %2 и номером строки: %3", 
														Стр.Артикул, Стр.НаименованиеТовара, Стр.НомерСтроки), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
				
				КонецПопытки;
				    			
			
			Иначе
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось сопоставить номенклатуру так как не указано значение в поле 'Номенклатура' для товара 
											|с артикулом: %1, названием: %2  и номером строки: %3", Стр.Артикул, Стр.НаименованиеТовара, Стр.НомерСтроки);
				Сообщение.Сообщить();	
			
			КонецЕсли;
		
		КонецЦикла;

	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СопостовлениеНДС_Ozon(СтавкаНДС)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("20.00",	Справочники.СтавкиНДС.НайтиПоНаименованию("20%"));
	Соответствие.Вставить("6.00", 	Справочники.СтавкиНДС.НайтиПоНаименованию("6%"));
	Соответствие.Вставить("0.00", 	Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС"));	
	Соответствие.Вставить("10.00", 	Справочники.СтавкиНДС.НайтиПоНаименованию("10%"));
	Соответствие.Вставить("16.67", 	Справочники.СтавкиНДС.НайтиПоНаименованию("16,67%"));
	Соответствие.Вставить("5.00", 	Справочники.СтавкиНДС.НайтиПоНаименованию("5%"));
	Соответствие.Вставить("7.00", 	Справочники.СтавкиНДС.НайтиПоНаименованию("7%"));
	Соответствие.Вставить("9.09", 	Справочники.СтавкиНДС.НайтиПоНаименованию("9,09%"));
	
	СтавкаНДС = Соответствие[СтавкаНДС];
	
	Возврат СтавкаНДС;	
	
КонецФункции

Функция СопостовлениеВеса(ЕдИзмеренияВеса)
	
	Соответствие = Новый Соответствие;      
	Соответствие.Вставить("g",		Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("г"));
	Соответствие.Вставить("kg", 	Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("кг"));
	Соответствие.Вставить("t", 		Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("т"));	
	Соответствие.Вставить("mg", 	Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("мг"));
	
	СтавкаНДС = Соответствие[ЕдИзмеренияВеса];
	
	Возврат СтавкаНДС;	
	
КонецФункции 

Процедура ЗагрузитьИзображение(Номенклатура, АдресКартинки, Артикул)
	
	Адрес 				= ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(АдресКартинки);
	ПутьКФайлу 			= Адрес.Путь;
	ПоискТочки			= СтрНайти(АдресКартинки, ".", НаправлениеПоиска.СКонца);
	РасширениеБезТочки	= Прав(АдресКартинки, СтрДлина(АдресКартинки) - ПоискТочки);	
	Файл 				= Новый Файл(ПутьКФайлу);	
		
	Попытка
		
		ПараметрыФайла 								= РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.ВладелецФайлов 				= Номенклатура;
		ПараметрыФайла.ВремяИзмененияУниверсальное 	= Файл.ПолучитьУниверсальноеВремяИзменения();
		ПараметрыФайла.ИмяБезРасширения 			= "КартинкаТовара";
		ПараметрыФайла.РасширениеБезТочки 			= РасширениеБезТочки;
		
		ДвоичныеДанные 					= Новый ДвоичныеДанные(ПутьКФайлу);
		АдресФайлаВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайлаВоВременномХранилище, "");
		
		НоменклатураОбъект 				= Номенклатура.ПолучитьОбъект(); 		
		НоменклатураОбъект.ФайлКартинки = ПрисоединенныйФайл;
		НоменклатураОбъект.Записать();			
		
		УдалитьФайлы(АдресФайлаВоВременномХранилище);
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("При добавлении изображения товара - %1  произошла ощибка. 
									|Подробное описание ошибки можно посмотреть в журнале регистрации.",	Номенклатура);
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при добавлении изображения товара с артикулом: %1 и названием: %2", 
											Артикул, Номенклатура), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьРеквизитыВидаНоменклатуры(ВидНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ                                             
		|	ВидыНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВидыНоменклатуры.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	ВидыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыНоменклатуры.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
		|	ВидыНоменклатуры.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
		|	ВидыНоменклатуры.НаборУпаковок КАК НаборУпаковок,
		|	ВидыНоменклатуры.СтавкаНДС КАК СтавкаНДС,
		|	ВидыНоменклатуры.КодОКВЭД КАК КодОКВЭД,
		|	ВидыНоменклатуры.КодОКП КАК КодОКП,
		|	ВидыНоменклатуры.КодОКВЭД2 КАК КодОКВЭД2,
		|	ВидыНоменклатуры.КодОКПД2 КАК КодОКПД2,
		|	ВидыНоменклатуры.КодТНВЭД КАК КодТНВЭД,
		|	ВидыНоменклатуры.СкладскаяГруппа КАК СкладскаяГруппа,
		|	ВидыНоменклатуры.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
		|	ВидыНоменклатуры.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	ВидыНоменклатуры.ВестиУчетПоГТД КАК ВестиУчетПоГТД,
		|	ВидыНоменклатуры.ПодакцизныйТовар КАК ПодакцизныйТовар,
		|	ВидыНоменклатуры.ОблагаетсяНДСУПокупателя КАК ОблагаетсяНДСУПокупателя,
		|	ВидыНоменклатуры.КодРаздел7ДекларацииНДС КАК КодРаздел7ДекларацииНДС,
		|	ВидыНоменклатуры.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
		|	ВидыНоменклатуры.Крепость КАК Крепость,
		|	ВидыНоменклатуры.ОбособленнаяЗакупкаПродажа КАК ОбособленнаяЗакупкаПродажа,
		|	ВидыНоменклатуры.СпособОбеспеченияПотребностей КАК СпособОбеспеченияПотребностей,
		|	ВидыНоменклатуры.СхемаОбеспечения КАК СхемаОбеспечения,
		|	ВидыНоменклатуры.СезоннаяГруппа КАК СезоннаяГруппа,
		|	ВидыНоменклатуры.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВидыНоменклатуры.ШаблонЦенника КАК ШаблонЦенника,
		|	ВидыНоменклатуры.ШаблонЭтикетки КАК ШаблонЭтикетки,
		|	ВидыНоменклатуры.ИмпортнаяАлкогольнаяПродукция КАК ИмпортнаяАлкогольнаяПродукция
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.Ссылка = &СсылкаНаВидНоменклатуры";
	
	Запрос.УстановитьПараметр("СсылкаНаВидНоменклатуры", ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;	

КонецФункции // ПолучитьРеквизитыВидаНоменклатуры()

Функция ПолучитьХарактеристику(Размер, ВидНоменклатуры, Номенклатура, СоздаватьХарактеристику)
	
	ХарактеристикаИндивидуальнаяДляНоменклатуры = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры;
	
	Если ВидНоменклатуры.ИспользоватьХарактеристики = Истина Тогда
	
		Если ВидНоменклатуры.ИспользованиеХарактеристик <> ХарактеристикаИндивидуальнаяДляНоменклатуры Тогда
			
			ПоискХарактеристики 			= Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(Размер, Истина, , ВидНоменклатуры);		
			ПоискХарактеристикиСРазмером	= Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("Размер " + Размер, Истина, , ВидНоменклатуры);
			
			Если ПоискХарактеристики = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() 
					И ПоискХарактеристикиСРазмером = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()  
						И СоздаватьХарактеристику Тогда
				// Создаем новую характеристику
				НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
				НоваяХарактеристика.Наименование	= "Размер " + Размер;
				НоваяХарактеристика.Владелец		= ВидНоменклатуры;
				НоваяХарактеристика.Записать();
				
				Возврат НоваяХарактеристика.Ссылка;
				
			ИначеЕсли ЗначениеЗаполнено(ПоискХарактеристикиСРазмером) И ПоискХарактеристики = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
				
				Возврат ПоискХарактеристикиСРазмером;
				
			Иначе
				
				Возврат ПоискХарактеристики;
				
			КонецЕсли;
			
		Иначе
			
			ПоискХарактеристики 			= Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(Размер, Истина, , Номенклатура);		
			ПоискХарактеристикиСРазмером	= Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("Размер " + Размер, Истина, , Номенклатура);
			
			Если ПоискХарактеристики = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
					И ПоискХарактеристикиСРазмером = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() 
						И СоздаватьХарактеристику Тогда
				// Создаем новую характеристику
				НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
				НоваяХарактеристика.Наименование	= "Размер " + Размер;
				НоваяХарактеристика.Владелец		= Номенклатура;
				НоваяХарактеристика.Записать();
				
				Возврат НоваяХарактеристика.Ссылка;
				
			ИначеЕсли ЗначениеЗаполнено(ПоискХарактеристикиСРазмером) И ПоискХарактеристики = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
				
				Возврат ПоискХарактеристикиСРазмером;
				
			Иначе
				
				Возврат ПоискХарактеристики;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции

Процедура ДобавитьШтрихкод(Номенклатура, Штрихкод, Характеристика, Упаковка, НомерСтроки, Артикул)
	
	МенеджерЗаписиШтрихкод 					= РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписиШтрихкод.Штрихкод 		= Штрихкод;
	МенеджерЗаписиШтрихкод.Номенклатура 	= Номенклатура;
	МенеджерЗаписиШтрихкод.Характеристика	= Характеристика;
	МенеджерЗаписиШтрихкод.Упаковка			= Упаковка;
	
	Попытка
		
		МенеджерЗаписиШтрихкод.Записать();
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при добавлении штрихкода номенклатуры - %1. 
		|Подробное описание ошибки можно посмотреть в журнале регистрации.", Номенклатура);
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка добавления штрихкода для номенклатуры (артикул: %1, наименование: %2, строка %3) в регистр сведений 'ШтрихкодыНоменклатуры'",
		Артикул, Номенклатура, НомерСтроки), 
		УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

