// Установка связей параметров выбора характеристики и упаковки
//
// Параметры:
//  Форма			 - Форма	 - Форма, для которой нужно установить связи
//  ИмяТЧ			 - Строка	 - Название тч в документе
//  Характеристика	 - Строка	 - Название колонки в тч
//  Упаковка		 - Строка	 - Название колонки в тч
//
Процедура УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(Форма, ИмяТЧ, Характеристика, Упаковка) Экспорт

	ЭлементХарактеристика = Форма.Элементы.Найти(Характеристика);
	ЭлементУпаковка = Форма.Элементы.Найти(Упаковка);

	СвязиПараметровВыбора = Новый Массив;
	ПараметрыВыбораУпаковки = Новый Массив;

		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", СтрШаблон(
			"Элементы.%1.ТекущиеДанные.Номенклатура", ИмяТЧ), РежимИзмененияСвязанногоЗначения.Очищать));

	Если Не ЭлементХарактеристика = Неопределено Тогда
		ЭлементХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	КонецЕсли;

	Если Не ЭлементУпаковка = Неопределено Тогда
		ЭлементУпаковка.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
		//ЭлементУпаковка.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораУпаковки);
	КонецЕсли;
КонецПроцедуры