
&НаСервере
Процедура ЗагружатьВсюНоменклатуруВТСДПриИзмененииНаСервере()
	Константы.ЗагружатьВсюНоменклатуруВТСД.Установить(ЗагружатьВсюНоменклатуруВТСД);
	Если ЗагружатьВсюНоменклатуруВТСД Тогда
		Обмен.ЗарегистрироватьВсеОбъектыКОбменуДляВсехУзлов();    
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьВсюНоменклатуруВТСДПриИзменении(Элемент)
	ЗагружатьВсюНоменклатуруВТСДПриИзмененииНаСервере();
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагружатьВсюНоменклатуруВТСД=Константы.ЗагружатьВсюНоменклатуруВТСД.Получить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.РегистрСведенийНоменклатураЗагруженнаяНаТСДОткрытьСписок.Доступность=НЕ ЗагружатьВсюНоменклатуруВТСД;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры


