
&Вместо("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура рар_мп_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)
	
	Если ТипЗнч(ИдентификаторКоманды) = Тип("ПеречислениеСсылка.рар_мп_ВидРегламентыхЗадач") Тогда
		
		Если ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_Ozon_ЗагрузкаЗаказов Тогда
			
			рар_мп_ЗагрузкаЗаказов.Ozon_ЗагрузкаЗаказов();
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_ЯндексМаркет_ЗагрузкаЗаказов Тогда
			
			рар_мп_ЗагрузкаЗаказов.ЯндексМаркет_ЗагрузкаЗаказов();
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_Wildberries_ЗагрузкаЗаказов Тогда
			
			рар_мп_ЗагрузкаЗаказов.Wildberries_ЗагрузкаЗаказов();
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_Ozon_ОбновлениеОстатков Тогда
			
			рар_мп_ОбновлениеОстатков.Ozon_ОбновлениеОстатков();     
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_ЯндексМаркет_ОбновлениеОстатков Тогда
			
			рар_мп_ОбновлениеОстатков.ЯндексМаркет_ОбновлениеОстатков(); 
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.рар_мп_ВидРегламентыхЗадач.рар_мп_Wildberries_ОбновлениеОстатков Тогда
			
			рар_мп_ОбновлениеОстатков.Wildberries_ОбновлениеОстатков();	 
			
		КонецЕсли; 
		
	Иначе        
		
		ПродолжитьВызов(ВнешняяОбработка, ИдентификаторКоманды);  
		
	КонецЕсли;  
	
КонецПроцедуры
