
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда 
		АдресПубликацииИнформационнойБазыДляТСД = Константы.АдресПубликацииИнформационнойБазыДляТСД.Получить();	
		ЛогинСервисы=Константы.ЛогинДляСервисов.Получить();	
		ПарольСервисы=РаботаСШифрованием.РасшифроватьСообщение(Константы.ПарольДляСервисов.Получить());
		Элементы.ГруппаНастройкиПодключения.Видимость=Истина;  
		//Элементы.ГруппаСтраницы.ОтображениеСтраниц=ОтображениеСтраницФормы.ЗакладкиСлеваГоризонтально;
	Иначе
		Элементы.ГруппаНастройкиПодключения.Видимость=Ложь;
		Элементы.ГруппаГрупповаяПечатьQRКодов.Видимость=Ложь;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц=ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	ОбновитьQRНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛогинПароль(Команда)
	Если ЗначениеЗаполнено(АдресПубликацииИнформационнойБазыДляТСД) И
			ЗначениеЗаполнено(ЛогинСервисы) И ЗначениеЗаполнено(ПарольСервисы) Тогда
		ПроверитьЛогинПарольНаСервере();
	Иначе  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните все поля!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьЛогинПарольНаСервере() 
	АдресWSDL=АдресПубликацииИнформационнойБазыДляТСД+?(Прав(АдресПубликацииИнформационнойБазыДляТСД,1)="/","","/")+"ws/MAExchange.1cws?wsdl";
	Протокол = "";
	Позиция = СтрНайти(АдресWSDL, "://");
	Если Позиция > 0 Тогда
		Протокол = НРег(Лев(АдресWSDL, Позиция - 1));
	КонецЕсли;
		
	Если Протокол = "https" Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	КонецЕсли;
	ИнтернетПрокси = Неопределено;
	
	Попытка 
 		WSОпределения = Новый WSОпределения(АдресWSDL, ЛогинСервисы, ПарольСервисы, ИнтернетПрокси, , ЗащищенноеСоединение);
		//ЗаписатьКонстанты();
		ОбщегоНазначения.СообщитьПользователю("Проверка пройдена!");
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Логин или пароль введены не верно!");
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ОбновитьQR(Команда)
	ОбновитьQRНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьQRНаСервере()
	Таблица.Очистить();
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();  
 	ВывестиQRПользователя(ПользовательИБ, Таблица);
КонецПроцедуры

&НаСервере
Процедура ВывестиQRПользователя(ПользовательИБ, ТабличныйДокумент)
	Макет=ПолучитьОбщийМакет("QRКодДляВхода");
	УстановитьПривилегированныйРежим(Истина);
	
	ПарольУстановлен=ПользовательИБ.ПарольУстановлен;
	Если НЕ ПарольУстановлен Тогда
		ОбластьОшибка = Макет.ПолучитьОбласть("ОшибкаПарольНеУстановлен");
		ТабличныйДокумент.Вывести(ОбластьОшибка);
		Возврат;
	КонецЕсли; 

	АдресПубликацииИнформационнойБазыДляТСД = Константы.АдресПубликацииИнформационнойБазыДляТСД.Получить();	
	ЛогинСервисы=Константы.ЛогинДляСервисов.Получить();	
	ПарольСервисы=РаботаСШифрованием.РасшифроватьСообщение(Константы.ПарольДляСервисов.Получить());

	Если АдресПубликацииИнформационнойБазыДляТСД = "" ИЛИ ЛогинСервисы = "" ИЛИ ПарольСервисы = "" Тогда
		ОбластьОшибка = Макет.ПолучитьОбласть("ОшибкаПользовательСервисаНеЗадан");
		ТабличныйДокумент.Вывести(ОбластьОшибка);
		Возврат;
	КонецЕсли; 

	Имя=ПользовательИБ.Имя; 
	
	СохраняемоеЗначениеПароля=ПользовательИБ.СохраняемоеЗначениеПароля; 	
	ПозицияРазделителя = Найти(СохраняемоеЗначениеПароля, ",");
	СохраняемоеЗначениеПароля=Лев(СохраняемоеЗначениеПароля, ПозицияРазделителя - 1);
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	СтруктураQR=Новый Структура("Адрес, ПользовательДляСервисов, ПарольДляСервисов, ЛогинПользователя, ПарольПользователя",АдресПубликацииИнформационнойБазыДляТСД,ЛогинСервисы,ПарольСервисы,Имя,СохраняемоеЗначениеПароля);
	
    РаботаСШифрованием.ЗашифроватьСтруктуру(СтруктураQR);  
	
	СтрокаQR=ОбщегоНазначенияТСД.ЗаписатьДанныеВJSON(СтруктураQR); 
	
	ДвДанныеQR=ГенерацияШтрихкода.ДанныеQRКода(СтрокаQR,2,200);
	 
	ОбластьКартинки = Макет.ПолучитьОбласть("СтрокаQR");
	ОбластьКартинки.Параметры.Имя=ПользовательИБ.ПолноеИмя;
	Картинка = Новый Картинка(ДвДанныеQR); 
	ОбластьКартинки.Рисунки.D1.Картинка = Картинка; 
	ТабличныйДокумент.Вывести(ОбластьКартинки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресПубликацииИБПоУмолчаниюНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресПубликацииИБПоУмолчанию(Команда)
	ЗаполнитьАдресПубликацииИБПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПодключения(Команда)
	ЗаписатьКонстанты();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Данные сохранены!");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанты()
	Константы.АдресПубликацииИнформационнойБазыДляТСД.Установить(АдресПубликацииИнформационнойБазыДляТСД);
	Константы.ЛогинДляСервисов.Установить(ЛогинСервисы);
	Константы.ПарольДляСервисов.Установить(РаботаСШифрованием.ЗашифроватьСообщение(ПарольСервисы)); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьQRКоды(Команда)
	Если ПользователиДляПечатиQRКодов.Количество() > 0 Тогда
		СформироватьQRКодыНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните таблицу пользователей для которых нужно распечатать QR-код!");
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура СформироватьQRКодыНаСервере()
	МассивИдентификаторовПользователейИБ = ПолучитьМассивИдентификаторовПользователейИБ();
	ГрупповаяТаблицаQRКодов.Очистить();
	
	Для Каждого ИдентификаторПользователяИБ Из МассивИдентификаторовПользователейИБ Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		ВывестиQRПользователя(ПользовательИБ, ГрупповаяТаблицаQRКодов);	
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьМассивИдентификаторовПользователейИБ()
	МассивИдентификаторовПользователейИБ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_Пользователи
		|ИЗ
		|	&Пользователи КАК Пользователи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Пользователи.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	ВТ_Пользователи КАК ВТ_Пользователи";
	
	Запрос.УстановитьПараметр("Пользователи", ПользователиДляПечатиQRКодов.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивИдентификаторовПользователейИБ.Добавить(Выборка.ИдентификаторПользователяИБ);
	КонецЦикла;
	
	Возврат МассивИдентификаторовПользователейИБ;
КонецФункции




